{"description": "\n<p>Low-resource countries face daunting obstacles to meeting the health care needs of their people. For example, countries in sub-Saharan Africa suffer from 24% of the global disease burden, but have only three percent of the global health workforce to provide necessary services. An effective and well-managed health workforce is critical for improving countries’ health care outcomes. There is a globally recognized need to improve health systems’ productivity, incentives, management, leadership, and performance management. Meeting this need begins with a strong national Human Resource Information System (HRIS) for the health workforce.</p>\n<p>A mature <span class=\"caps\">HRIS</span> for Health ensures a better understanding of the current health workforce picture in a given country. This understanding prepares decision makers to effectively plan for recruitment, training and retention of health professionals. With routine and accurate <span class=\"caps\">HRIS</span> data, they will know enough to deploy the right health workers in the right places to meet their health care needs. Governments can better understand the cost benefit of wise, targeted investments in health care. The <span class=\"caps\">HRIS</span> can then be used to standardize and support ongoing management and support of the health workforce.</p>\n<p>An open source approach to solving health workforce challenges is ideal for developing country environments. Unlike proprietary approaches, open source models ensure a higher level of local capacity-building, innovation and adaptability to local needs. <span class=\"caps\">USAID</span> and their portfolio of IntraHealth-led health workforce projects, championed by the global project CapacityPlus, are bringing open source solutions to the health workforce crisis.</p>\n<p>In our presentation, we will review the technical, political, and social obstacles to strengthening health workforce information in low-resource countries with infrastructure challenges. We will describe the open source iHRIS Suite of national, district, and local <span class=\"caps\">HRIS</span> software, iHRIS Manage, iHRIS Qualify and iHRIS Plan, and how they were designed and developed to meet country needs while facing these challenges. We will explain the role of the iHRIS Appliance in providing a low-cost and low-maintenance solution for providing the iHRIS Suite, as well as review where and how the iHRIS Suite is being implemented.</p>\n<p>Finally, we will describe the role of an <span class=\"caps\">HRIS</span> as one part of a complete Health Information System (HIS). We will briefly overview some of the other components of an <span class=\"caps\">HIS</span> and discuss some of the open standards used for exchanging data between these components, for example <span class=\"caps\">SDMX</span>-HD developed by the World Health Organization. We will discuss the Public Health Information Toolkit (PHIT), which aims to ensure the interoperability of globally recognized open source public health software, including OpenMRS, <span class=\"caps\">DHIS2</span> and iHRIS Manage.</p>\n", "title": "Human Resources Information Systems (HRIS) for Health in Low-Resource Settings", "start_time": "2010-07-21T17:20:00-07:00", "track_id": 25, "user_ids": [1167, 1173], "room_id": 16, "end_time": "2010-07-21T17:40:00-07:00", "id": 1149}