{"description": "\n<p>The <a href=\"http://www.microsoft.com/HealthICT\" title=\"CHP\">Microsoft Connected Health Platform</a> is a collection of technology offerings that include architecture, design and deployment guidance, tools and solution accelerators for the health industry.  <span class=\"caps\">CHP</span> assets are built in alignment with the Microsoft Connected Health Platform – Architecture and Design Blueprints, a set of architecture principles and best practices for building e-Health solutions based on open standards and interoperability at the local, regional or national levels.</p>\n<p>This session will focus on 3 of the major Microsoft <span class=\"caps\">CHP</span> solution accelerators that are available to the developer and technical community on CodePlex.com, the Microsoft Open Source site.</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; Cross Enterprise Document Registry and Repository (XDS.b) from <span class=\"caps\">IHE</span> for enabling document sharing solutions in healthcare <br/>\n&nbsp;&nbsp;&nbsp;&#8226; The Microsoft Common User Interface which provides User Interface Design Guidance and Toolkit controls that address a wide range of patient safety concerns for healthcare organizations worldwide, enabling a new generation of safer, more usable and compelling health applications to be quickly and easily created<br/>\n&nbsp;&nbsp;&nbsp;&#8226; The Clinical Documentation Solution Accelerator (CDSA) that enables developers to create clinically encoded <span class=\"caps\">XML</span> based documents originating from ready-made templates such as Discharge Summary or a Referral using industry standard formats such as the Health Level 7 (HL7) Clinical Document Architecture (CDA)<br/>\n<br/>\n", "title": "Advancing Interoperability, Patient Safety, and Efficiency with the Microsoft Connected Health Platform Open Toolkits", "start_time": "2010-07-23T11:20:00-07:00", "track_id": 25, "user_ids": [2019], "room_id": 16, "end_time": "2010-07-23T11:40:00-07:00", "id": 2001}