{"description": "\n<p><span class=\"caps\">CONNECT</span> is an open source software gateway that allows healthcare practitioners to exchange health-related information, regardless of where they are set up around the country and what computer systems and platforms they use. Originally built by more than 20 federal agencies, this software solution uses Nationwide Health Information Network (NHIN) standards and governance as a framework to connect providers, insurers, federal agencies, states and others.</p>\n<p>Rather than develop dozens of independent solutions with identical and redundant functionality, federal agencies together built <span class=\"caps\">CONNECT</span> through the Federal Health Architecture (FHA) program. The agencies delivered <span class=\"caps\">CONNECT</span> in 2009, and today the open source solution is available to any organization for use free of charge. With the public launch of <span class=\"caps\">CONNECT</span>, FHA created the <span class=\"caps\">CONNECT</span> Open Source Community and began recruiting participation from healthcare providers and payors, states, IT vendors and other stakeholders.</p>\n<p>Today the community is comprised of more than 500 organizations and is growing rapidly. The <span class=\"caps\">CONNECT</span> software and the community are “open” in every sense of the word. The software development process, technology needs definition and even the software itself is open to the community for discussion, improvement and contribution. Anyone with a stake in health IT is welcome to participate and have a voice in a solution that will impact the future of health IT in the U.S.</p>\n<p>This session will provide attendees with an update on the <span class=\"caps\">CONNECT</span> technology solution and an overview of how organizations are using the open source solution to create health information exchanges and tie into the <span class=\"caps\">NHIN</span>.</p>\n", "title": "Open Source’s Role in CONNECTing the Public and Private Sector Healthcare Communities", "start_time": "2010-07-21T13:40:00-07:00", "track_id": 25, "user_ids": [131, 132], "room_id": 16, "end_time": "2010-07-21T14:20:00-07:00", "id": 146}