{"description": "\n<p>During its legislative lifetime, a bill is a living, breathing document. For too long, these documents have existed solely within internal legislative databases and drafting systems. The recent move towards transparency at the State level has been a welcome one, which has produced a variety of online legislative systems, all in varying quality. If legislative data is simply dumped online in arcane formats, than it is only useful for lobbyists groups looking to repackage and resell or extremely motived watchdog groups. While these organizations have as much right to the data as anyone, a modern legislatures goal should be to actively push data out to the places where they constituents might stumble upon it in their regular routines – into Google, Twitter, blogs, social networks and so on. As we look towards the future, we must ask that if a legislature’s own site doesn’t show up in a google search for an active bill, then does it even exist?</p>\n<p>Attendees will learn best practices for designing an an online legislative service that adheres to the principles and requirements of the modern web. To get the most of the talk, you should understand the basic concepts of how blog and content managements services, search engine indexing, extensible markup language (XML) and application programming interfaces (APIs).</p>\n<p>We’ll examine a variety of production online legislation services, including the Washing State Legislative Web Services and the NY State Senate’s Open Legislation service, as well as cover the following specific topics:</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; How to properly format, tag and markup legislative content so that it is optimally indexed<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Look at hyperlinking within the content to provide a “wiki-like” browsing experience<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Investigate formats that data can be made available in: <span class=\"caps\">CSV</span>, SOAP, <span class=\"caps\">JSON</span>, RSS and more!<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Talk about the use and design of Permalinks in relation to both socialization and access via RESTful APIs<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Understand what “separability of links” is and how to implement it, including the use of <span class=\"caps\">URL</span> shorteners<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Examine the Pros and Cons of using a <span class=\"caps\">CMS</span> vs. developing a custom legislative service<br/>\n<br/>\n", "title": "Open Gov 2.0 - How A Bill Becomes a Blog", "start_time": "2010-07-21T10:40:00-07:00", "track_id": 22, "user_ids": [1041, 1047], "room_id": 21, "end_time": "2010-07-21T11:20:00-07:00", "id": 1029}