{"description": "\n<p><strong><a href=\"http://www.oscon.com/oscon2010/public/cfp/118\">Submit a Perl Lightning Talk</a> &#8211; all submissions are due July 22.</strong></p>\n<p>These Lightning Talks are on the Perl track, but are not necessarily about Perl, or even programming for that matter, though hopefully they are of some passing interest to people interested in Perl.  They may be serious, funny, or both.  They may be given by experienced speakers already giving full length talks or tutorials or by first time speakers just starting out (this is a great way to get started if you have something to say).  The topic could even be &#8220;My language <em>_</em> is great and Perl is awful&#8221;, but a talk that bold should probably only be attempted by an experienced speaker.</p>\n<p>We will have about 16 Lightning Talks of 5 minutes each.  Submit your talk through the link at the bottom of this page.  The <strong>first deadline is one week before the conference starts</strong> and many proposals will be accepted.  At least two speaking spots will be held open until the second deadline the day before the talks to give you a chance to see something at the conference and put together a Lightning Talk response.  However if you wait for the second deadline note that there are fewer spots available and you are less likely to be accepted so please try to submit more than a week before the conference.</p>\n<p>In addition to the five minute Lightning Talks where you get to use your computer, slides, and any other tool, we will also have some Lightning Advertisements.  These are only 30 seconds, you don&#8217;t have to submit a proposal, you don&#8217;t get any slides, and the only AV assistance offered is a microphone.  If you have a BoF to announce or any other short message you can use the transition time that would be otherwise wasted between Lightning Talks to share your message.  Just show up before we start and take a seat in the assigned seats in the front of the room.</p>\n<p><strong>Why Would You Want to do a Lightning Talk?</strong></p>\n<p>Maybe you&#8217;ve never given a talk before, and you&#8217;d like to start small. For a Lightning Talk, you don&#8217;t need to make slides, and if you do decide to make slides, you only need to make three.</p>\n<p>Maybe you&#8217;re nervous and you&#8217;re afraid you&#8217;ll mess up. It&#8217;s a lot easier to plan and deliver a five minute talk than it is to deliver a long talk. And if you do mess up, at least the painful part will be over quickly.</p>\n<p>Maybe you don&#8217;t have much to say. Maybe you just want to ask a question, or invite people to help you with your project, or boast about something you did, or tell a short cautionary story. These things are all interesting and worth talking about, but there might not be enough to say about them to fill up thirty minutes.</p>\n<p>Maybe you have a lot of things to say, and you&#8217;re already going to give a long talk on one of them, and you don&#8217;t want to hog the spotlight. There&#8217;s nothing wrong with giving several Lightning Talks. Hey, they&#8217;re only five minutes.</p>\n<p>On the other side, people might want to come to a lightning talk when they wouldn&#8217;t come to a long talk on the same subject. The risk for the attendees is smaller: If the talk turns out to be dull, or if the person giving the talk turns out to be a really bad speaker, well, at least it&#8217;s over in five minutes. With lightning talks, you&#8217;re never stuck in some boring lecture for forty-five minutes.</p>\n<p>Still having trouble picking a topic, here are some suggestions:<br /></p>\n\n&nbsp;&nbsp;&nbsp;&#8226; Why my favorite module is X.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; I want to do cool project X. Does anyone want to help?<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Successful Project: I did project X. It was a success. Here&#8217;s how you could benefit.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Failed Project: I did project X. It was a failure, and here&#8217;s why.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Heresy: People always say X, but they&#8217;re wrong. Here&#8217;s why.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; You All Suck: Here&#8217;s what is wrong with the our community.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Call to Action: Let&#8217;s all do more of X / less of X.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Wouldn&#8217;t it be cool if X?<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Someone needs to do X.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Wish List<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Why X was a mistake.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Why X looks like a mistake, but isn&#8217;t.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; What it&#8217;s like to do X.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Here&#8217;s a useful technique that worked.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Here&#8217;s a technique I thought would be useful but didn&#8217;t work.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Why algorithm X sucks.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Comparison of algorithms X and Y.<br/>\n<br/>\n<p>Of course, you could give the talk on anything you wanted, whether or not it is on this list. If we get a full schedule of nothing but five minutes of ranting and raving on each topic, a good time will still be had by most.</p>\n<p><strong><a href=\"http://www.oscon.com/oscon2010/public/cfp/118\">Submit a Perl Lightning Talk</a> &#8211; all submissions are due July 22.</strong></p>\n<p>See the schedule at <a href=\"http://www.justanotherperlhacker.org/lightning/index.shtml\">http://www.justanotherperlhacker.org/lightning/index.shtml</a>.</p>\n", "title": "Perl Lightning Talks", "start_time": "2010-07-22T16:30:00-07:00", "track_id": 8, "user_ids": [1641], "room_id": 8, "end_time": "2010-07-22T18:00:00-07:00", "id": 1611}