{"description": "\n<p>Red Hat is admired as a successful business that is an effective catalyst in communities, especially free/libre open source software (FLOSS). People look to learn from Red Hat in how to apply those practices to areas beyond software, such as education, business, and social activism.</p>\n<p>However, when we look at the way other people have enacted these practices, many have adopted a subset of Red Hat&#8217;s methods, but leave out enough to affect their ability to benefit from a purely free/open stance.</p>\n<p>Many communities are successful in their domain without any idea of why their methods work. Is it pure luck or art? Or is it really a dose of humanism mixed with a long-practiced, and now well studied, method of developing communities?</p>\n<p>This presentation explores the science behind &#8220;communities of practice&#8221;, then covers a specific set of guidelines included in a new open, community-written guide, &#8220;The Open Source Way: Creating and nurturing communities of contributors&#8221;.</p>\n<p>To start, this presentation lays out the methods used by Red Hat in community development, which follow the well-studied methods of &#8220;communities of practice.&#8221;  The theory of <a href=\"http://en.wikipedia.org/wiki/Community_of_practice\">communities of practice</a> is explained with examples.</p>\n<p>Next is covered a specific set of guidelines for practicing the open source way in communities.  This is all brought together in a short guide, &#8220;The Open Source Way: Creating and nurturing communities of contributors&#8221;, which is an open, community-written guide for following the open source way in any type of community effort.</p>\n<p>The Community Architecture team at Red Hat is accountable for helping the rest of the organization define and act upon community plans, and learn from each others&#8217; community failures and successes.  In essence, to learn from and teach Red Hat how and why we&#8217;ve been successful, and how to continue doing it.  One thing we&#8217;ve learned, it is easier to teach something internally when it&#8217;s a common practice externally.  When we wrote the first round of &#8220;The Open Source Way&#8221; for an internal audience, we realized it benefited from being written externally and with an invitation to others to join our effort.</p>\n<p>While there are other books written on how communities are successful, and other books written by multiple members of a community, we think this presents a new opportunity for a community book written by a community.  It is short, to the point, and useful immediately.  It presents a principle, how it is applied, and a real world example.  It does not focus exclusively on <span class=\"caps\">FLOSS</span>, but is applicable to anyone interested in applying the open source way in whatever domain they practice in.  It does not look to replicate other efforts but to reference and build upon commonly useful works, such as Karl Fogel&#8217;s &#8220;Producing <span class=\"caps\">OSS</span>&#8221;.</p>\n", "title": "Being a Catalyst in Communities - The Science Behind the Open Source Way", "start_time": "2010-07-23T11:50:00-07:00", "track_id": 10, "user_ids": [92], "room_id": 7, "end_time": "2010-07-23T12:30:00-07:00", "id": 321}