{"description": "\n<p>vxVistA.org is a Collaboration Environment designed for the community of present and future VistA and vxVistA users and developers. The main purpose of this environment is to provide the tools needed for:</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; learning more about vxVistA <br/>\n&nbsp;&nbsp;&nbsp;&#8226; participating in the enhancement process<br/>\n&nbsp;&nbsp;&nbsp;&#8226; sharing ideas and best practices<br/>\n&nbsp;&nbsp;&nbsp;&#8226; proposing new projects<br/>\n&nbsp;&nbsp;&nbsp;&#8226; developing new modules and functionalities<br/>\n&nbsp;&nbsp;&nbsp;&#8226; creating new <span class=\"caps\">GUI</span> Mockups<br/>\n&nbsp;&nbsp;&nbsp;&#8226; designing and improving workflows<br/>\n&nbsp;&nbsp;&nbsp;&#8226; promoting professional services and new modules<br/>\n&nbsp;&nbsp;&nbsp;&#8226; and more…<br/>\n<br/>\n<p>Starting with the end in mind: “Our community members deserve the best collaboration tools available in the market” the vxVistA.org development team researched multiple suites of collaboration tools. Out of all the options in the market we decided that the Atlassian suite of products and plug-ins are the best combination of functionalities for the vxVistA Open Source Collaboration Community.</p>\n<p>We are currently using the following plug-ins:</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; Balsamiq Mockups<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Gliffy diagrams <br/>\n&nbsp;&nbsp;&nbsp;&#8226; Adaptavist Community Bubbles<br/>\n&nbsp;&nbsp;&nbsp;&#8226; TaskDock<br/>\n&nbsp;&nbsp;&nbsp;&#8226; TagCumulus by Herman de Boer<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Ad hoc workflows<br/>\n<br/>\n<p>This presentation will explore how the Atlassian Confluence tool and plug-ins work to create an environment that encourages innovation and partnership between users, vendors, developers, and subject matter experts from many disciplines. The vxVistA.org site fosters interaction between Free Open Source (FOSS) clients and Commercial Open Source (COSS) clients.</p>\n<p>We will also cover how we are integrating the Atlassian <span class=\"caps\">JIRA</span> into the vxVistA.org site for community logging and tracking of issues/bugs. This is Phase II of our roll-out of the vxVistA.org site, originally released in late 2009, with our eventual goal of creating a shared development and code management environment for both <span class=\"caps\">GUI</span> development and <span class=\"caps\">CHUI</span> development.</p>\n<p>vxVistA.org is sponsored by <span class=\"caps\">DSS</span>, Inc. and Open Health Tools. During the design and development phase of this project, experts in collaboration from all around the world including <span class=\"caps\">USA</span>, Argentina, Italy, Australia, Canada, Germany, England and Netherlands, joined forces to support this effort. Companies and Individuals donated their time and software licenses to make this happen.</p>\n", "title": "vxVistA.org Community Collaboration Web Portal Uses Atlassian Open Source Web Tools to Deploy vxVistA-OS EHR", "start_time": "2010-07-22T11:50:00-07:00", "track_id": 25, "user_ids": [1419, 1425, 1431], "room_id": 16, "end_time": "2010-07-22T12:10:00-07:00", "id": 1401}