{"description": "\n<p>Not a day goes by without alarming reports of increasingly sophisticated cyber attacks on government networks. The reality of these attacks seems to be at odds with government efforts to promote more openness and transparency, but the fact remains that federal agencies ranging from the <span class=\"caps\">NSA</span> to <span class=\"caps\">DISA</span> still must take proactive steps to ensure that authorized users have access to authorized information at the authorized time.</p>\n<p>Open source technology ensures that government agencies can implement the best solutions for their needs without many of the security, interoperability and cost challenges associated with proprietary products. In fact, some of the most innovative network security, traffic analysis, traffic management, application acceleration and mobility solutions are available to government agencies as open source software applications. The enabling technology at the core of many of these applications is deep packet inspection (DPI), which allows for unprecedented visibility into and control over data traversing the network.</p>\n<p>Faced with a new generation of network threats, government IT managers are finding that traditional perimeter security tools leave their networks exposed to threats from outside and inside the agency. With <span class=\"caps\">DPI</span>-enabled open source applications, government IT managers can set network policy that is customized according to the agencyâ&euro;&trade;s unique needs and requirements.</p>\n<p>Implementing a multi-application platform as the foundation for <span class=\"caps\">DPI</span>-enabled applications ensures minimal porting effort and optimal performance. Moreover, businesses that provide government agencies with these technologies experience significantly reduced product development costs and time-to-market.</p>\n<p>This presentation will explore:</p>\n\n&nbsp;&nbsp;&nbsp;&#8226;    How government agencies can make the most of innovative open source technologies now and into the future.<br/>\n&nbsp;&nbsp;&nbsp;&#8226;    Open source network security, traffic analysis, traffic management, application acceleration and mobility solutions that are enabled by deep packet inspection capabilities.<br/>\n&nbsp;&nbsp;&nbsp;&#8226;    Government agency best practices in implementing open source applications on <span class=\"caps\">DPI</span>-enabling network appliances with Linux-based execution environments.<br/>\n<br/>\n", "title": "Multi-Application Platforms and the Future of Open Source Applications in Government Agencies", "start_time": "2010-07-22T17:20:00-07:00", "track_id": 22, "user_ids": [276], "room_id": 21, "end_time": "2010-07-22T18:00:00-07:00", "id": 283}