{"description": "\n<p>Building modern Java™ technology-based Web applications that expose your business services to the widest-possible audience has become an increasingly difficult task in this day of Ajax, <span class=\"caps\">RIA</span>, and <span class=\"caps\">SOA</span>. Complexity continues to rise as we work to build flexible architectures that can serve the needs of an increasing number of client screens and a potentially exploding number of consuming devices. Spring 3.0 continues to strive to bring you effective weapons in the battle against complexity, including a complete modular stack of Web-focused solutions for addressing the needs of <span class=\"caps\">REST</span>, Ajax, <span class=\"caps\">RIA</span>, and stateful Web-based conversations.</p>\n<p>In this session, you will learn how to:\nFor more information related to this topic, visit:\nhttp://blog.springsource.com/2008/07/17/developing-rich-web-applications-with-spring/</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; Build Web applications using the RESTful Spring 3.0 @MVC annotation-based programming model<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Expose multiple representations of the same resource, including <span class=\"caps\">HTML</span>, XML, JavaScript™ Object Notation (JSON), and Atom, to service multiple client types without the need for specialized handling in server-side controller code<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Use Spring JavaScript technology and the Dojo toolkit to consume your RESTful Spring resources, using unobtrusive Ajax techniques<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Easily connect your existing RESTful Spring resources to <span class=\"caps\">RIA</span> technologies such as JavaFX™ technology<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Seamlessly integrate stateful Java technology-based flows from Spring Web Flow 3.0 where appropriate<br/>\n<br/>\n", "title": "Building Next Generation Web Applications with the Spring 3.0 Web Stack", "start_time": "2010-07-23T11:50:00-07:00", "track_id": 11, "user_ids": [309], "room_id": 5, "end_time": "2010-07-23T12:30:00-07:00", "id": 319}