{"description": "\n<p><strong>Introduction</strong></p>\n<p>This presentation will discuss past and present work by engineers from the <span class=\"caps\">NASA</span> Jet Propulsion Lab (JPL) to apply their open source Object Oriented Data Technology (OODT) to health care domains.  Andrew Hart of <span class=\"caps\">JPL</span> will give a 30 minute talk that focuses on the technology of <span class=\"caps\">OODT</span> and introduces two distinct applications of <span class=\"caps\">OODT</span> to health care: the Early Detection Research Network, a collaboration with the National Cancer Institute (NCI), for sharing of cancer biomarker data; and ongoing work with the Laura P. and Leland K. Whittier Virtual Pediatric Intensive Care Unit (Whittier <span class=\"caps\">VPICU</span>) at Children’s Hospital Los Angeles (CHLA) to create a grid-based data management system for intensive care data.  After the talk, Heather Kincaid of <span class=\"caps\">JPL</span> and David Kale of <span class=\"caps\">CHLA</span> will join Andrew for a 15 minute question-and-answer panel about these projects.</p>\n<p>The talk will follow this rough outline:</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; Lay out the challenges of managing health data, for research and decision support (proprietary schema, fragmented across multiple stores, new data added continuously)<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Introduction to <span class=\"caps\">JPL</span>’s <span class=\"caps\">OODT</span><br/>\n&nbsp;&nbsp;&nbsp;&#8226; Fundamental technologies and strategies of <span class=\"caps\">OODT</span> framework and paradigm<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Brief overview of <span class=\"caps\">EDRN</span>, a successful and mature deployment of <span class=\"caps\">OODT</span> to the problem of sharing biomarker data nationally<br/>\n&nbsp;&nbsp;&nbsp;&#8226; More detailed description of ongoing <span class=\"caps\">OODT</span> deployment at <span class=\"caps\">CHLA</span>, including comprehensive ontology and national data-sharing network involving multiple PICUs<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Q&#38;A<br/>\n<br/>\n<p><strong>Importance of our project</strong></p>\n<p>Existing health care data standards are often proprietary, complex, or designed with billing, not research or sharing, in mind. There are also a variety of efforts underway to make health care data more portable, but most of these efforts focus on personal health care records. These efforts are important and valuable, but they do not address the issue of making massive stores of granular clinical data easier to share and analyze in clinical and research settings. Our work is focused on this latter issue, with the goal of enabling the next generation of data-driven decision support tools by combining data from disparate data sources and across multiple institutions. The pediatric intensive care unit (PICU) is the perfect setting for this, as PICUs have a higher rate of adoption of electronic health records (EHRs) and information systems and are used to collaborating on a national level.</p>\n<p><strong>Extended abstract for our project</strong></p>\n<p>Modern health care information is highly heterogeneous, distributed, and difficult to leverage in downstream analyses that are critical to quality of patient care, including diagnosis, treatment, and outcome prediction. There are many data types to deal with (medical flowsheets, free text notes, lab results, measurements recorded by clinicians and automatically captured by instruments, waveforms) and a variety of competing standards and formats for organizing and transmitting this data (HL7, <span class=\"caps\">SNOWMED</span>, ICD-9, <span class=\"caps\">UMLS</span>) &#8211; not to mention proprietary and vendor-specific stores. The information landscape is growing at a rapid pace, but medical informatics nevertheless lags far behind other domains in its ability to leverage massive amounts of data to improve service and build effective data-driven tools. One of the largest obstacles to a medical information revolution is inaccessible data locked in proprietary silos, unavailable to clinicians, researchers, and information systems alike. Any progress will require that this information be unlocked from independent systems that collect and manage it.</p>\n<p><span class=\"caps\">NASA</span>’s Jet Propulsion Laboratory (JPL) and the Whittier Virtual Pediatric Intensive Care Unit (Whittier <span class=\"caps\">VPICU</span>) group at Children’s Hospital Los Angeles have been collaborating since 2003 in the development of open source grid software for the description, organization, management, sharing, and analysis of highly granular data from pediatric intensive care units (PICUs). We are leveraging one of <span class=\"caps\">NASA</span>’s flagship grid software technologies, the Object Oriented Data Technology (OODT) framework, to assist in this regard. <span class=\"caps\">OODT</span> is hosted at the Apache Software Foundation (ASF) and is a podling within the Apache Incubator. <span class=\"caps\">OODT</span> provides a set of loosely coupled components for data capture, discovery, access, and distribution that can be instantiated and connected via modern web protocols and data formats (REST, <span class=\"caps\">RDF</span>, etc.) for a particular deployment in a domain. The <span class=\"caps\">OODT</span> framework enables <span class=\"caps\">CHLA</span> clinicians, researchers, and software to access large amounts of data from a variety of proprietary sources (e.g., hospital-wide <span class=\"caps\">EHR</span> systems, bedside monitors, unit-specific applications, homegrown databases) in a unified manner and can be extended readily to enable sharing of data between institutions.</p>\n<p>Besides <span class=\"caps\">OODT</span>, our project plans to utilize other open source software, including search technologies from Apache Lucene (Solr, Tika, etc.), and common platforms (Ubuntu, Redhat, etc.) as a means for building reliable, value-added software at low cost. We also have begun development of a common semantic architecture for describing similar data from disparate sources, and we plan to continue expanding this into a comprehensive ontology for all <span class=\"caps\">PICU</span> clinical data and to share it as a free, open standard.</p>\n<p>Our long-term goal is to construct a national distributed data-sharing network to drive the next generation of research into data-driven decision support tools and comparative effectiveness and outcomes analysis. Whittier <span class=\"caps\">VPICU</span> and <span class=\"caps\">JPL</span> both have experience in building such national collaborative networks: <span class=\"caps\">CHLA</span> helped to develop a network of over 80 PICUs that share limited datasets for performance evaluation; <span class=\"caps\">JPL</span> has used <span class=\"caps\">OODT</span> to construct a variety of scientific data sharing networks, including the National Cancer Institute’s Early Detection Research Network (EDRN).</p>\n<p>In this talk, we will discuss the current state of <span class=\"caps\">OODT</span> and its successful deployment in projects such as <span class=\"caps\">EDRN</span>, the motivation for its use as a means of unlocking and unifying health data at <span class=\"caps\">CHLA</span> and across other institutions, and our experiences in leveraging open source software to provide a foundation for building advanced data-driven clinical decision support systems to improve the quality of pediatric intensive care going forward.</p>\n<p><strong>Listen to a <a href=\"http://radar.oreilly.com/2010/06/harnessing-open-source-grid-so.html\">podcast interview</a> with Chris Mattmann about objected-oriented data technology (OODT) and health IT on O&#8217;Reilly Radar.</strong></p>\n", "title": "Distributed, Modular Grid Software for Management and Exploration of Data in Patient-Centric Healthcare IT", "start_time": "2010-07-22T10:40:00-07:00", "track_id": 25, "user_ids": [1287, 1293, 1299], "room_id": 16, "end_time": "2010-07-22T11:20:00-07:00", "id": 1287}