{"description": "\n<p>If you&#8217;ve heard of Perl, you&#8217;ve probably heard of <span class=\"caps\">CPAN</span>. But did you know that <span class=\"caps\">CPAN</span> comes with a free QA team? <span class=\"caps\">CPAN</span> Testers is a large-scale, distributed, grass-roots project to continuously collect and syndicate Perl library tests from over 80 different platforms and every version of Perl since 5.6.</p>\n<p>Over 150 volunteers test the 20,000 libraries already on <span class=\"caps\">CPAN</span> plus 1,000 new uploads each month. Over 6.5 million test reports have been collected to date and over 400,000 more arrive each month. Within days of a library arriving on <span class=\"caps\">CPAN</span>, it will be tested dozens of times. And it&#8217;s all free&#8212;free as in speech and free as in beer.</p>\n<p>Where did this project come from? Why did it succeed? How is it benefiting Perl users and developers? And what can other <span class=\"caps\">FOSS</span> projects learn (or steal) from <span class=\"caps\">CPAN</span> Testers?</p>\n<p>This talk uses <span class=\"caps\">CPAN</span> Testers as a case study to explore four important practices for large-scale, volunteer QA projects.</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; <strong>Building for your culture</strong>: why a culture of testing matters and how not to alienate people with (unsolicited) QA<br/>\n&nbsp;&nbsp;&nbsp;&#8226; <strong>Getting people hooked</strong>: how to attract new participants and how to keep them motivated through feedback and competition<br/>\n&nbsp;&nbsp;&nbsp;&#8226; <strong>Freeing the data</strong>: why public QA benefits the community and how innovative mashups are changing the way developers use QA<br/>\n&nbsp;&nbsp;&nbsp;&#8226; <strong>Designing for change</strong>: how volunteer projects can plan for growth and how to use cheap cloud services as a force multiplier<br/>\n<br/>\n", "title": "Free QA! What FOSS can Learn from CPAN Testers", "start_time": "2010-07-23T10:00:00-07:00", "track_id": 10, "user_ids": [1875], "room_id": 20, "end_time": "2010-07-23T10:40:00-07:00", "id": 1839}