{"description": "\n<p>Open source and education is a vast space; these five projects highlight a broad range of perspectives and approaches for teaching students <strong>how to become open source contributors</strong>.</p>\n<p>This talk covers:</p>\n<p>Humanitarian <span class=\"caps\">FOSS</span> (HFOSS): How do you get <span class=\"caps\">FOSS</span> work to have academic credibility? Answer: get a group of computing faculty together to get their departments&#8217; work in open source funded by massive grants.</p>\n<p>Undergraduate Capstone Open Source Projects (UCOSP): The classic senior capstone project, redefined &#8211; and for fields beyond computing, too.</p>\n<p>Professors&#8217; Open Source Summer Experience (POSSE): How do professors learn to teach their students open source, where students work on topics their teachers don&#8217;t know and the primary skill is learning to <em>be productively lost</em>? <span class=\"caps\">POSSE</span> is a weeklong bootcamp that immerses professors in open source projects so they can learn how to get their students involved.</p>\n<p>Teaching Open Source (TOS): Where does the community of practice for teaching <span class=\"caps\">FOSS</span> contribution gather? Here &#8211; <a href=\"http://teachingopensource.org/index.php/Main_Page\">TeachingOpenSource.org</a> (TOS). <span class=\"caps\">TOS</span> is a neutral collaboration point for professors, institutions, communities, &#38; companies around the practice of teaching open source. Within <span class=\"caps\">TOS</span>, Carnegie Mellon University (CMU) and the Rochester Institute of Technology (RIT) provide contrasting case studies on how schools large and small can integrate <span class=\"caps\">FOSS</span> into the fabric of their teaching and learning, both from the top-down and the bottom-up.</p>\n<p>SoaS: How do we lower the barrier to <span class=\"caps\">FOSS</span> contribution even for the very young with limited access to computing? Sugar on a Stick (SoaS) is a project that gives children the power to run their own version of the Sugar Learning Environment from a live-bootable <span class=\"caps\">USB</span>. The kicker: the engineering team is led by a high school student.</p>\n<p>The Red Hat Community Architecture team will present an overview of how this eigenset of projects spans the Free/Open Source Software In Education space, and point out areas of opportunity for new projects to take root.</p>\n", "title": "5 FOSS in Edu Projects that Changed the World", "start_time": "2010-07-21T10:40:00-07:00", "track_id": 21, "user_ids": [39, 92], "room_id": 19, "end_time": "2010-07-21T11:20:00-07:00", "id": 109}