{"description": "\n<p>Student contribution to open source software projects has great potential to benefit both the projects and the students. While it may take some effort on the part of the <span class=\"caps\">OSS</span> community to bring students up to speed, students bring many advantages to the table including a larger pool of volunteers, a potentially more diverse development community, relieving more experienced developers from repetitive tasks, and added incentive to complete tasks due to grading requirements. In addition, students are supported in their participation by the academic infrastructure so that they are not relying solely on the <span class=\"caps\">OSS</span> community for learning. <span class=\"caps\">OSS</span> projects can serve as a training ground for future <span class=\"caps\">OSS</span> developers, integrating students into the <span class=\"caps\">OSS</span> community while still in school.</p>\n<p>Open source provides an exciting opportunity for computing education by providing a range of different types of projects that students can become involved in. The benefits of participation in <span class=\"caps\">OSS</span> projects are myriad for the student including exposure to an on-going, complex application, professional growth, improved technical and communication skills, better understanding of development in a distributed environment and many more.</p>\n<p>The typical view of student contributions to <span class=\"caps\">OSS</span> projects is in the form of code contributions. However, students with a range of backgrounds can contribute to an <span class=\"caps\">OSS</span> project in ways other than adding code. Some of these ways include testing, documentation, bug validation, internationalization/translation of documentation, exploring and detailing feature requests, usability assessment, accessibility assessment, penetration assessment and reverse engineering requirements and design from code.</p>\n<p>In order to facilitate the involvement of students in <span class=\"caps\">OSS</span> projects, there is a need for identifying and recruiting mentors from the <span class=\"caps\">OSS</span> projects. Such mentors would provide a gateway into <span class=\"caps\">OSS</span> projects for both students and professors by supplying entree into the development environment and community. An online clearinghouse would be an ideal solution for matching students and opportunities posted by mentors and maintainers of <span class=\"caps\">OSS</span> projects.</p>\n<p>This talk will cover the dual perspectives of student and <span class=\"caps\">OSS</span> community with respect to student contributions to <span class=\"caps\">OSS</span> projects. The variety of different ways that students can become involved in a <span class=\"caps\">OSS</span> project will be discussed as well as the benefits and roadblocks to student involvement from both perspectives. The talk will also address the &#8220;fit&#8221; of student expectation and skills with the <span class=\"caps\">OSS</span> community needs and expectations. The intended audience for this talk is <span class=\"caps\">OSS</span> developers and project leaders and academics interested in involving students in <span class=\"caps\">OSS</span>.</p>\n", "title": "Opportunities for Students to Contribute to FOSS Projects", "start_time": "2010-07-22T14:30:00-07:00", "track_id": 21, "user_ids": [1455, 1539, 1545], "room_id": 19, "end_time": "2010-07-22T15:10:00-07:00", "id": 1521}