{"description": "\n<p>Peer 2 Peer University and Mozilla Drumbeat are working together to develop the ultimate way to learn the craft of open and standards-based web development. This way is the <span class=\"caps\">P2PU</span> School of Web Craft.</p>\n<p>We&#8217;re taking <span class=\"caps\">P2PU</span>&#8217;s model of peer run, free online courses and using this as the platform to teach skills from static <span class=\"caps\">HTML</span> sites all the way to advanced social web applications. Courses focus on project based learning in a peer environment and are proposed, developed and led by web development practitioners â&euro;&ldquo; so the content is always up to date with the latest technologies.</p>\n<p>Over the next 18 months we&#8217;ll be working to fine-tune a curriculum of courses that give learners a pathway from being a novice web developer, to an advanced technical ninja with hacker skills. We&#8217;ll also be developing a new way of assessing and recognising skills and knowledge which is focussed on project portfolios, hacker ethics and developer challenges, rather than hours spent in front of a book followed by a meaningless exam.</p>\n<p>This September we&#8217;ll be launching our first full round of six week courses that range from Web Development 101 to Learning to Read Code (Better). We&#8217;re inviting you to join our community as a course leader (proposals for September close this coming Monday &#8211; July 12!), web development expert and of course, as a course participant. \nWe want your feedback and course ideas! This session will provide an opportunity for you to learn about and provide input on the <span class=\"caps\">P2PU</span> School of Web Craft approach. You&#8217;ll also have a chance to propose and discuss specific course ideas&#8212;you can even get involved in running a course yourself.</p>\n", "title": "P2PU School of Web Craft", "start_time": "2010-07-19T19:00:00-07:00", "track_id": 14, "user_ids": [320], "room_id": 13, "end_time": "2010-07-19T20:00:00-07:00", "id": 333}