{"description": "\n<p>In this talk, you&#8217;ll learn how the <span class=\"caps\">CPAN</span> process works and how you can harness that. Part of the talk will demonstrate the current state of <span class=\"caps\">DPAN</span>, the tools that let you make your own <span class=\"caps\">CPAN</span>, and some of it will talk about the continuing development of these tools.</p>\n<p><span class=\"caps\">CPAN</span> is Perl&#8217;s killer feature, but it&#8217;s also risky. <span class=\"caps\">CPAN</span> tools always want to install the latest versions of everything, but you might not want to spend most of your development time resolving upgrade issues. <span class=\"caps\">CPAN</span> versions overwrite local bug fixes. <span class=\"caps\">CPAN</span> Authors can remove distributions that you depend on. Other people might not patch their code as quickly as you need the fixes. When you use <span class=\"caps\">CPAN</span>, you tie the health of your application to a network of third-party programmers you don&#8217;t control and may not be thinking about your interests.</p>\n<p>The <span class=\"caps\">CPAN</span> tools don&#8217;t care where you get your distributions, so you can create your own <span class=\"caps\">CPAN</span> repository without giving up the tools. That&#8217;s where &#8220;DPAN&#8221;, the (Distributed|Dark|Decentralized)PAN reduces your risk. Put all of the distributions you want to use in a directory, run the dpan script, and then point the same <span class=\"caps\">CPAN</span> tools at the repository it created for you.</p>\n<p>Since it&#8217;s your repository, you manage it however you like. You can even create multiple <span class=\"caps\">DPAN</span> repositories, one per project if you like. With a stable repository, you can focus on the work that matters to you rather than managing external code.</p>\n", "title": "Reduce your Risk by Creating your Own CPAN", "start_time": "2010-07-22T10:40:00-07:00", "track_id": 8, "user_ids": [23], "room_id": 8, "end_time": "2010-07-22T11:20:00-07:00", "id": 202}