{"description": "\n<p>Biology is the next important area where open source models could substantially advance progress and solve existing challenges. DIYbio genomics is the idea of having open collaboration platforms for citizen science using genomic data. Enough individuals are in possession of <span class=\"caps\">SNP</span> genotyping data from direct-to-consumer genomic services such as 23andme, deCODEme, Navigenics, etc., that collaborative citizen science projects can begin. Collaborations could extend to a number of domains including ancestry, health conditions, and athletic performance.</p>\n<p>Personal genome research could both replicate and extend existing academic studies and look for new associations between genomic profiles and disease. Citizen scientists could explore and identify different kinds of phenotypic data to collect and apply in attempts to make genomic data meaningful and useful. The benefits of opening up datasets to the wisdom of the crowds could be expected with open personal genomic research.</p>\n<p>DIYbio genomics has a number of interesting technical challenges. Data files are large and unwieldy. Security is tantamount. Mechanisms are needed for de-identifying and sharing data. Automated referencing and annotation tools are needed.</p>\n<p>There are several examples of personal genome citizen science projects. First could be applying the information in a <span class=\"caps\">WIRED</span> article <a href=\"http://www.wired.com/wiredscience/2009/10/genetically-bad-driving/\">Don’t tell Geico, you may be a natural born bad driver</a>. DIYbio scientists could look up their genotype value for the relevant <span class=\"caps\">SNP</span> (rs6265) on the <span class=\"caps\">BDNF</span> gene and match this with actual driving records.</p>\n<p>A second project a Silicon Valley-based DIYbio team is starting to look into is Vitamin <span class=\"caps\">B12</span> deficiency. The two relevant SNPs on the <span class=\"caps\">MTHFR</span> gene, rs1801133 and rs1801131, are genotyped by 23andme and maybe also by deCODEme and Navigenics. The first step is looking up genotype values for these SNPs.</p>\n<p>A third project opportunity is applying existing genetic association studies to peer cohorts, for example, a <a href=\"http://www.bumc.bu.edu/centenarian/\">Boston University centenarian study</a>. Part of this study found <a href=\"http://www.ncbi.nlm.nih.gov/pubmed/20011587\">18 SNPs on the <span class=\"caps\">ADARB1</span> and <span class=\"caps\">ADARB2</span> genes for <span class=\"caps\">RNA</span> editing</a> associated with centenarians. Citizen scientists could identify individuals with the favorable genotypes for these SNPs and investigate corresponding phenotypic biomarkers of aging.</p>\n<p>Even better than having low-cost <span class=\"caps\">DNA</span> sequencing tests for consumers would be being able to self-genotype in DIYbio labs as <a href=\"http://www.boston.com/news/science/articles/2009/05/11/do_it_yourself_genetic_sleuthing/\">Katherine Aull did for hemochromatosis</a>.</p>\n<p>References:</p>\n<p><a href=\"http://futurememes.blogspot.com/2010/01/personal-genome-citizen-science.html\">Personal Genome Citizen Science</a></p>\n<p><a href=\"http://www.slideshare.net/lablogga/personal-genomes-what-can-i-do-with-my-data\">Personal Genomes: What Can I Do With My Data?</a></p>\n<p><a href=\"http://melanieswan.com/documents/GiM.pdf\">Swan, M. Multigenic Condition Risk Assessment in Direct-to-Consumer Genomic Services. Genet. Med. 2010, in press.</a></p>\n", "title": "DIY Genomics: an open platform for citizen science", "start_time": "2010-07-21T17:40:00-07:00", "track_id": 25, "user_ids": [1197], "room_id": 16, "end_time": "2010-07-21T18:00:00-07:00", "id": 1167}