{"description": "\n<p>No one can afford lawyers. Individuals, professionals and small businesses can’t afford lawyers. Startups can’t afford lawyers. Big companies with large budgets for legal services struggle to afford lawyers. Even lawyers complain, genuinely, that they can’t afford lawyers.</p>\n<p>LexPublica aims to solve this problem by opening up the world of legal knowledge to everyone.</p>\n<p>The first step we&#8217;re taking is to make common contract templates available free of charge. A community of volunteers collaborates to create the contracts, which include agreements that many businesses need, such as consulting agreements and confidentiality agreements (also known as non-disclosure agreements or NDAs). The contract templates are written in plain language and have supporting guides to help you use them properly.</p>\n<p>Along with the contract templates, we provide other information about contracts and the law to help you make informed decisions. With that, you can also make a better decision about when you want to prepare a contract yourself and when you want to consult a lawyer.</p>\n<p><b>Online community to create global legal commons</b></p>\n<p>Tackling an enterprise of this magnitude requires an enormous team effort. LexPublica needs to be a global online community of lawyers and non-lawyers working together to create contract templates and informational guides for those templates.</p>\n<p>Our grand vision is to harness this community effort to create the reference source for contract templates and for practical legal information, and beyond that, for all legal knowledge across all areas of law. You might call it a global legal commons.</p>\n<p><b>Open approach</b></p>\n<p>We’ll be using best practices for collaborative online platforms and content, like open APIs, open formats, open standards and Creative Commons licensing.</p>\n<p>To learn more, visit <a href=\"http://lexpubli.ca/\">http://lexpubli.ca</a>.</p>\n", "title": "LexPublica: Open Sourcing the Law", "start_time": "2010-07-21T16:30:00-07:00", "track_id": 22, "user_ids": [160, 161], "room_id": 21, "end_time": "2010-07-21T17:10:00-07:00", "id": 172}