{"description": "\n<p>Citizen involvement with Gov 2.0 via online interactions requires trustâ&euro;&rdquo;trust by citizens that their identity and data is protected by government websites, and trust by government websites that private account data (taxes, Social Security, Medicare, health records) is accessed only by the correct citizen (or their delegate). This is a hard problem to solve internet-wide, harder still if the goal is to avoid requiring governments to act as a huge centralized identity provider.</p>\n<p>Since March of this year, the OpenID and the Information Card Foundations have collaborated on responding to US government identity standards adoption and certification requirements. In September 2009 the U.S. General Services Administration (GSA) established a Trust Framework Provider Adoption Process (TFPAP) as a key step to enable citizens to easily and safely engage with government websites.  The impact of this work with the government can be seen in the first set of deliverables at www.IDmanagement.gov.</p>\n<p>The public private collaboration has resulted in a solution called; Open Identity. This talk will describe the Open Identity Framework approach created to meet the identity and security certification requirements of the federal government while also meeting the privacy and usability requirements of citizens and private industry.  The presentation will describe how a new non-profit certification organization, the Open Identity Exchange (OIX), is implementing the Open Identity Framework to certify OpenID and Information Card services from identity providers such as Google, PayPal, Yahoo, and Equifax for U.S. government agencies such as the National Institute of Health, the National Library of Medicine, and the Library of Congress. The talk will conclude by describing how <span class=\"caps\">OIX</span> and the Open Identity Framework can work at all levels of government and at all Levels of Assurance (LOA) required by the government as well as all Levels of Protection (LOP) required by citizens and industry.</p>\n", "title": "Open Identity for Open Government", "start_time": "2010-07-23T11:00:00-07:00", "track_id": 22, "user_ids": [306], "room_id": 21, "end_time": "2010-07-23T11:40:00-07:00", "id": 315}