{"description": "\n<p>Business Intelligence (BI) products continue to improve on delivering instant analytics to support business decisions. Today&#8217;s BI platforms have more functionality than ever with dashboards, customizable reporting and more data flexibility. Yet only 15% of knowledge workers are actually using BI tools. With such low penetration numbers, how intelligent are businesses really becoming? Before any BI initiative can begin improving sales results, optimizing operational expenses or otherwise saving the enterprise, it must be conceived, funded, assembled, configured and deployed. Even if budgets are allocated, businesses may wait months while all the other steps are taken, especially if infrastructure — servers, operating systems, database platforms, BI technology and all the resources needed to support them — isn&#8217;t configuring and maintaining infrastructure has eased significantly.</p>\n<p>Because the entire hardware and software cycle is either outsourced in a public cloud such as Amazon&#8217;s <span class=\"caps\">EC2</span>, RackSpace, and Terremark or managed more efficiently with private cloud products, for example CA Technologies&#8217; 3tera, VMware&#8217;s vCloud, Red Hat, Cloud.com, and Eucalyptus — IT units can focus on applications and solutions. Cloud management solutions further enable ease of cloud deployment and management. Technical teams can also ramp up and down quickly thanks to elastic deployments, without the delays and costs typically associated with hardware and software acquisition. But while the payoff for delivering BI in the cloud may be obvious, going it alone into the cloud can be challenging. By cooperating with technology partners, developing a fully-functional BI stack — one that&#8217;s truly affordable — is possible. <a href=\"www.jaspersoft.com\">Jaspersoft&#8217;s</a> work with other vendors to provide a cloud-based BI platform, available and consumed on demand, demonstrates how BI can transform cloud-based services from a pie-in-the-sky idea, to a practical application that&#8217;s the perfect fit for the current economic environment.</p>\n<p><strong>Sponsored by Jaspersoft</strong></p>\n", "title": "Business Intelligence in the Cloud", "start_time": "2010-07-21T13:40:00-07:00", "track_id": 23, "user_ids": [843], "room_id": 22, "end_time": "2010-07-21T14:20:00-07:00", "id": 843}