{"description": "\n<p>Businesses today have access to an unimaginable amount of user data and content, both structured and unstructured. The frustration is that most can’t quite reach or understand the value of the data with the search tools they’re currently using. In this presentation, CommonPlaces’ Ben Bassi will share his strategies for discovering the nuggets of business intelligence through data collaboration and dynamic filters that aggregate both internal data and the wealth of user generated content on the Web.</p>\n<p>Like panning for gold, intelligently analyzing your data is a four-step process: Prospecting, Mining, Extracting, and Refining.   In this presentation, you’ll learn how to uncover insights that elude simple search, find hidden connections in your data, spot potential issues sooner, and discover new ways to create value for your community and your organization – easily and efficiently. Once you start using this information to make smarter business decisions, you’ll begin to see that your data really is worth its weight in gold.</p>\n<p>Attendees of this session will learn methods of understanding content and context, including:</p>\n<p>New ways to find ideas, issues, and trends buried across information sources, whether across Blogs, Twitter, call center databases, warranty claims, emails, or a spreadsheet of survey results, the answers are there.</p>\n<p>Discover new ways to create value by aggregating and dynamically filtering structured and unstructured data to understand the competitive environment to move quickly and decisively.</p>\n<p>Uncovering insights that elude search. With traditional monitoring tools, you only hear what you are listening for.  Learn how to discover the true Voice of the Customer to know what your market is saying and how you should respond.</p>\n<p>Explore hidden connections to improve your products and services.   Combine Social Media, Call Center, and Internal data to create powerful, up-to-the-minute focus groups.</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; <strong>Sponsored by CommonPlaces</strong><br/>\n<br/>\n", "title": "Panning for Gold: A Prospector’s Guide to Mining and Filtering Community Data", "start_time": "2010-07-22T13:40:00-07:00", "track_id": 23, "user_ids": [2133], "room_id": 24, "end_time": "2010-07-22T14:20:00-07:00", "id": 2085}