{"description": "\n<p>Leave the virtual behind and create something tangible!</p>\n<p>The success of the <a href=\"http://arduino.cc/\">Arduino</a> physical computing toolkit has lead to a surge of interest in the world of hardware from both software and non-technical people. This workshop will provide an overview of what physical computing is, how Arduino works and how it can be used to add an interactive element to your projects. There will also be an opportunity to set up and use an Arduino board and software.</p>\n<p>No hardware or coding experience necessary! The tutor will guide you through the process of getting started and show you some of what is possible. Once you know the basics you too could be on your way to creating anything from a build monitoring tool to a cuddly navigation device&#8230;</p>\n<p>Learn how physical computing can change the way you think about the electronic devices you interact with, the software you write and even the problems you can solve and the way you solve them.</p>\n<p>Find out what the tutor and others have been able to create with the Arduino.</p>\n<p>A laptop (with the ability to install software and drivers), <span class=\"caps\">USB</span> cable, Arduino and a small parts kit will be necessary to participate in the hands-on portion of this workshop. <strong><span class=\"caps\">NOTE</span>:</strong> A limited number of Arduino kits will be available for purchase (approximately $70) from the instructors at the workshop. The instructors will be able to accept cash, Visa, or MasterCard.</p>\n<p>If you participate in the hands-on portion of the workshop you will learn how to install the Arduino <span class=\"caps\">IDE</span>, connect the Arduino board, connect buttons &#38; LEDs, use an electronics breadboard and program the Arduino to respond to external stimuli.</p>\n<p>While an actual Arduino is recommended other participants have benefited from observing or sharing with others at similar workshops in the past.</p>\n<p>The number of participants is limited.</p>\n", "title": "Get Started with the Arduino - A Hands-On Introductory Workshop", "start_time": "2010-07-19T13:30:00-07:00", "track_id": 12, "user_ids": [29, 30], "room_id": 10, "end_time": "2010-07-19T17:00:00-07:00", "id": 45}