{"description": "\n<p>This talk will introduce the world of 3D animation to novices and beginner users. Using <a href=\"http://blender.org\">Blender</a>, the open-source gold standard, users will learn how to perform many tasks, including modelling (mesh editing, subsurfing, etc), texturing (procedural and image-based), material design, animation, and lighting.</p>\n<p>With Blender 2.6, a complete code and UI rewrite, due to be in late beta / released in mid-July 2010, even experienced Blender users will learn a lot from this talk.</p>\n<p>The talk will devote equal amounts of time to each of the following sections:</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; <strong>History and Introduction:</strong> Users will be introduced to the background and UI of Blender and to some of the common terminology used in 3D software.<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; <strong>Modelling:</strong> Attendees will create a simple inorganic model, such as a pencil, to be used for the rest of the tutorial.  Concepts covered will include polygonal mesh modelling, shading, and subdividing versus subsurfing.<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; <strong>Materials and Texturing:</strong> With the model of the object complete, the focus will shift to applying materials and textures to the pencil. Concepts covered will include mirroring, specular and diffuse shading, procedural versus image-based textures, and texture displacement.<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; <strong>Animation:</strong> Now that the object is modelled and textured, it will be animated.  Particular attention will be given to the difference between manually-keyed and physically modelled animation.  Physically modelled animations are calculated by <a href=\"http://bulletphysics.org\">Bullet</a>, Blender&#8217;s built-in physics engine, which handles physical collisions and fluid, cloth, particle, and softbody simulations.<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; <strong>Lighting and Rendering:</strong> With the scene physically ready, it will now be properly lit.  In addition, time will be spent learning about the basics behind 3D rendering. Discussion will include diffuse and specular light, ray-traced versus buffer shadows, the difference between biased and unbiased rendering engines, oversampling, motion blur, and compositing.<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; <strong>Conclusion:</strong> With the scene complete and rendered, a brief time will be spent highlighting other Blender features of note, including video and audio sequencing, dynamic <a href=\"http://python.org\">Python</a> scripting, and UV image texturing.  Attendees will be pointed to a variety of web resources, including Blender&#8217;s comprehensive <a href=\"http://wiki.blender.org\">documentation</a>, <span class=\"caps\">IRC</span> channels, and <a href=\"http://blenderartists.org\">forums</a>.<br/>\n<br/>\n<p>After attending this tutorial, attendees will have a grasp on the basic workflow of the 3D animation process, and should be able to create simple animations on their own.  Relevant questions will be taken at the end of each section, and general questions will be taken at the end.  Attendees will be expected, and coached, to duplicate the steps on their laptops, as much of the text and other dialogs will be unreadable on a projector screen.  However, downloadable files will be provided between each section to allow those who have come late or gotten lost to jump back in.</p>\n", "title": "Introduction to 3D Animation with Blender", "start_time": "2010-07-19T08:30:00-07:00", "track_id": 3, "user_ids": [19], "room_id": 10, "end_time": "2010-07-19T12:00:00-07:00", "id": 34}