{"description": "\n<p>For years you&#8217;ve been leaving your computers turned on in order to process data packets for UC Berkeley&#8217;s <span class=\"caps\">SETI</span>@home &#8211; that&#8217;s great!  Please keep it up!</p>\n<p>Did you ever want to get more involved?</p>\n<p>Do you think about the &#8216;why&#8217;, &#8216;how&#8217;, &#8216;what if?&#8217; of <span class=\"caps\">SETI</span> and want to offer improvements? \nDo you like contributing to open source code development projects? \nDo you think <span class=\"caps\">SETI</span> projects should be looking for different kinds of signals, and do you have great algorithms for finding them in noise? \nAre you good at seeing hidden patterns, do you have some time to examine data coming from <span class=\"caps\">SETI</span> observations with the Allen Telescope Array in real time?</p>\n<p>Do you wear headphones and listen to music while you work to sharpen your concentration? Could you imagine listening to data instead and responding to anomalies? \nIf any of these ideas described you, then you should check out setiQuest.org &#8211; we want to make the <span class=\"caps\">SETI</span> Institute&#8217;s <span class=\"caps\">SETI</span> programs on the Allen Telescope Array better and more comprehensive.  We have some ideas of things we can/should do, but we need resources and your help to get the job done.  We have some ideas of things we&#8217;d like to do, but we don&#8217;t yet understand whether or how we can make them happen; maybe you hold the key.  There are things you know about signal processing, data manipulation and distribution, and crowdsourcing that we need you to help us learn and implement, so we can improve our searches.</p>\n<p>In short, thanks for all those years of paying for the electrons coming out of your wall socket, but now we also want your &#8216;thinkons&#8217;!  We are eager to move ahead and conduct better searches so that together we can find any signals that are out there!  We want you to become part our team and start adding &#8216;Earthling&#8217; to your personal profiles when you identify yourself to the world.  It&#8217;s time to change the humanity&#8217;s point of view of who we are (individually and collectively) to one that is more cosmic and inclusive.</p>\n", "title": "Open SETIQuest - It Will Be What You Make It!", "start_time": "2010-07-22T09:15:00-07:00", "track_id": 1, "user_ids": [87], "room_id": 1, "end_time": "2010-07-22T09:30:00-07:00", "id": 93}