{"description": "\n<p>The <span class=\"caps\">EPA</span> predicts US data center power consumption in 2011 will be 120 billion kilowatt hours, or 3% of total US power consumption, doubling every 5 years thereafter. Our work as programmers and technologists will continue this exponential growth. This will have huge environmental, social, and economic consequences unless we find alternative ways to power the digital economy.</p>\n<p>Server sky is a proposal to build large dispersed arrays of 7 gram paper-thin solar-powered computer satellites and launch them into 6400km earth orbit.</p>\n<p>A server-sat is a 100 micron thick, 6 inch solar cell, with processor memory, and radio chips around the edges. Server-sats use light pressure for thrust and electrochromic shutters for steering. Thousands of server-sats position themselves in three dimensional arrays, about 100 meters on a side. An array acts as a large phased array antenna, permitting it to transmit thousands of communication beams simultaneously to ground receivers and other arrays in space.</p>\n<p>A server-sat displaces 25 watts of ground-based electrical generation, cooling, and power conversion. A server-sat does not need the racks, cabling, power converters, land, buildings, and other infrastructure needed to build a ground-based server farm. These savings alone may pay for launch.</p>\n<p>Server-sat arrays use unlimited space solar power, and operate outside the biosphere. The environmental impact of power generation and heat disposal is tiny. In time, new launch techniques, and solar cells made from lunar rock, can further reduce the environmental and economic costs of manufacturing and launch. However, there are other surprising ecological effects to study!</p>\n<p>Earth can return to what it is good at â&euro;&ldquo; green and growing things â&euro;&ldquo; while space can be filled with gray and computing things.</p>\n", "title": "Server Sky - Data Centers in Orbit", "start_time": "2010-07-23T11:50:00-07:00", "track_id": 3, "user_ids": [314], "room_id": 10, "end_time": "2010-07-23T12:30:00-07:00", "id": 325}