{"description": "\n<p>It&#8217;s the chicken-and-egg problem of <span class=\"caps\">FOSS</span> projects &#8211; there are always bite-sized work bits to do, and no way to tell new contributors how to even know about those needs. New contributors (or their teachers) want to see in to a project and find how they (or their students) can begin helping in small ways, but they need a full roadmap to find their way to a small problem they can solve. At the same time, the open source community is powerful, yet fragmented, with nearly one-fifth of open source developers knowing no one else who works on open source &#8211; and therefore no one else who they can reach out to for help.</p>\n<p>In other words, one of the biggest problems educators and students have working with upstream <span class=\"caps\">FOSS</span> project is that the projects they&#8217;d like to work with do not know how to expose their needs (tasks, bugs, etc.) in a way that is meaningful and useful to students. One solution that&#8217;s sprung up to address this problem is the idea of junior jobs, a.k.a. bite-sized bugs. Projects such as Miro, Ubuntu, <span class=\"caps\">KDE</span>, and <span class=\"caps\">GNOME</span> have been tagging tasks that are good starting points for newcomers.</p>\n<p>But bite-sized bugs are more than just a technical problem &#8211; there&#8217;s a community stewardship aspect to them as well. Once the bite-sized tasks are labeled, how can new contributors find them? How can you make sure enthusiastic documentation writers see your call for help?</p>\n<p>Our solution: OpenHatch is a community website where you can say what your project needs and what help you&#8217;re willing to provide. We crawl bug trackers and highlight opportunities to work on bite-sized bugs in a way that&#8217;s easily findable. For instance, you can browse by the programming language of the project, the kind of help needed, and the age of the request. By serving as a meet-market for these opportunities to get involved, we can not only help new contributors find things to do, but ensure that they know how to get in touch with the project &#8211; and stay in touch with it &#8211; as they progress.</p>\n<p>Using the concepts, tools, and process of OpenHatch, this talk shows you how to request new contributors for your project, find new people to work with, and help them learn how to help you.</p>\n", "title": "Junior Jobs and Bite-sized Bugs: Entry Points for New Contributors to Open Source", "start_time": "2010-07-22T17:20:00-07:00", "track_id": 10, "user_ids": [249, 1755], "room_id": 20, "end_time": "2010-07-22T18:00:00-07:00", "id": 1713}