{"description": "\n<p>In this hands-on tutorial you&#8217;ll discover how to use your <span class=\"caps\">HTML</span>/JavaScript skills to build applications for mobile platforms including iPhone, Google Android, Blackberry, Symbian and Palm.</p>\n<p>Learn how to use <a href=\"http://www.phonegap.com/\">PhoneGap</a>, an open source mobile development framework, to create platform-neutral mobile applications with <span class=\"caps\">HTML</span>, CSS and JavaScript.</p>\n\n\nAt the completion of this course, you&#8217;ll be able to:<br />\n\n&nbsp;&nbsp;&nbsp;&#8226; Set up your development environment<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Compile for multiple platforms<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Run code in a emulator<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Debug your <span class=\"caps\">HTML</span> and JavaScript<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Access native APIs, including location, camera, accelerometer, contacts, and more via JavaScript<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Optimize your JavaScript for mobile devices<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Build a mobile application that runs offline<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Use <span class=\"caps\">CSS</span> transitions, animations and transforms to create native looking interfaces<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Use mobile JS libraries, such as <span class=\"caps\">XUI</span> and Dashcode to build mobile applications faster<br/>\n<br/>\n<p><strong>Who Should Attend?</strong><br />\nIf you&#8217;re a web developer, mobile developer, mobile designer or a project manager in charge of mobile development, then PhoneGap training is for you.\nIf you&#8217;re already well-versed in JavaScript and <span class=\"caps\">HTML</span>, PhoneGap provides the fastest, most effective way to add mobile application development to your roster, especially if you&#8217;re building social networking applications, simple games and companion applications to websites.</p>\n<p><strong>Prerequisites</strong><br />\nDevelopers should have <span class=\"caps\">HTML</span> and JavaScript experience, and be familiar with version control systems such as GitHub. Attendees will need their own laptops and mobile phones to participate.</p>\n<p>Students are encouraged to get a head start by downloading the appropriate mobile SDKs for each platform &#8211; SDKs and IDEs are cross-platform compatible, unless otherwise indicated. Download SDKs and IDEs from here: <a href=\"http://www.nitobi.com/services/phonegap/training/#prereq\">http://www.nitobi.com/services/phonegap/training/#prereq</a>.</p>\n", "title": "Mobile App Development with PhoneGap", "start_time": "2010-07-20T08:30:00-07:00", "track_id": 6, "user_ids": [1251, 1257], "room_id": 14, "end_time": "2010-07-20T12:00:00-07:00", "id": 2187}