{"description": "\n<p>There are two major trends happening in the hardware space today.  The first is that most hardware is becoming a commodity.  With commoditization comes significant decrease in costs &#8211; trending to zero cost.  The second is that hardware in general is becoming more pervasive and connected with every passing year.  As an example, there&#8217;s an estimated 45+ million iPhones out there, and that&#8217;s still well below the industry average of one-billion units (e.g Nokia, Windows Mobile).</p>\n<p>These two trends are bringing about a change in how the physical world interacts with the digital world &#8211; generally referred to as ubiquitous computing (also pervasive computing, the Internet of things, or simply “everyware”).  Imagine a refrigerator that knows about the items it contains via <span class=\"caps\">RFID</span> tagging.  Then extend that to the Internet and via a recipe web service you have a machine that can recommend a menu for you.  Connected via wireless to your scale, and it could further automatically customize your diet for your weight goals.</p>\n<p>The only problem then is how do you, the open source developer, leverage this convergence?  If you’re a web developer, contributing to the numbers above by creating more content, then electronics hardware probably seems like a completely foreign world.</p>\n<p>This session will begin by exploring electronic hardware basics with the open source prototyping platform, Arduino.  We will explore basic sensors such as light and temperature, and then take a look at wireless integration.  Once we have access to this abundance of real-time sensor data, we will want to display it.  Using the charting components from the open source Adobe Flex <span class=\"caps\">SDK</span>, we will be able to display this data in near real-time, despite being a web deployment that generally lives in a page refresh world.</p>\n", "title": "Open Source Data Visualization on Open Source Hardware", "start_time": "2010-07-23T11:50:00-07:00", "track_id": 12, "user_ids": [312], "room_id": 19, "end_time": "2010-07-23T12:30:00-07:00", "id": 323}