{"description": "\n<p>Using Open Source Software to Bridge the Gap between Clinical Care and Clinical Research</p>\n<p>Introduction</p>\n<p>Bridging the gap between clinical research and patient care is a challenge. Although clinical investigators and clinical care providers may be interacting with one another on a frequent basis and may be concerned with identical patient populations, clinical research applications are remarkable separate from clinical care applications. This separation has generated needless extra work for all stakeholders and has contributed to the potential for mismatch between clinical care and clinical research data. The <span class=\"caps\">TRANSCEND</span> project uses open source software to document and store the information needed by both care providers and researchers for patients with advanced breast cancer, and therefore erases the  historical separation between clinical care and clinical research informatics activity.</p>\n<p><span class=\"caps\">TRANSCEND</span> involves exchange of de-identified clinical information across a consortium of academic medical centers and research laboratories. <span class=\"caps\">TRANSCEND</span> therefore addresses such important issues as patient privacy, interoperability, and clinical data standards as well as the transformation of clinical care information into clinical research data. The <span class=\"caps\">TRANSCEND</span> project is housed at the University of California San Francisco’s Helen Diller Family Cancer Center and is funded by the National Cancer Institute.\n<span class=\"caps\">TRANSCEND</span> and I-SPY</p>\n<p>The I-SPY trial (http://tr.nci.nih.gov/iSpy) is a multi-center study combining biomarkers to predict response to therapy in patients with locally advanced disease undergoing neo-adjuvant treatment. I-SPY uses an adaptive design where treatment response is used to randomize future subjects, thus dramatically accelerating drug evaluation in breast cancer. Information learned in I-SPY will lead to tailored and accelerated evaluation of therapies based on genomic signature.</p>\n<p>I-SPY involves a number of informatics challenges as it includes the integration and analysis of diverse data types including <span class=\"caps\">MRI</span>, gene expression, immuno-histochemistry, fluorescent In-Situ hybridization (FISH), and other emerging proteomic tissue signatures.   Furthermore, the multi-center nature of the study and the need for highly specialized testing requires a robust distributed system capable of tracking patient specimens and aggregating diverse data types in an integrated visual representation.</p>\n<p><span class=\"caps\">TRANSCEND</span> (TRANslational Informatics System to Coordinate Emerging Biomarkers, Novel Agents, and Clinical Data) addresses the next phase of the I-SPY informatics effort, and has focused primarily on the integration of an open source electronic clinical record system with the I-SPY research data infrastructure.  An ongoing key objective is to demonstrate the use of standards to integrate an open source clinical record system within I-SPY infrastructure and to utilize clinically-driven data collection in support of translational research.</p>\n<p>The <span class=\"caps\">TRANSCEND</span> project provides a blueprint for bridging the gap between clinical research information, and clinical care information. Clinicians from <span class=\"caps\">UCSF</span> (University of California San Francisco) and UPenn (University of Pennsylvania) have supplied the major portion of the clinical domain input. The software components of the project are being continually contributed to open source.</p>\n<p>Data comparability from bedside to bench</p>\n<p>It is important to understand the difference between data use, such as for a given study, and data collection, such as by a provider of care or directly by the patient. This detail has a dramatic impact on the reusability and durability of instances of metadata definitions. As a simple example, a provider or patient typically collects the patient’s date of birth. Age can easily be determined at any time based on date of birth. Further, each different study can group patients by age range using patient age computed from date of birth without having to define specific age ranges. This is critical to semantic interoperability since exchanging age or age ranges is not likely to yield comparable results except in very narrow contexts.</p>\n<p>Using a Semantic wiki</p>\n<p>Eliciting, capturing and cataloging data element definitions in any domain are difficult tasks.  The complexity of healthcare makes this process all the more difficult. The ability to provide useful comparability of instances of definitions is necessary for analysis. Comparability across these domains (that includes across studies as well as across contexts) is critical. Relying on standards like <span class=\"caps\">HL7</span>, UMLS, and <span class=\"caps\">ISO 11179</span> requires comprehension and commitment. These standards offer more than simply a way to convert data from one format to another. Embracing these standards at a fundamental level has a liberating effect on the productivity of an overall system design effort.\nEnterprise vetting of metadata when the purpose of a metadata repository is acceptance by a large audience is beneficial over a unilateral approach. Public attribution of individual contributors plays an important role in vetting the most useful (broadly applicable) metadata. This yields higher quality work than when working behind the anonymity of an organization alone. Healthcare, not individual fiefdoms within healthcare, is represented. \nThe project’s semantic wiki uses a two-part process for metadata definitions: clinical + technical. That is, clinicians, researchers and informaticists are able to create highly domain-specific definitions in order to elicit the full fidelity of a clinical concept without violating the rules of the applicable standard information models and vocabularies. A technical person then transforms vetted definitions into xml application building blocks. Each party brings particular strengths to the table. The technical person is very familiar with object concepts, <span class=\"caps\">HL7</span> and other standards, and has, as well, a general understanding of the required vocabularies.</p>\n<p>Scope of Work</p>\n<p>The team has built a federated system for data collection, adaptive randomization, and biospecimen tracking within the I-SPY 2 trial.  The use of open source components and prevailing health data standards enables wide scale adoption of this infrastructure for future cancer trials. The crux of the system is to enable the transfer of clinical information to standard formats for clinical trial registration and randomization and to enable the integration (use and testing) of biomarkers to tailor care.</p>\n<p>Engineers have developed electronic case report forms (CRF) using an existing web-enabled open source clinical information system infrastructure. This involves two modes of <span class=\"caps\">CRF</span> creation: (1) web-based <span class=\"caps\">CRF</span> forms and (2) assembly of completed CRFs from data entered into a clinical record by clinic staff.  I-SPY 2 participating institutions have a choice of either mode.  At least two institutions, <span class=\"caps\">UCSF</span> and U Penn, are committed to the auto-assembly mode, which involves clinical staff entering patient data into the open source-based clinical information system in their respective clinical areas.</p>\n<p>The open source software solution includes a rules engine that utilizes the common rules language, <span class=\"caps\">OPS5</span>. OPS5 based rules have been developed to enable the auto-assembly <span class=\"caps\">CRF</span> construction from clinical data. The rules are necessary in order to have the system help establish the suitability and completeness of captured clinical data in becoming appropriate “answers” for the questions in the case report forms.</p>\n<p>This project has also required establishing a core set of common data elements for breast cancer. Analysts have derived needed elements from accepted standard terminologies (chiefly <span class=\"caps\">SNOMED</span>) and have mapped them to the <span class=\"caps\">NCI</span> caDSR (National Cancer Institute cancer Data Standards Registry and Repository). Any needed elements that were not in the caDSR are submitted for proposed inclusion in the caDSR.</p>\n<p>Conclusion</p>\n<p>By using open source software that incorporates widely accepted industry standards for healthcare information models and vocabularies, <span class=\"caps\">TRANSCEND</span> demonstrates that application sophistication and semantic interoperability can be achieved at low cost.</p>\n", "title": "Using Open Source Software to Bridge the Gap between Clinical Care and Clinical Research", "start_time": "2010-07-23T11:20:00-07:00", "track_id": 25, "user_ids": [168], "room_id": 16, "end_time": "2010-07-23T11:40:00-07:00", "id": 318}