{"description": "\n<p>Here in the second decade of the 21st century, the kinds of apps we build have evolved. Techniques for storing and getting that data are starting to evolve too.  The category even has a name: NoSQL.  Which one should you choose though?</p>\n<p>Your site really runs on memcached, occasionally accessing a <span class=\"caps\">SQL</span> database. You need <span class=\"caps\">SQL</span> for some types of data access, or you fear the effort involved in breaking free from some of that legacy mapping code.</p>\n<p>Other types of data access could be serviced by something like memcached, but you would need the same speed, it would need to be compatible with current production applications and your application data has to survive the seemingly hostile environment from your cloud computing provider. You want to know that it will never make your application wait for data; you need to know that it&#8217;s been deployed for something other than batch-based workloads.</p>\n<p>Membase is a simple, fast, elastic key-value database. Building upon the memcached engine interface, it is memcapable, meaning it is completely compatible with existing memcached clients and applications. The new engine plugin and associated tools allow for persistence, replication of data, lots of statistics on data use and even streaming data for iterating over every item in the store.</p>\n<p>The founding sponsors of membase, NorthScale, Zynga and <span class=\"caps\">NHN</span> recently launched a new project at membase.org under an Apache 2.0 license. Learn how to get it, about the deployments behind some of the largest sites and how you can get involved in the project.</p>\n<p><strong>Sponsored by NorthScale</strong></p>\n", "title": "membase.org: The Simple, Fast, Elastic NoSQL Database Powering FarmVille is now an Open Source Project", "start_time": "2010-07-21T16:30:00-07:00", "track_id": 23, "user_ids": [1065], "room_id": 13, "end_time": "2010-07-21T17:10:00-07:00", "id": 1047}