{"description": "\n<p>Organizations who are paying attention already know they need to have an open web <span class=\"caps\">API</span>, and many already have under development or in the wild.</p>\n<p>Make sure you haven&#8217;t been caught by the pitfalls of many early <span class=\"caps\">API</span> releases. <span class=\"caps\">API</span> usage patterns are just similar enough to website traffic for many teams to be lulled into thinking they already have the expertise they need to keep their <span class=\"caps\">API</span> running smoothly. However, an open web <span class=\"caps\">API</span> that developers rely on to provide services of their own is an entirely different animal.</p>\n\n\nDo you know:<br />\n\n&nbsp;&nbsp;&nbsp;&#8226; How should you test an <span class=\"caps\">API</span>? <br/>\n&nbsp;&nbsp;&nbsp;&#8226; What should you consider when (re-)designing a web <span class=\"caps\">API</span>?<br/>\n&nbsp;&nbsp;&nbsp;&#8226; If you build it, developers will come?<br/>\n&nbsp;&nbsp;&nbsp;&#8226; How you should fail, and when you should scale?<br/>\n<br/>\n<p>Plus, hear stories from the trenches about how some big APIs struggled to get there, and how to avoid mistakes they made along the way.</p>\n<p>About Mashery<br />\nMashery&#8217;s <span class=\"caps\">API</span> management and strategies help companies connect with customers in a changing digital world by expanding their presence across devices and the Web. Mashery leads the industry with a holistic approach for <span class=\"caps\">API</span> initiatives•from setting business strategy to the heavy lifting of managing infrastructure to facilitating relationships with our 50,000-strong developer network. Our knowledge, experience and proven strategies enable companies to focus on their core business while driving sales, building new revenue channels and realizing faster time-to-market for innovative applications. Mashery was founded in 2006 and has built an impressive list of clients that include Best Buy, Netflix, the New York Times, online directory Whitepages.com, Hoover&#8217;s, Nielsen owned Billboard magazine and more. To learn more about Mashery, visit <a href=\"www.mashery.com/\">www.mashery.com</a>.</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; <strong>Sponsored by Mashery</strong><br/>\n<br/>\n", "title": "Whiskey, Tango, Foxtrot: Understanding API Activity", "start_time": "2010-07-22T10:40:00-07:00", "track_id": 23, "user_ids": [1269], "room_id": 22, "end_time": "2010-07-22T11:20:00-07:00", "id": 1269}