{"description": "\n<p>The engineers that you will be hiring in 2015 are now sitting in college classrooms all across the country. Many are now being trained in the exclusive use of proprietary products, plagued with restrictive licenses. They often don&#8217;t know what a command line is, much less what ssh or netstat are. Most of them will never see a piece of code longer than 500 lines during their entire college education. Most of them have never read a software license. Many of them still wonder if Free and Open Source Software is used in real-life applications. Most of them are puzzled by the idea that a business model may be based on giving away something for free. We have been collectively raising an entire generation of engineers who are ignorant of the essential inner-workings of hardware and software due to the widespread use of proprietary products in college campuses which has prevented them from learning how things really work.</p>\n<p>This talk is about how we are changing this unacceptable state of affairs and how you can join us in this endeavor. For three years now, we have taught a course on Open Source Software Practices at the Rensselaer Polytechnic Institute (RPI). In this talk we will describe our experiences in teaching this class and our many experiments, including success and failure reports. We will also be looking for your advice and suggestions on ways we can improve our teaching practices.</p>\n<p>Some details about the Open Source Software Practices class at <span class=\"caps\">RPI</span>:</p>\n<p>Our course at <span class=\"caps\">RPI</span> covers four main areas: (1) laws and software, (2) economics and collaborative means of production, (3) social implications, and (4) software engineering practices. The course covers, in depth, topics on copyright, patents, trademarks, collaboration platforms, business models, social freedom, and community participation. Students get practical experience in practices of test-driven development, agile development, and participation in distributed teams. As part of the course, students are required to participate and contribute to an open source project. They have the option of starting a project from scratch or joining an existing project. The guiding principle of the course is to empower students to find their own way in the prolific environment of open source communities, by giving them a background that will allow them to make educated decisions along the way.</p>\n", "title": "Educating the Next Generation of FOSS Developers", "start_time": "2010-07-22T13:40:00-07:00", "track_id": 21, "user_ids": [1455], "room_id": 19, "end_time": "2010-07-22T14:20:00-07:00", "id": 1431}