{"description": "\n<p>San Francisco&#8217;s Street Address Management System is used by numerous agencies to edit and report on the city&#8217;s geospatial street addresses.  The application helps the city reduce duplicate data maintenance work, improves the accuracy, consistency, and quality of the data &#8211; and should lower the cost of delivering services to citizens.</p>\n<p>The system was built with nearly all open source software and uses django/geodango with postresql/postgis on the back end and extjs and openlayers for the rich javascript client. We use the city&#8217;s own <span class=\"caps\">GIS</span> data to create the map, which is served with geoserver and geowebcache.  The entire application is hosted on the cloud and receives periodic data updates from the city.</p>\n<p>In this talk, we&#8217;ll begin by discussing the business case for the system.  Next we review some of the organizational issues we see at the city.  We&#8217;ll review the relatively simple deployment and finally discuss what we learned about the specific technologies.\nThis includes:</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; how (not) to use the django <span class=\"caps\">ORM</span> for saving large object graphs<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; but still, the django <span class=\"caps\">ORM</span> is cool; geodjango makes the django <span class=\"caps\">ORM</span> even cooler<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; <span class=\"caps\">ETL</span> (geospatial or otherwise) is tedious<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; deploying a map server with your own data, and taking the cartography seriously, is tedious<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; using (abusing?) the extjs data.store for the &#8220;model&#8221; on the browser<br/>\n<br/>\n<p>The system is expected to be in production at the end of March 2010.  The source code will soon be available under <span class=\"caps\">GPL3</span>.</p>\n", "title": "Managing Street Addresses in San Francisco with Open Source", "start_time": "2010-07-21T14:30:00-07:00", "track_id": 22, "user_ids": [143], "room_id": 21, "end_time": "2010-07-21T15:10:00-07:00", "id": 157}