{"description": "\n<p>We&#8217;ve spent the past year helping the intelligence community (IC) build a brand new system from the ground up that mines massive amounts of structured and unstructured data  (high tens to 100+ million documents), stores the results in a highly flexible semantic meta-model that&#8217;s massively distributable, lends itself to fierce analysis by the men and women who protect our country and we heavily use Java-based open source software to do it.</p>\n<p>This presentation begins with an overview of the problem domain and our experiences with performing semantic analysis on massive amounts of messy structured and unstructured data, but quickly transitions to a discussion of how we&#8217;ve leveraged open source software to create a powerful solution stack for the IC. Specifically, we&#8217;ll discuss:</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; <span class=\"caps\">NLP</span> &#8211; How we&#8217;ve leveraged <span class=\"caps\">MALLET</span>, MAchine Learning for LanguagE Toolkit, and other open source AI technology to build a natural language processor and entity extractor that&#8217;s competitive with the state of the art<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; NoSQL &#8211; How we&#8217;ve augmented the traditional Hadoop stack to use Cassandra–a Java-based eventually consistent storage system–instead of HBase to build a massively distributable, fault-tolerant infrastructure that runs on commodity hardware<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; UI/UX &#8211; How we&#8217;ve used Flare–an open source visualization toolkit inspired by Prefuse–to build a powerful Flex-based user interface that lends itself to advanced analysis.<br/>\n<br/>\n<p>A working demonstration using publicly available data will accompany the presentation (and hopefully be available at a public <span class=\"caps\">URL</span> for users to tinker with during/after the presentation.</p>\n", "title": "Natural Language Processing, Advanced Analytics, and Entity Resolution at Massive Scale ", "start_time": "2010-07-21T17:20:00-07:00", "track_id": 11, "user_ids": [176], "room_id": 20, "end_time": "2010-07-21T18:00:00-07:00", "id": 186}