{"description": "\n<p>Up until recently, the short head economics of the book publishing industry have kept some open source projects from being able to publish books in support of their project. However, now with the rapidly growing list of ebook readers and ebook capable devices, it seems clear that the publishing industry is set to undergo a renaissance.</p>\n<p>During this rebirth, the widely accepted notions of what it means “to publish” as well as what is a “book,” will change rapidly to accommodate a quickly growing long tail of niche markets. I submit that well known open source software in combination with “good-enough” processes will provide open source projects with the ability to begin publishing their own books. This will finally address one of the obstacles to adoption of open source software, the lack of accurate and timely documentation.</p>\n<p>In this session I will provide practical instruction on how to use widely accepted open source tools to create project specific ebooks. Specifically, this session will guide students through the process of formatting the contents of an ebook using OpenOffice.org Writer and Impress, as well as the more publishing specific Scribus desk-top publishing platform. With the built-in ability to print to a <span class=\"caps\">PDF</span> from OpenOffice.org or by using PDFCreator, projects can begin publishing <span class=\"caps\">PDF</span> documents suitable for use in popular print on demand services and some ebook readers. For wider adoption, this session will also demonstrate how to convert ebooks into the free and open <span class=\"caps\">EPUB</span> ebook standard of the International Digital Publishing Forum (used by the Apple iPad).</p>\n<p>Participants in this session will gain publishing specific knowledge necessary to publish easy to read ebooks. This session will also provide new ideas on how to capture software design and development information more naturally. In the end, this session provides participants with a new license to freely publish ebooks about their projects.</p>\n", "title": "Open Source E-Publishing Tools", "start_time": "2010-07-23T11:00:00-07:00", "track_id": 3, "user_ids": [1935], "room_id": 10, "end_time": "2010-07-23T11:40:00-07:00", "id": 1905}