{"description": "\n<p>Open Source plays an increasingly important role in arts and design through Web applications and open licenses. The Networked Media design programme of the Piet Zwart Institute has, for years, employed Open Source more radically for all course work, on servers and clients, with a focus on the command line, coding and <span class=\"caps\">FLOSS</span> philosophy to foster rethinking of media instead of off-the-shelf design.</p>\n<p>Our presentation will show the advantages and limitations of Open Source in a Master-level art school new media program. Free software for artistic work for us is not about, for example, the Gimp as a drop-in replacement for Photoshop. With its orientation towards programmability, tool chain combination and customization, <span class=\"caps\">FLOSS</span> tools &#8211; often the small and geeky ones &#8211; allow artists and designers to design their own media instead of following a media and design concept pre-coded into a shrink-wrapped application. Database cinema, generative audio projects, participatory television, media-critical web applications, user-generated typography are among the works that originated in our program.</p>\n<p>On top of that, open, distributed <span class=\"caps\">FLOSS</span> development methodologies provide valuable alternatives to the traditional top-down work flows of professional designers. They may conversely provide some insight for Open Source software developers for the design of future collaborative, networked media authoring tools.</p>\n<p>The Piet Zwart Institute published Lawrence Liang&#8217;s &#8220;Guide to Open Content Licenses&#8221; in 2004 and co-published the anthology &#8220;FLOSS+Art&#8221; in 2009. It is a partner of Libre Graphics Meeting 2010 and works within a larger network of <span class=\"caps\">FLOSS</span> artists and designers that include Constant/OS Publishing (Brussels), GenderChangers (NL), <span class=\"caps\">MODDR</span>/WORM (NL) and the <span class=\"caps\">GOTO10</span> collective.</p>\n", "title": "How to Run an Art School on Open Source", "start_time": "2010-07-23T10:00:00-07:00", "track_id": 21, "user_ids": [288, 289, 290], "room_id": 6, "end_time": "2010-07-23T10:40:00-07:00", "id": 296}