{"description": "\n<p>The Linux Kernel is a phenomenally successful open source project, incorporating contributions from over ten thousand individuals and scaling to change about fifteen thousand lines of code every day while making a stable release roughly every two to three months.  By any metric, that&#8217;s an amazing achievement.</p>\n<p>Several interesting insights can be gained from this.  Firstly, how do people become contributors to the project, and how easy is this.  The talk will cover some do&#8217;s and don&#8217;t &#8230; particularly with regard to how to train contributors to recognise and defuse the diffractive elements which seem to accrete around any large open source project.</p>\n<p>Secondly, how is the project governed and what can be learned to help in governance of other open source projects.  Here we will discuss the licensing choices for the kernel, copyright assignment and attribution (including how the kernel shares code with other incompatibly licensed projects, like <span class=\"caps\">BSD</span>, and how we&#8217;ve avoided the perennial licensing disputes that can afflict open source projects), how we get provenance of the code (Developer Certificate of Origin and tracking with git) and how we resolve disputes amongst participants.</p>\n<p>Finally, we will study how the project is managed, from Linus at the top, through the Maintainers to the actual contributors.  We&#8217;ll look at the various management styles and try to synthesise what makes a good manager for an open source project and what the best practises for doing this are .. and also what to do when someone in a position of trust stops managing effectively.</p>\n<p>Attendees should learn how to be a good contributor, how to run a well governed open source project and how to manage other contributors in a way which contributes to the best interests of the project overall.</p>\n", "title": "Kernel Developers Don't Bite: Best (and Worst) practises from the World's Biggest Open Source Project", "start_time": "2010-07-22T16:30:00-07:00", "track_id": 10, "user_ids": [1659], "room_id": 20, "end_time": "2010-07-22T17:10:00-07:00", "id": 1635}