{"description": "\n<p>Recently, the <span class=\"caps\">US SEC</span> published a proposal for how to address the current lack of transparency of asset-backed securities through changing disclosure requirements to include the provision of a Python computer program. The goal is to capture all the complicated terms of the deal in code that can be used to analyze the cash flows in each deal and how the returns will get split up between different parties. Currently, investors, fund managers, and investment managers receive a complex, textual description of this information in the prospectus, which makes it difficult for them to perform or visualize a rigorous quantitative or if-then analysis of the asset-backed securities.</p>\n<p>This all begs the question &#8220;Why Python?&#8221; One of the answers is that it&#8217;s open source and while there are a number of proprietary financial modeling solutions and more than a few trade description languages in use on Wall Street &#8211; there is little use asking for openness and transparency from issuers if the interpreter for that code is proprietary in nature. That said, Python has other aspects that make it a good choice for these purposes and has been widely used on Wall Street and in the finance community for financial modeling and number crunching.</p>\n<p>At the very least, it&#8217;s not enough to have open data, one has to have open tools to fulfill the transparency requirements to establish meaningful use of financial information. Buyers, Sellers and Regulators alike need an open technology means to accurately and efficiently interpret financial information.</p>\n<p>This presentation will discuss some of the aspects of Python that make it a good fit for the <span class=\"caps\">SEC</span>’s proposal and some of the challenges and the implications of using Python for financial analysis. This presentation will also discuss some opportunities for collaboration between regulators and the open source related to the development of an ecosystem of open source projects that can exploit the availability of this proposed new rich source of financial information.</p>\n<p><strong>Sponsored by ActiveState</strong></p>\n", "title": "Python & Finance: US Government Mandates, Financial Modeling, and Other Snakes in the Grass", "start_time": "2010-07-22T14:30:00-07:00", "track_id": 23, "user_ids": [1581, 1587], "room_id": 22, "end_time": "2010-07-22T15:10:00-07:00", "id": 1563}