{"description": "\n<p>Open source applications like Drupal, Wordpress, Joomla and others are consistently requested by marketing departments because they offer an impressive set of functionality and at the right price point. However, when deploying these applications on your network you do have be aware that they can pose a grave threat to your security integrity.</p>\n<p>This presentation will detail the security game changer that is open source. Unfortunately, companies and hackers have something in common when it comes to open source: they both love that they’re free and that they provide access to source code. This session will discuss how companies using open source <span class=\"caps\">CMS</span> have to think about the doors left unlocked by virtue of their openness, and will also evaluate how web hosting partners or companies that self-host can latch those security gates closed.</p>\n<p>Attendees of this session will:</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; Garner tips to protect yourself from yourself with regard to overlooked pitfalls tied to open source applications <br/>\n&nbsp;&nbsp;&nbsp;&#8226; Learn how the security landscape is changing and hear about real-world examples of modern hacks that could have been avoided <br/>\n&nbsp;&nbsp;&nbsp;&#8226; Examine the vulnerabilities of open source, particularly building a corporate blog using WordPress, or a robust application using Drupal, and evaluate the common mistakes made when implanting to open source applications <br/>\n&nbsp;&nbsp;&nbsp;&#8226; Hear how to better protect your website from application layer threats, which is the biggest vulnerability not solved by hosting companies<br /><br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; <strong>Sponsored by FireHost</strong><br/>\n<br/>\n", "title": "Open Source Powered Websites : Protect Your Enterprise and Yourself", "start_time": "2010-07-22T10:40:00-07:00", "track_id": 23, "user_ids": [197], "room_id": 13, "end_time": "2010-07-22T11:20:00-07:00", "id": 209}