{"description": "\n<p>Research published in 2000 showed that when teachers (1) are comfortable with computers, (2) are student-centered, and (3) have computers available alongside other classroom activities, teachers will make computers an integral part of learning in their classrooms. Though still somewhat far-fetched at the turn of the century, the first two of these conditions are no longer problems. Computers and the internet are now fully integrated into our culture. Most teachers use computers to do their own work and research, and, outside of school, participate in social networking and use other tools typically absent in classrooms. Because US schools have about four students per computer, many of which would have been cast off by businesses years earlier, teachers can&#8217;t use computers even in the most simple ways.</p>\n<p>For the past 6 years I have been setting up Linux terminal servers in classrooms using the Linux Terminal Server Project (LTSP, included as part of <span class=\"caps\">K12LTSP</span>, Ubuntu and k12linux.org distributions). They are typically welcomed by teachers, most often by teachers who are the least technically adept (because they don&#8217;t have to relearn anything to use Linux). For students adapting to Ubuntu is as natural as moving from Playstation to Wii. For terminal servers I have used everything from the computers already on teachers&#8217; desks to rack mountable servers-class machines. For clients I have used laptops and desktops destined for surplus at my university and 10 year old <span class=\"caps\">PPC</span> iMacs.</p>\n<p>It works. Kids and teachers like it, as indicated by changing their classroom practices to include them. Even in schools where teachers, students and principals are pleased, however, it is difficult to get tech staffs to do much more than allow someone else to configure, install, maintain and support the machines. The primary impediment for technologists who believe that Linux thin clients are beneficial to their schools to doing more with them is that they are already overworked and though they are happy to have thin clients added to their schools, they cannot see which of their other work they might be able to give up.</p>\n<p>This presentation will describe the successes of Linux thin clients in classrooms and suggest pieces missing to help enable teachers and typical school tech support people to be able to set up and maintain Linux thin clients.</p>\n", "title": "Experiences Encouraging Adoption of Thin Clients in K12 Schools", "start_time": "2010-07-21T13:40:00-07:00", "track_id": 21, "user_ids": [795], "room_id": 19, "end_time": "2010-07-21T14:20:00-07:00", "id": 807}