{"description": "\n<p>The use of open source software (oss) in the area of Health Information IT has grown quietly for a number of years now.  Most recently, the use of oss by the US federal government has put a more public spotlight on its potential to overcome system interoperability issues &#8211; issues that often impact the quality of decisions made about personal health care.</p>\n<p>In this session, public sector advocate Deborah Bryant will share insights into the growing momentum in the use of open source of Health Care information technology (HIT) in the US and abroad with particular focus on the US Federal Government’s influence as a consumer and creator of <span class=\"caps\">HIT</span>.</p>\n<p>Deborah was recently tapped to provide guidance to the U.S. government Study and Report on the Availability of Open-Source Health Information Technology.  The study was mandated by congress and will form the basis of a report back to that body by the Department of Heath and Human Services in October of this year.</p>\n<p>Her talk &#8220;Open Source is Making a Difference in Health Information Technology (HIT) &#8211; So Can You&#8221; will introduce you to:</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; Breadth of existing oss <span class=\"caps\">HIT</span> applications<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Potential to effect change by improving the quality and accessibility of patient health information.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Snapshot of exemplary oss <span class=\"caps\">HIT</span> projects<br/>\n&nbsp;&nbsp;&nbsp;&#8226; The essential health reform strategy: empower individuals to take charge of their own health.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Recent grants, new projects<br/>\n&nbsp;&nbsp;&nbsp;&#8226; How you can get involved<br/>\n<br/>\n", "title": "Open Source is Making a Difference in Health Information Technology (HIT) - So Can You", "start_time": "2010-07-21T11:00:00-07:00", "track_id": 25, "user_ids": [103], "room_id": 16, "end_time": "2010-07-21T11:20:00-07:00", "id": 119}