{"description": "\n<p>What do you get when you mix fractals, 3D printers, robotics, open source, high-powered lasers, and non-orientable surfaces with wood, plastic, textiles, steel, cloth&#8230; and lots of coffee? A completely new range of geek fabricated items and appliances. It’s hacking in real life.</p>\n<p>In the past, techy projects like rapid prototyping, hobbyist robotics, and do-it-yourself crafting have been difficult to break into without access to specialized equipment, skills, and knowledge.  However, recently, affordable and easily accessible technologies combined with a surge of hackerspace availability have brought such avocations into the hands of common geeks everywhere.</p>\n<p>Geek projects are significantly easier with the help of high-tech tools and a community for collaboration, suggestions, and ideas. For example, creating a quilt based on the fractal Sierpinski carpet pattern is much easier when a laser is used to cut the fabric squares, and RepRaps can print parts and items that would be difficult to find otherwise, like custom fittings and 3D geometrical models. The abundance of free and open source plans, software, and hardware lowers the resource barrier so that people without tons of money and years of engineering experience can experiment and create.</p>\n<p>Hackerspaces are great places to find the tools, information, and people you need for your projects, and they’re popping up like <span class=\"caps\">DHTML</span> windows lately!</p>\n\n\nThis talk will cover\n\t\n&nbsp;&nbsp;&nbsp;&#8226; What is a hackerspace?<br/>\n&nbsp;&nbsp;&nbsp;&#8226; How you can find one in your area<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Getting resources and project ideas<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Show-and-tell examples of projects including a fractal quilt, mini-rover maze-solving robot, 3D Klein bottle, and steampunk style wooden cogs<br/>\n<br/>\n", "title": "Hacking IRL: Crafting for the Modern Geek", "start_time": "2010-07-21T11:30:00-07:00", "track_id": 12, "user_ids": [108], "room_id": 9, "end_time": "2010-07-21T12:10:00-07:00", "id": 125}