{"description": "\n<p>The community platform at The New York Times is a <span class=\"caps\">PHP</span>-based, multi-tiered application that utilizes MySQL, Apache and Memcached. It was originally hosted on our own internal servers. We recently moved the platform to the cloud in order to increase its flexibility and to better handle high-load events (like links from the Yahoo home page).</p>\n<p>Moving an existing application to the cloud presented both organizational and technical challenges. Here are some of the points we plan to cover:</p>\n<p>Cloud Management</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; Existing cloud management tools did not meet our needs in the areas of existing processes and organizational structure.<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; To address these needs, we built our own tool and are in the process of open-sourcing it.<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; Cloud management tools make it easy to manage infrastructures, even if you&#8217;re unfamiliar with the cloud.<br/>\n<br/>\n<p>Auto-Scaling Issues</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; Work in progress<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; Scaling back when traffic is low and scaling up to handle traffic spikes<br/>\n<br/>\n<p>Load Balancing and Proxying</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; Using nginx<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; Balancing the front-end tier and APIs<br/>\n<br/>\n<p>Deployment</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; We needed a very simple, straightforward way to deploy on the cloud.<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; We developed our own tool (called Cloud Source) based on Servermattic scripts.<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; We further improved Servermattic by introducing better support for revisions, via the use of <span class=\"caps\">SVN</span> externals.<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; We also added support for notifications and Solaris.<br/>\n<br/>\n<p>Monitoring</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; Currently, we&#8217;re using Nagios and Munin. We use dynamically generated lists of instances to configure Nagios and Munin.<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; This solution provides visibility into our full stack.<br/>\n<br/>\n<p>Security Considerations</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; We were missing a way of auditing our firewall rules, so we also added this functionality to our cloud management tool.<br/>\n<br/>\n<p>Q&#38;A / Demo</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; We&#8217;ll encourage questions from the attendees and look at how our approach can apply to the needs of other organizations.<br/>\n<br/>\n\n&nbsp;&nbsp;&nbsp;&#8226; We&#8217;ll demo our cloud management tools if time allows.<br/>\n<br/>\n", "title": "Moving to the Cloud with NYTimes.com", "start_time": "2010-07-22T10:40:00-07:00", "track_id": 13, "user_ids": [202, 203], "room_id": 14, "end_time": "2010-07-22T11:20:00-07:00", "id": 212}