{"description": "\n<p>Attendees of <span class=\"caps\">OCSON</span> are intimately familiar with the decisions\nsurrounding software licensing: copyleft, attribution, and\nnon-endorsement all mean something when discussing the licensing of\nsource code.  With the rise of aggregate data and &#8220;open data&#8221;,\nentrepeneurs and developers are turning their attention to data, often\nwith the assumption that the same ideas apply.  This is not the case.</p>\n<p>Anyone who needs to draw from many databases is painfully aware of the\ndifficulty of dealing with a myriad of differing and overlapping data\nsharing policies, agreements, and laws, as well as parsing\nincomprehensible fine print that often carries conflicting\nobligations, limitations, and restrictions. These licenses and\nagreements can not only impede reuse and research, they can also\nenable data providers to exercise &#8220;remote control&#8221; over downstream\nusers of data, dictating not only what research can be done, but also\nwhat data can be published or disclosed, what data can be combined and\nhow, and what data can be re­used and for what purposes.</p>\n<p>The core insight behind <span class=\"caps\">CC0</span> is that the solution to these problems is\nto return data to the public domain by relinquishing all rights, of\nwhatever origin or scope, that would otherwise restrict the ability to\ndo research (i.e., the ability to extract, re­use, and distribute\ndata). The goals of <span class=\"caps\">CC0</span> are to keep data open, accessible, and\ninteroperable, and its virtues lie in its simplicity, predictability,\nand consistent treatment of users and data.</p>\n<p>Creative Commons is developing technical and legal tools that will\nenable users to share their data without restrictions, while marking\nexpectations associated with use such as citation.  These &#8220;norms&#8221; \nprovide a framework for communicating extra-legal information that is\nnot part of the legal agreement, and is more appropriate for data\nsharing.</p>\n<p>In this session we&#8217;ll give attendees background and details on why\ndata licensing differs from source licensing.  Examples of potential\npitfalls will be presented, along with how they can be avoided by\nmaking different license choices.  We&#8217;ll also discuss <span class=\"caps\">CC0</span>, why we\nbelieve it is the best license for data, and how adopters like <span class=\"caps\">XXX</span> are\nusing it to share their data in a way that encourages use and research.</p>\n<p>Attendees will learn about:</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; Challenges related to licensing data<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Why assumptions from open source may not hold for open data<br/>\n&nbsp;&nbsp;&nbsp;&#8226; What <span class=\"caps\">CC0</span> is, and how it differs from the Public Domain<br/>\n&nbsp;&nbsp;&nbsp;&#8226; How <span class=\"caps\">CC0</span> may be used for releasing Open Data<br/>\n<br/>\n<p>This talk is appropriate for anyone interested in releasing and\nreusing large data sets, and the issues surrounding them.</p>\n", "title": "Sharing Data for Reuse and Remix", "start_time": "2010-07-22T11:30:00-07:00", "track_id": 10, "user_ids": [1359, 1365], "room_id": 20, "end_time": "2010-07-22T12:10:00-07:00", "id": 1347}