{"description": "\n<p><strong>Background:</strong> The Executive Order 13335 [Incentives for the Use of Health Information Technology and Establishing the Position of the National Health Information Technology Coordinator] dated April 27, 2004, established the position of National Health Information Technology Coordinator (Office of the National Coordinator &#8211; <span class=\"caps\">ONC</span>) to provide leadership towards realizing a nationwide interoperable secure health information technology infrastructure. This vision includes developing a secure health information exchange infrastructure that enables widespread adoption of Electronic Health Records, medical information that follows the consumer, clinician access to authorized electronic patient information, and public health and bioterrorism surveillance. The Nationwide Health Information Network (NHIN) is a set of standards, services and policies that enable secure health information exchange over the Internet. The <span class=\"caps\">NHIN</span> standards, services and policies are implemented as a secure open source <span class=\"caps\">SOA</span> solution via the federally funded <span class=\"caps\">CONNECT</span> project.</p>\n<p><strong>Presentation Theme:</strong> The presentation would provide the audience with an opportunity to learn about some of the significant challenges identified in developing the open source <span class=\"caps\">CONNECT</span> solution such as the choice of technology stack for an open source platform, collaboration between federal and private entities, community involvement and outreach, using open standards for information exchange, security and trust establishment, processes for effective open source development, adoption of the product among the healthcare community and the flexibility required to adapt to a changing healthcare industry.</p>\n<p><strong><span class=\"caps\">CONNECT</span> Architecture:</strong> The <span class=\"caps\">CONNECT</span> product is developed as an open source <span class=\"caps\">SOA</span> solution with two primary layers that address the healthcare industry interoperability challenges; An Interoperability or Gateway layer that provides standard business services conforming to the <span class=\"caps\">NHIN</span> specifications which enables secure <span class=\"caps\">HIPAA</span> compliant information exchange between medical organizations using the Internet. The second layer is called the Adapter layer which provides pluggable interfaces for legacy systems to be integrated into the <span class=\"caps\">NHIN</span> as shown in the Figure satisfying the external interface contracts that are exposed by the gateway to the <span class=\"caps\">NHIN</span>.</p>\n<p><strong>Real World Results:</strong> The <span class=\"caps\">CONNECT</span> solution is used by Social Security Administration (SSA) to exchange health information with MedVirginia for disability claim determination. The mean case processing time for cases transmitted on the <span class=\"caps\">NHIN</span> is 59 days as compared to Virginia <span class=\"caps\">DDS</span> state average of 84 days based on the <span class=\"caps\">SSA</span>-MedVirginia case study by Sue S.Feldman for E-Health Research. <span class=\"caps\">CONNECT</span> is also used in the <span class=\"caps\">DOD</span>-VLER phase 1a to enable information exchange between VA, KP and the <span class=\"caps\">DOD AHLTA CDR</span> system. In the non-government arena, California based Redwood MedNet and Nebraska based Thayer County Health Services have securely bridged their <span class=\"caps\">HIE</span>â&euro;&trade;s to successfully exchange live patient records containing lab information, medication history and <span class=\"caps\">CCD</span> documents in real time to improve patient care and reduce costs. As the <span class=\"caps\">CONNECT</span> solution is adopted more widely de-identified patient care information will be transferred to public health organizations for public health and bio-terrorism surveillance.</p>\n<p><strong>Conclusion:</strong> The above successes demonstrate the impact of a secure open source <span class=\"caps\">CONNECT</span> solution that transforms the medical industry. This presentation will provide the audience with an opportunity to understand the open source challenges and successes that were encountered in developing and implementing the <span class=\"caps\">CONNECT</span> solution for <span class=\"caps\">NHIN</span>, and the future of the <span class=\"caps\">CONNECT</span> product in open source community and the healthcare industry.</p>\n", "title": "Using Open Source Technologies to Deliver a Healthcare Interoperability Platform that Improves Medical Outcomes and Enables Public Health Surveillance ", "start_time": "2010-07-22T16:50:00-07:00", "track_id": 25, "user_ids": [267], "room_id": 16, "end_time": "2010-07-22T17:10:00-07:00", "id": 275}