{"description": "\n<p>Fred Trotter&#8217;s Health of the Source talk is summary of the Open Source Healthcare movement, both its history and its newest directions.</p>\n<p>The first few minutes of the talk is fast and furious history lesson and introduction to Health Informatics generally. You will get a short lesson on &#8220;What is VA VistA?&#8221; from the person who wrote the <a href=\"http://vistapedia.net/index.php?title=What_is_VistA_Really\">original article</a> . In order to understand VistA you need to know how Healthcare Informatics is different from other IT. But once you do understand the fundamentals of Healthcare Informatics, including a whole 30 seconds on health ontologies, you will see why VistA must be what it is. This grasshopper is important&#8230; because <a href=\"http://www.modernhealthcare.com/apps/pbcs.dll/article?AID=/20070628/FREE/70628002/1031/FREE\">unless you understand VistA you are doomed to repeat it</a># .</p>\n<p>The history of the Open Source healthcare movement provides context and helpful bias for the rest of the talk, which focuses on the Open Source Healthcare movement of today.</p>\n<p>You will learn about Mirth, <span class=\"caps\">CONNECT</span> and what the coming <span class=\"caps\">NHIN</span> will mean (big hint, its like a new Healthcare Internet and if you are smart, you might be the guy who invents the equivalent of Amazon and ebay for that new network)</p>\n<p>You will learn about new competitors to VistA; Open Source <span class=\"caps\">EHR</span> applications like OpenMRS, OpenEMR, Tolven and ClearHealth. You will learn which companies are taking VistA to the next level.</p>\n<p>You will hear the latest and greatest regarding Invido X, the leading Open Source <span class=\"caps\">PHR</span>.</p>\n<p>You will hear how Open Source is revolutionizing Clinical Trails (OpenClinica) and Health Data warehousing and research (CABig&#8230;) How Open Source is being used in public health and disaster response.</p>\n<p>This talk is designed to introduce you to a whole new culture. You will not just get a laundry list of important <span class=\"caps\">FOSS</span> projects in healthcare, but the context of why each project is important to the movement as a whole. Moreover, you will learn why Open Source is the only thing that can address the requirements of a modern healthcare system.</p>\n<p><strong><a href=\"http://radar.oreilly.com/2010/06/open-source-and-health-care-al.html\">Listen to a podcast interview with Fred Trotter on how open source and health IT are working together</a></strong></p>\n", "title": "Health of the Source", "start_time": "2010-07-21T11:30:00-07:00", "track_id": 25, "user_ids": [741], "room_id": 16, "end_time": "2010-07-21T12:10:00-07:00", "id": 765}