{"description": "\n<p>Gopi Ganapathy, <span class=\"caps\">CEO</span> Essentia and Prof. CR Muthukrishnan Dept of Computer Science <span class=\"caps\">IIT</span> Chennai from India will discuss their experience in building the first peer eLearning community built on open source technolgies and freely available courseware for professional education synergistically with the formal curriculum in leading engineering institutions in South India. This service is adopted by 2 major university systems and is seeing rapid expansion. &#8220;www.essentiaedu.in&#8221;</p>\n<p>This community fuels the free flow and exchange of ideas, thoughts, best practices, courseware, education community building and broad participation. Leading Open Source technologies, applications and open source methodologies provide the underpinnings for this service.</p>\n<strong>The service provides the following key capabilities:</strong><br />\n\n&nbsp;&nbsp;&nbsp;&#8226; Collaboration and Community building, Social Networking<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Workspace (projects and sub projects) provisioning per course.<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Programming and practice on environments or simulation provisioned just in time on the cloud<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Freely available content from leading institutions and practitioners globally<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Exchange to support an economically viable model for education at scale<br/>\n<br/>\n<p>Teachers are able to adapt the courses available freely on the internet or create new courses and teach them on virtual class rooms. A workspace (called project) is provisioned for the course complete with all tools needed for course delivery, peer and instructor evaluation, collaboration and lab capabilities required for the course.</p>\n<p>Courses can be classified in a variety of ways using course type, topics and sub topics, categories and tags. Course content can be defined and created using open standards like <span class=\"caps\">AICC</span> and <span class=\"caps\">SCORM</span> and can be delivered in a variety of formats including e-books, audio lectures and graphical demonstrations using videos and interactive whiteboards.</p>\n<p>Real time participant interactions (classes) are facilitated using <span class=\"caps\">IRC</span> chats, audio and video conferencing, sharing of presentations and other documents using interactive whiteboards and desktop and screen sharing including remote control of desktops. The interactive sessions (classes) can be archived locally or on remote sites like Youtube for offline viewing.</p>\n<p>Collaboration and Practice is provided via Discussion Forums, Wiki, Blogs, Document Management, Tracker, <span class=\"caps\">RSS</span> feeds and Mailing Lists.\nLabs/Coursework can be ranked, reviewed, rated and tagged by participants. Student performance evaluations are done via online and offline Quizzes, Tests, Contests and Lab projects and Peer Reviews.</p>\n<p>Students can create their own workspaces (i.e. projects) for the courses they take through which they can track all artifacts and coursework related to their course. Students can checkout computing environments from the cloud related to their course to perform their lab work and this can be shared with other students and teachers for evaluation.</p>\n<p>Courses can be advertised in the marketplace. Classes can be made either free or for credits. Students can sample courses and enroll for classes using a shopping cart like metaphor complete with pricing, order and payment management.</p>\n<p>Another unstated objective of this system is to advance the understanding, applicability and practice in open source practices to build a vibrant community of teachers and students with open source competency.</p>\n<strong>Application Stack</strong><br />\n\n&nbsp;&nbsp;&nbsp;&#8226; Essentia community platform for Collaboration through workspaces, tools like Discussion Forums (phpBB), Wikis (Mediawiki), Tracker (Mantis), Version Control (SVN, Mercurial), Document Management (KnowledgeTree, Owl)<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Content Management using Drupal<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Social Networking through Blogs, Reviews, Ratings, Rankings and Tagging, Interface to Twitter, Facebook, Youtube<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Single SignOn (OpenId, <span class=\"caps\">LDAP</span>, CAS) and Federated Search (using Lucene, Solr)<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Reporting and publishing using JasperServer, Google Gadgets, <span class=\"caps\">RSS</span> feeds, Mailing Lists<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Docebo for <span class=\"caps\">LMS</span><br/>\n&nbsp;&nbsp;&nbsp;&#8226; Dimdim for real time collaboration<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Magento for Marketplace<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Cloud for provisioning environments to deploy applications related to eLearning projects<br/>\n<br/>\n<strong>Technologies used</strong><br />\n\n&nbsp;&nbsp;&nbsp;&#8226; Apache, Tomcat, MySQL on CentOS, php, Java<br/>\n<br/>\n<p>We will share our experience and solicit ideas and feedback on this early instance of  21st century learning environment that delivers blended learning leveraging multiple modalities, self-managed, peer-based and completely flattens the hierarchical approach strictly embraced in India.</p>\n", "title": "Community Driven eLearning in India Using Collaborative Open Source Applications, Methodologies, and Experience", "start_time": "2010-07-21T11:30:00-07:00", "track_id": 21, "user_ids": [675, 681, 2049], "room_id": 19, "end_time": "2010-07-21T12:10:00-07:00", "id": 705}