{"description": "\n<p>Last fall, Social Signal principals Alexandra Samuel and Rob Cottingham took a hard look at our company, and realized something.</p>\n<p>While we&#8217;d been telling clients for years to be as open and free with information as possible, we&#8217;d been doing the opposite with Social Signal&#8217;s intellectual property. Like any good consultant, we were keeping our tools and methodologies under lock and key &#8211; away from the eyes of competitors, but also away from people who could be putting those tools to good use.</p>\n<p>So we began a process that turned the consulting model on its head. Instead of keeping our knowledge under wraps, we published it. We not only tolerated the idea that competitors might adopt our tools and potential clients might <span class=\"caps\">DIY</span> instead of hiring us, but welcoming it. And we started with our flagship service, the workshop-centered Concept Jam.</p>\n<p>Everything went online: templates, annotated PowerPoint decks, how-tos, scripts, reports and more.</p>\n<p>Participants in this workshop will hear about what worked for us, and where we ran aground. They&#8217;ll learn the same hard lessons we learned about how much work it can be to document a resource to the point where it&#8217;s genuinely useful to others. And they&#8217;ll hear the surprising outcome: that far from wiping out demand for the Concept Jam, our initiative &#8211; dubbed Open SoSi &#8211; dramatically increased inquiries and leads, not to mention goodwill and our reputation.</p>\n<p>We&#8217;ll work with the audience to draw out practical steps for any business hoping to harness open-sourced methodologies to their sales process. And we&#8217;ll hope to inspire others to free their internal IP, especially in emerging fields where sharing information can help all of us succeed.</p>\n", "title": "Breaking it Open: How One Firm is Taking their Consulting Practice Open", "start_time": "2010-07-21T16:30:00-07:00", "track_id": 24, "user_ids": [1731, 1737], "room_id": 21, "end_time": "2010-07-21T17:10:00-07:00", "id": 1695}