{"description": "\n<p>A recent <a href=\"http://www.chcf.org/topics/view.cfm?itemid=134205\">survey</a> by the California HealthCare Foundation showed that the use of Personal Health Records (PHRs) by U.S. residents has more than doubled since 2008 . As adoption of <span class=\"caps\">PHR</span> technology continues to increase, healthcare consumers will begin to expect more than the basic data review features that today&#8217;s PHRs provide. To make the most of personal health data, that data must be accessible to innovative personal health applications (PHAs) that can then use this data to perform novel and useful operations that give the health consumer a clearer picture of their personal health situation. This can be accomplished when personal health data is aggregated in a personal health data repository (PHDR) that provides an open interface for client systems to store and access data.</p>\n<p>The Project HealthDesign Common Platform is an open source <span class=\"caps\">PHDR</span> built upon an industry standard Java-based <span class=\"caps\">SOAP</span> web service architecture. The Common Platform was developed as part the Robert Wood Johnson Foundation&#8217;s Project HealthDesign initiative to foster the creation of innovative uses of personal health data. The goal in designing the system was to develop core data elements (e.g., medications, home medical device data, laboratory results, etc.) and technical utilities  (message handling  and data access controls) that could be used by multiple PHAs to store and access personal health data.</p>\n<p>The Project HealthDesign program served as an invaluable test-bed for determining those data elements and platform features that are relevant to the capture and analysis of personal health data. In addition, the program proved that it is possible to develop a fully featured <span class=\"caps\">PHDR</span> as an open source solution using an open source programming language such as Java and industry standard <span class=\"caps\">API</span> formats such as <span class=\"caps\">WSDL</span>. The Common Platform provided the Project HealthDesign grantees access to resources that were determined to be common to most PHAs. These resources include components such as: Medication List Management; Observations of Daily Living (ODLs); and Identity/User/Patient management. In addition to providing commonly used resources, the Common Platform personal health repository can be used by <span class=\"caps\">PHA</span> developers to enable patient-controlled data sharing with the implementation of an patient-centric access control system that allows a high degree of fine-grained access control.</p>\n<p>The Common Platform was fully implemented and utilized by seven of the Project HealthDesign grantees as a common repository for storage and sharing of patient data during round 1 of the program. The source code for the Common Platform is now available for <a href=\"http://www.projecthealthdesign.org/resources/common_platform\">download</a> from the Project HealthDesign website under an L-GPL open source license. Under an L-GPL license, developers are free to access the source, extend the data models and <span class=\"caps\">API</span> as desired, and even include the <span class=\"caps\">PHDR</span> logic in proprietary solutions built on the platform. In addition to the freely available source, a hosted instance of the Common Platform server is available for demonstration and development purposes. User and developer level access to the Project HealthDesign Common Platform Developer Environment (PHD-CDE) may be requested through the Project HealthDesign website.</p>\n<p>Despite the proprietary solutions available in the <span class=\"caps\">PHDR</span> space, there are opportunities for an open source <span class=\"caps\">PHDR</span> such as the Common Platform. Academic medical institutions focusing on research around personal health data and private organizations that prefer to locally host their patient&#8217;s personal health data are ideal candidates to leverage the work that has been done on the Common Platform. One benefit of the open source nature of the Common Platform in particular is the unrestricted freedom to expand the supported data types and web service <span class=\"caps\">API</span> operations. Another feature that sets the Common Platform apart is the flexible and powerful patient-centric role-based access control system that enables users to grant or deny access to any piece or type of data in the repository.</p>\n<p>The talk on the Project HealthDesign Common Platform will be intended for IT professionals in the healthcare field interested in developing personal health applications that can leverage personal health data repository platforms. The presentation will cover:</p>\n\n&nbsp;&nbsp;&nbsp;&#8226; The background of the Common Platform and the role it played in the Project HealthDesign program<br/>\n&nbsp;&nbsp;&nbsp;&#8226; An overview of the architecture of the system and the reasons for the selected design<br/>\n&nbsp;&nbsp;&nbsp;&#8226; A review of the personal health data types and web service operations supported by the Common Platform<br/>\n&nbsp;&nbsp;&nbsp;&#8226; A listing of the types of PHAs developed for the Project HealthDesign program in round 1 and the ways in which the Common Platform assisted the grantees in meeting their implementation goals<br/>\n&nbsp;&nbsp;&nbsp;&#8226; A description of future work under consideration during round 2 of Project HealthDesign<br/>\n&nbsp;&nbsp;&nbsp;&#8226; An analysis of how personal health data structures used to represent &#8220;Observations in Daily Living&#8221; (ODLs) differ from other data elements used in traditional medical systems such as EMRs<br/>\n&nbsp;&nbsp;&nbsp;&#8226; A discussion of the place for the Common Platform in today&#8217;s personal health data landscape and the advantages implementing a solution built on the open source Common Platform.<br/>\n<br/>\n", "title": "The Project HealthDesign Common Platform: Enabling Innovative Uses of Health Data by Personal Health Applications", "start_time": "2010-07-22T17:40:00-07:00", "track_id": 25, "user_ids": [1797], "room_id": 16, "end_time": "2010-07-22T18:00:00-07:00", "id": 1755}