{"description": "\n<p>Organizations, businesses, clubs, and all kinds of user groups around the world are using online bulletin boards to bring communities together, and phpBB is the most widely used free and open source bulletin board solution on the internet.</p>\n<p>This session will be a semi-formal unconference about focusing on phpBB, which will include a number of presentations about getting started with phpBB, getting involved with the project, and tips on how to build a successful online community, whether you&#8217;re using phpBB or any other platform.</p>\n\n\nTopics may include, but are not limited to, the following:\n\t\n&nbsp;&nbsp;&nbsp;&#8226;  What is phpBB, how does it work<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Installing phpBB and Getting Started<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Extending phpBB with MODifications and Styles<br/>\n&nbsp;&nbsp;&nbsp;&#8226; How to build and lead a successful online community<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Attracting staff to support your community (moderators and administrators)<br/>\n&nbsp;&nbsp;&nbsp;&#8226; How you can get involved with the phpBB project<br/>\n&nbsp;&nbsp;&nbsp;&#8226; And more!<br/>\n<br/>\n<p>Anyone is welcome to come participate in this &#8220;Berties of a Feather&#8221; session, which is being presented as part of the <a href=\"http://osconvasion.bbvasion.com\">OSCONvasion 2010</a> phpBB users meetup. You are also welcome to come ask questions of the other phpBB users and team members from across the West Coast who will be in attendance. Many of them will have lots of experience using phpBB and running communities and will be able to share their experiences with others interested in learning more.</p>\n<p>This session will be moderated by Douglas Bell, former phpBB MODifications Team member and the co-host of the <a href=\"http://www.phpbbweekly.net\">phpBB Weekly podcast</a>. The BoF will also be streamed live online and recorded as a special episode of the podcast.</p>\n", "title": "Creating Communities with phpBB BoF", "start_time": "2010-07-22T19:00:00-07:00", "track_id": 14, "user_ids": [285], "room_id": 10, "end_time": "2010-07-22T20:00:00-07:00", "id": 292}