{"description": "\n<p>When launching the <a href=\"http://www.npr.org/api/\"><span class=\"caps\">API</span></a> at <span class=\"caps\">OSCON</span> in 2008, <span class=\"caps\">NPR</span> targeted four audiences: the open source community; <span class=\"caps\">NPR</span> member stations; <span class=\"caps\">NPR</span> partners and vendors; and finally our internal developers and product managers.  In its short two-year life, the <span class=\"caps\">NPR API</span> has grown tremendously, from only a few hundred thousand requests per month to more than 40M.  In that growth, all four target audiences have been heavy consumers, validating our premise that the <span class=\"caps\">API</span> is critical to our digital media strategy going forward.</p>\n<p>Accordingly, <span class=\"caps\">NPR</span>&#8217;s investment in the <span class=\"caps\">API</span> has grown since that initial launch.  <a href=\"http://www.npr.org/\"><span class=\"caps\">NPR</span>.org</a> and its flash player are completely dependent on the <span class=\"caps\">API</span>.  The immensely popular <span class=\"caps\">NPR</span> News iPhone app, our Android app, and our recently launched mobile site are also wholly powered by the it.  Moreover, our distribution strategy with our member stations has been almost entirely shifted over to the <span class=\"caps\">API</span>.  Member stations, including <a href=\"http://www.wbur.org/\"><span class=\"caps\">WBUR</span></a>, <a href=\"http://www.kqed.org/\"><span class=\"caps\">KQED</span></a>, <a href=\"http://www.mpr.org/\"><span class=\"caps\">MPR</span></a> and others, are making extensive use of the <span class=\"caps\">API</span> to present richer experiences on their sites.  Meanwhile, partners like Google, Yahoo! and others are using the <span class=\"caps\">NPR API</span> to build out tools in their corresponding platforms.  In essence, all of <span class=\"caps\">NPR</span>&#8217;s distribution efforts are now based entirely or in part on the <span class=\"caps\">API</span>.</p>\n<p>Because of this strategic focus on the <span class=\"caps\">API</span>, NPR has focused resources on building the right architecture for it.  This presentation will focus on our evolving strategy, the architectures that support the <span class=\"caps\">API</span>, as well as the changes in our business and editorial processes to take advantage of the new strategy (including how we involve the open source community).  To demonstrate the success for the target audiences, I will provide many examples and a host of metrics around <span class=\"caps\">API</span> usage.</p>\n<p>As <span class=\"caps\">API</span>&#8217;s and cloud computing become much more prevalent in the digital media industry, <span class=\"caps\">API</span> adoption and consumption will become more important as media organizations fight to remain relevant to users.  Although the <span class=\"caps\">NPR</span> approach may not be achievable, or even desirable, for other media organizations, there are many great lessons to be shared.</p>\n", "title": "NPR: APIs, Mobile and Open Source", "start_time": "2010-07-23T10:00:00-07:00", "track_id": 6, "user_ids": [1887, 1893], "room_id": 12, "end_time": "2010-07-23T10:40:00-07:00", "id": 1851}