{"description": "\n<p>Node.js is a highly concurrent JavaScript server written on top of the V8\nJavaScript runtime. This is awesome for a number of reasons. Firstly Node.js\nhas re-architected some of the core module of V8 to create a server\nimplementation that is non-blocking (similar to other event driven\nframeworks like Ruby&#8217;s Event Machine or Python&#8217;s Twisted). Event driven\narchitectures are a natural fit for JavaScript developers because it’s\nalready how the browser works. By using an event driven framework Node is\nnot only intuitive to use but also highly scalable. Tests have shown Node\ninstances running tens of thousands of simultaneous users.</p>\n<p>This session will explore the architectural basics of Node.js and how it’s\ndifferent from blocking server implementations such as <span class=\"caps\">PHP</span>, Rail or Java\nServlets. We’ll explore some basic examples of creating a simple server,\ndealing with <span class=\"caps\">HTTP</span> requests, etc.</p>\n<p>The bigger question is once we have this awesome programming environment,\nwhat do we do with it? Node already has a really vibrant collection of\nmodules which provide a range of functionality. Demystifying what’s\navailable is pretty important to actually getting stuff done with Node.\nSince Node itself is very low level, lot’s of things people expect in web\nservers aren’t automatically there (for example, request routing). In order\nto help ease people into using Node this session will look at a range of the\nbest modules for Node.js.</p>\n<strong>Participants in this session will learn:</strong><br />\n\n&nbsp;&nbsp;&nbsp;&#8226; How to get started with Node.js<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Which modules are important and how to pick the ones for them<br/>\n&nbsp;&nbsp;&nbsp;&#8226; Participants should have a good understanding of JavaScript and be familiar\nwith web development to make the most of this talk.<br/>\n<br/>\n", "title": "Node.js and How JavaScript is Changing Server Programming", "start_time": "2010-07-22T16:30:00-07:00", "track_id": 20, "user_ids": [2211], "room_id": 7, "end_time": "2010-07-22T17:10:00-07:00", "id": 2163}