{"description": "\n<p>The <span class=\"caps\">HITECH</span> Act provides a significant investment in health information technology for the nation. To receive incentives, eligible providers and hospitals must demonstrate health information exchange to support continuity of care.</p>\n<p>To fulfill the requirements to establish meaningful use of certified <span class=\"caps\">EHR</span> technology, providers and hospitals need the technology means to securely transport health information. The Office of the National Coordinator for Health Information Technology (ONC) within the U.S. Department of Health and Human Services (HHS), with the guidance of a Federal Advisory Committee (the <span class=\"caps\">HIT</span> Policy Committee) established to advise <span class=\"caps\">HHS</span>, formed the <span class=\"caps\">NHIN</span> Direct project. This project is an open government initiative to facilitate public/private collaboration toward the development of transport standards allowing for health information to be pushed and routed to addressed endpoints.</p>\n<p>This presentation will describe the collaboration framework established for the <span class=\"caps\">NHIN</span> Direct project, including the participation architecture that provides for both an open community and a group of motivated stakeholders who have committed to deploy the resulting specifications in real-world implementations. The session will describe both the successes and challenges in creating this sort of facilitated collaboration framework as a model.</p>\n<p>The presentation will also describe the specifications being developed and the open source community implementing the specifications. Presenters will describe the implications of the specifications for future open source healthcare work, both directly related to the specifications, and related to an ecosystem of open source projects that can exploit the specifications.</p>\n<p><strong><a href=\"http://radar.oreilly.com/2010/06/giving-patient-data-meaningful.html\">Listen to a podcast interview with Arien Malec on open community and data exchange standards.</a></strong></p>\n", "title": "NHIN Direct: An Open Government Health IT Collaboration", "start_time": "2010-07-21T14:30:00-07:00", "track_id": 25, "user_ids": [963], "room_id": 16, "end_time": "2010-07-21T15:10:00-07:00", "id": 963}