{"494": {"website": null, "user_id": null, "submitted_at": "2010-05-06T14:45:33-07:00", "title": "State of MariaDB", "event_id": 2011, "created_at": "2010-05-06T14:45:33-07:00", "updated_at": "2010-05-15T14:45:42-07:00", "presenter": null, "affiliation": null, "id": 494, "biography": null, "description": "The talk will describe in detail the new features in MariaDB 5.1 (stable), the new features in MariaDB 5.2 (beta / RC) and what's in the upcoming MariaDB 5.3 (alpha).                                                                          \r\n                                                                                \r\nThe talk will also explains the challenges we have had to do this fork, and the various systems (like buildbot) that we used to build the binaries and how we are working with the MariaDB/MySQL community.\r\n                                                                                \r\nThis talk also includes information how we plan to continue developing MariaDB so that it still a drop in replacement of MySQL as times goes by."}, "495": {"website": null, "user_id": null, "submitted_at": "2010-05-12T19:35:57-07:00", "title": "The Rise of Hacker Spaces", "event_id": 2011, "created_at": "2010-05-12T19:35:57-07:00", "updated_at": "2010-05-15T14:20:33-07:00", "presenter": null, "affiliation": null, "id": 495, "biography": null, "description": "Leigh will be discussing hacker spaces, and the culture of DIY spaces for making things around the world."}, "492": {"website": null, "user_id": null, "submitted_at": "2010-04-10T21:28:12-07:00", "title": "Move Your Asana", "event_id": 2011, "created_at": "2010-04-10T21:28:12-07:00", "updated_at": "2010-05-19T18:24:01-07:00", "presenter": null, "affiliation": null, "id": 492, "biography": null, "description": "Yoga requires no complicated props or special place to practice. Breathing and physical postures can be done anytime, anywhere. Postures and breath practice are accessible to everyone, regardless of perceived ability. Yoga can be simple, easy and restorative. A short practice, even at a desk between phone calls, may bring lasting benefits.\r\n\r\nIn technology the body is often thought of as merely a vehicle for the brain. We tend to be so intensely focused upon the tasks of the brain that the body is often ignored until problems such as carpal tunnel, neck, shoulder and back pain arise. When the thinking and physical “bodies” are integrated we find that the system as a whole is more efficient. Hatha Yoga provides a path to help not only the mind and body function fluidly together, but it is also a means to care for the whole body before problems arise."}, "493": {"website": null, "user_id": null, "submitted_at": "2010-05-01T13:44:43-07:00", "title": "Lightning Talks", "event_id": 2011, "created_at": "2010-05-01T13:44:43-07:00", "updated_at": "2010-05-17T01:57:18-07:00", "presenter": null, "affiliation": null, "id": 493, "biography": null, "description": "h1. Lightning Talks\r\n\r\nLightning talks are short, entertaining talks up to five minutes long. In contrast to sessions, there is no approval or review; rather, speakers are self-selected on a \"who wants it most\" basis.\r\n\r\n\r\nh2. Why should I give a lightning talk?\r\n\r\nLightning talks may be for you if:\r\n\r\n * your talk proposal got turned down\r\n * you left things to the last minute\r\n * you had a great idea on the plane\r\n * you had a great idea during the conference\r\n * you like to talk\r\n\r\nh2. Why should I listen to lightning talks?\r\n\r\nSee as many talks in a single session as you will at the entire conference.\r\n \r\nh2. Logistics\r\n\r\nLightning talks will be held from 10:00 to 11:45 on Wednesday morning. \r\n\r\nA signup sheet will be posted Tuesday evening in the hallway (details TBA at the conference). Using two projectors, we should have time for at least 16 speakers, plus possible overflows.  There's no Q & A - save questions for the hallway track.\r\n\r\nYou don't even need slides, though make them XXX by XXX if you do use them. Please come prepared to present using your laptop.\r\n\r\nh2. More\r\n\r\nIf you don't get a chance to sign up, don't despair - consider starting a BoF or unconference (Friday) session.\r\n\r\nNo shilling please; you are welcome to discuss how your company contributes to open source or similar topics, but this is not the space-time to advertise, recruit or jobhunt.  Thanks.\r\n\r\nFor more information, see:\r\n * \"Pycon's Lightning Talk Page\":http://us.pycon.org/2010/conference/lightning/\r\n * \"Lightning talk tips\":http://www.perl.com/pub/a/2004/07/30/lightningtalk.html\r\n *  contact Pete Fein at pfein@pobox.com"}, "349": {"website": null, "user_id": null, "submitted_at": "2010-03-20T06:40:03-07:00", "title": "The Return of Command-Line Kung Fu", "event_id": 2011, "created_at": "2010-03-20T06:40:03-07:00", "updated_at": "2010-05-15T14:19:19-07:00", "presenter": null, "affiliation": null, "id": 349, "biography": null, "description": "The Linux/Unix command-line is an amazingly powerful programming environment.  Mastering its functionality can make you enormously more productive.  Hal Pomeranz, co-author of the weekly \"Command-Line Kung Fu\":http://blog.commandlinekungfu.com column, returns with even more command-line tips and tricks that will make you gasp with amazement and squeal with delight.\r\n\r\nIn this episode:\r\n\r\n* Fun with FIFOs\r\n* Crazy output redirection stunts\r\n* Manipulating timestamps for fun, profit, ... and EVIL!\r\n* Why sed is your friend\r\n* ... and much, much more!\r\n\r\nLast year's talk can be found \"here\":http://www.deer-run.com/~hal/Unix_Command-Line_Kung_Fu_(OSBridge).pdf -- the proposed presentation will contain entirely new material."}, "407": {"website": null, "user_id": null, "submitted_at": "2010-03-25T16:11:33-07:00", "title": " Open Source Rockets", "event_id": 2011, "created_at": "2010-03-25T16:11:33-07:00", "updated_at": "2010-05-15T14:27:00-07:00", "presenter": null, "affiliation": null, "id": 407, "biography": null, "description": "Portland State Aerospace Society (PSAS) is a student aerospace engineering project at Portland State University. We're building ultra-low-cost, open hardware and open source rockets that feature perhaps the most sophisticated amateur rocket avionics systems out there today.\r\n\r\nWith the new proposed NASA budget eliminating the US manned spaceflight program and a heap of small private space companies popping up, the way we think about getting to space is changing. Is there room for open source in this brave new (space) world? PSAS has been working on open source avionics and hardware for small rockets for several years. We present our experience with, and thoughts on the future of, open source rocketry.\r\n"}, "450": {"website": null, "user_id": null, "submitted_at": "2010-03-25T23:01:19-07:00", "title": "Open Source Ethernet I/O Convergence in the Data Center with Open FCoE, iSCSI and Data Center Bridging as building blocks of The Cloud", "event_id": 2011, "created_at": "2010-03-25T23:01:19-07:00", "updated_at": "2010-04-26T12:43:43-07:00", "presenter": null, "affiliation": null, "id": 450, "biography": null, "description": "The link to the FCoE open source project is here: http://open-fcoe.org/\r\n"}, "346": {"website": null, "user_id": null, "submitted_at": "2010-03-17T15:12:23-07:00", "title": "Please Pirate: Intellectual Unproperty", "event_id": 2011, "created_at": "2010-03-17T15:12:23-07:00", "updated_at": "2010-03-24T22:36:36-07:00", "presenter": null, "affiliation": null, "id": 346, "biography": null, "description": "\"Please Pirate\":http://pleasepirate.org/ is an alternative to copyright and other forms of IP. \r\n\r\nThe complexity of IP law limits _effective_ copyright to those able to afford an expert legal team (think: RIAA). The resulting legal uncertainty is an impediment to innovation, communication and the creation of new work. When releasing work under Please Pirate, an author encourages the audience to share, distribute, remix, etc.. This gains the broadest possible reach and frees the audience from legal risks of copyright violation.\r\n\r\nThis talk will discuss the legal, economic and cultural costs of copyright, explain Please Pirate, and compare it to other open licenses (esp. Creative Commons/BSD and the public domain). I'll also cover how Please Pirate  operate in practice: ethics in the absence of law, bridging the material and digital worlds and why *you* should release your content under Please Pirate.\r\n\r\nScreencasts of earlier lightning talks on Please Pirate  can be \"pirated at the blog\":http://pleasepirate.org/blog/ ; a manifesto is forthcoming Real Soon Now."}, "347": {"website": null, "user_id": null, "submitted_at": "2010-03-17T22:57:14-07:00", "title": "Closed Source.  Nah… scratch that.  Reverse it.", "event_id": 2011, "created_at": "2010-03-17T22:57:14-07:00", "updated_at": "2010-03-17T22:57:14-07:00", "presenter": null, "affiliation": null, "id": 347, "biography": null, "description": "Open source lifestyle on the web, off the web, not personally knowing how to code, make things better, simplicity, virtualization, decentralization, an exclusively OS internet browser, content creation management and distribution, virtual real estate, true sustainability, accessibility, the future cost of education is free, time capsules, globalization, borrowing 2 eggs from your neighbor, growing a garden, turning back the clock, internet for all, etc.  \r\nI look forward to meeting you all of June 1-4. \r\n\r\nCompany www.networkredux.com\r\nPersonal www.garettstenson.com \r\nTwitter @networkredux, @garettstenson \r\n"}, "340": {"website": null, "user_id": null, "submitted_at": "2010-03-16T12:34:41-07:00", "title": "JIT-Compiling Domain Specific Languages", "event_id": 2011, "created_at": "2010-03-16T12:34:41-07:00", "updated_at": "2010-05-15T14:23:45-07:00", "presenter": null, "affiliation": null, "id": 340, "biography": null, "description": "Creating embedded domain specific languages [DSLs] has become a popular technique for extending a general-purpose programming language with custom semantics. Traditionally, programs written in an embedded DSL can either be evaluated directly in the host language, or emit source in some lower-level language for performance. With advances in just-in-time compilation technology, viz. the Low Level Virtual Machine, programs written in embedded DSLs can be executed immediately without the overhead and delay of writing source to disk and invoking an additional compiler, and without compromising performance.\r\n\r\nDuring this talk, we will survey real world implementations of JIT-compiled embedded DSLs and their applications.\r\n"}, "341": {"website": null, "user_id": null, "submitted_at": "2010-03-16T16:23:23-07:00", "title": "Using Django on the Djob", "event_id": 2011, "created_at": "2010-03-16T16:23:23-07:00", "updated_at": "2010-03-16T16:23:23-07:00", "presenter": null, "affiliation": null, "id": 341, "biography": null, "description": "Django is a great framework for building public web sites, but it's also a great platform for building connected business apps. This session will examine use cases where Django presents an opportunity to build powerful, robust systems on a budget.\r\n\r\nUse cases will include:\r\n - Secure document drop box & routing\r\n - Clickable business intelligence\r\n - Moving to HTML5"}, "342": {"website": null, "user_id": null, "submitted_at": "2010-03-16T17:02:19-07:00", "title": "Introduction to SnapLogic", "event_id": 2011, "created_at": "2010-03-16T17:02:19-07:00", "updated_at": "2010-03-16T17:02:19-07:00", "presenter": null, "affiliation": null, "id": 342, "biography": null, "description": "SnapLogic is an open source platform for building system integrations that can be scripted or extended in Python and Java.  With SnapLogic, complex integrations are broken down into discrete components that act upon data streams. \r\n\r\nUsing this framework, it is possible to build conduits among homogenous SaaS systems, databases, etc.  In this session, we'll introduce the system and walk through the code to create a new integration target: a SaaS system with an XML API. \r\n\r\nA commercial entity has formed around this platform and has created a marketplace for third-party developers to sell their integration recipes and expertise. We'll take a look at that both as an interesting example of commercializing F/OSS and as a potential opportunity for independent devs."}, "451": {"website": null, "user_id": null, "submitted_at": "2010-03-25T23:15:17-07:00", "title": "Making your information online findable", "event_id": 2011, "created_at": "2010-03-25T23:15:17-07:00", "updated_at": "2010-05-15T14:24:05-07:00", "presenter": null, "affiliation": null, "id": 451, "biography": null, "description": "If you have a business, there are things that people may want to find about you. \r\n\r\nLike your hours. Your physical address. Your phone number. What you specialize in.\r\n\r\nThese things might be on your website, but consider this: your customers may never end up there. They might not be able to find it. Or, they might be diverted by the Google Local feature. \r\n\r\nThese things are simple, but frequently forgotten in the glow of some shiny bit of Flash or Flex.\r\n\r\nWe'll talk about some best practices to make sure that your customers can find what they need on your website. And then we'll talk about some best practices to make sure that they can find what you need even if they never make it to your website.\r\n\r\nIf you're already into SEO, this will be too basic for you. But if you're hearing from your clients that they can't find you online, this session is for you."}, "348": {"website": null, "user_id": null, "submitted_at": "2010-03-17T23:25:10-07:00", "title": "Understanding and building scalable software paradigms", "event_id": 2011, "created_at": "2010-03-17T23:25:10-07:00", "updated_at": "2010-03-17T23:25:10-07:00", "presenter": null, "affiliation": null, "id": 348, "biography": null, "description": "*Overview:*\r\nThe road lay ahead, success or failure, and how you respond early will help determine your outcome. With much planning, thought, and expense you've built the greatest tribute to innovation, Solving a problem, filling a need or answering the call of excellence. All worthy pursuits in the attempt to obtain your goals and roll out your product or solution. Success!! People are using it. One problem, people are using it.\r\n\r\nYou suddenly realize that the hardware isn't adequate to meet the need. Throw more hardware at it, great but is that the problem? Does your solution adequately scale? Would you benefit from RESTful, load balancing solutions? How much can you achieve and hope to achieve with development best practices.\r\n\r\nAs a software engineer, architect, CFO or CIO do you have a clear road map of what your future looks like? Many of us have seen Field of Dreams and are familiar with the quote \"If you build it, they will come\". This can be a boon or a bust based upon your ability to ramp up and leverage technology and forward thinking solutions\r\n\r\n*Solution:*\r\nSuccess is more than having a project completed. It is also knowing when and how to successfully apply the litmus test to your design patterns. As well as your architecture as a whole. Join me while we separate fact, from fiction, and discuss the best approaches for the task at hand."}, "452": {"website": null, "user_id": null, "submitted_at": "2010-03-25T23:16:26-07:00", "title": "Free Content for Good: Producing 30 Hour Day", "event_id": 2011, "created_at": "2010-03-25T23:16:26-07:00", "updated_at": "2010-05-24T17:03:35-07:00", "presenter": null, "affiliation": null, "id": 452, "biography": null, "description": "More info on 30 Hour Day can be found here: http://30HourDay.org"}, "409": {"website": null, "user_id": null, "submitted_at": "2010-03-25T16:22:35-07:00", "title": "Behaviour Driven Infrastructure", "event_id": 2011, "created_at": "2010-03-25T16:22:35-07:00", "updated_at": "2010-04-20T22:27:38-07:00", "presenter": null, "affiliation": null, "id": 409, "biography": null, "description": "The typical enterprise monitoring and configuration management set-up for a website is:\r\n\r\n    * Is the Apache package installed and the appropriate version?\r\n    * Is the Apache service running?\r\n    * Can I connect to the HTTP port and is HTML returned?\r\n\r\nMultiply this by a few hundred iterations of hosts and types of services and you’re probably looking at your typical Nagios, Puppet, Cfengine, Hyperic, Tivoli or Patrol set-up.\r\n\r\nAll this monitoring misses something critical though – we’re not actually monitoring that the service does what it should. Yes, it matters whether Apache is installed, the Apache service is running, and you can connect to HTTP but does this actually prove anything about the availability of the service we’re managing and providing for our customers? Nope…\r\n\r\nWe need to demonstrate more than just a check that says the Apache server is up. We need to demonstrate that the service delivered by that infrastructure was available to our customers AND functioning as intended.\r\n\r\nEnter Behaviour Driven Infrastructure or BDI which applies the principles of Behavioural Driven Development to the management of infrastructure. In this presentation you’ll learn:\r\n\r\n    * How Behaviour Driven Development works\r\n    * What makes a behavioural test\r\n    * How to install and use Cucumber to perform BDI\r\n    * Practical examples of behavioural tests in Cucumber, and\r\n    * How to integrate BDI into your work flow and your enterprise monitoring and configuration management frameworks."}, "408": {"website": null, "user_id": null, "submitted_at": "2010-03-25T16:20:38-07:00", "title": "Puppet for Beginners", "event_id": 2011, "created_at": "2010-03-25T16:20:38-07:00", "updated_at": "2010-05-15T14:32:38-07:00", "presenter": null, "affiliation": null, "id": 408, "biography": null, "description": "Puppet is a popular open-source configuration management solution. It’s written in Ruby and in use by organizations around the world to manage their assets more cheaply, more effectively, and with a view to delivering a higher quality of service.\r\n\r\nPuppet is one of the easiest infrastructure tools you’ll ever use but it’s still helpful to have a hands-on introduction to how to get started. This tutorial doesn’t cover the deep technical details but allows you to focus on doing useful work as soon as possible.\r\n\r\nIn the course of the tutorial you’ll be exposed to most of the tools and configuration you will use in a functioning Puppet installation. By the end of the tutorial we’ll produce a simple Puppet architecture that can manage a few key services and applications. We’ll also demonstrate some of the more interesting problems Puppet simplifies solving and give you pointers towards developing more advanced Puppet patterns."}, "453": {"website": null, "user_id": null, "submitted_at": "2010-03-25T23:19:35-07:00", "title": "Copyright lawyers can Gödel", "event_id": 2011, "created_at": "2010-03-25T23:19:35-07:00", "updated_at": "2010-05-15T14:27:19-07:00", "presenter": null, "affiliation": null, "id": 453, "biography": null, "description": "Supporters of the *IAA and other IP-arians have been steadily increasing the length, breadth, depth, and scope of copyright coverage to the increasing annoyance of many.  \r\n\r\nSome day they may go too far.\r\n\r\nOr maybe they already have.  \r\n\r\nConsider the following axioms:\r\n\r\n* Copyright on a work extends to digital representations of that work (e.g. audio to CDs)\r\n* Copyright on a digital work extends to compressed forms (e.g. MP3s)\r\n* Distribution of a work that includes a significant portion of another, copyrighted work (e.g. sampling) requires permission of the copyright holder.\r\n\r\nThe IP industry would be reluctant to part with any of these, but if they (and the court system) were rational they would be well advised to jettison at least one of them; combined they give us all we'd need to shut down Hollywood, the music industry, and any other content-distributors (including the whole internet) provided only we can find a judge with a strong enough math background."}, "440": {"website": null, "user_id": null, "submitted_at": "2010-03-25T22:23:57-07:00", "title": "Organizing user groups, a panel discussion", "event_id": 2011, "created_at": "2010-03-25T22:23:57-07:00", "updated_at": "2010-05-25T01:07:47-07:00", "presenter": null, "affiliation": null, "id": 440, "biography": null, "description": "User groups are a vital part of the open source way. Their regular meetings create local communities of practitioners that meet together to learn, share and have fun. \r\n\r\nA group of experienced user group organizers will answer your questions and offer practical advice on starting a group, encouraging participation, branching out into activities like hackfests, and handling problems as they crop up.\r\n\r\nAttendees will have the opportunity to get practical knowledge from a variety of user group leaders' perspectives, and leave the session empowered to start their own user group or reinvigorate an existing one.\r\n\r\nParticipants:\r\n* Audrey Eschright, moderator\r\n* Igal Koshevoy, organizer of the \"Portland Ruby Brigade\":http://pdxruby.org/ and \"Portland Functional Programming Study Group\":http://pdxfunc.org/\r\n* Jesse Hallett, organizer of the \"Portland JavaScript Admirers\":http://pdxjs.com/\r\n* Eric Wilhelm, organizer of the \"Portland Perl Mongers\":http://portland.pm.org/kwiki/\r\n* Christie Koehler, co-organizer of \"Code-n-Splode\":http://codeandsplode.org/\r\n* Gabrielle Roth, co-organizer of \"Code-n-Splode\":http://codeandsplode.org/ and the \"Portland PostgreSQL Users Group\":http://pugs.postgresql.org/pdx\r\n* Sam Keen, organizer of \"PDXPHP\":http://pdxphp.org/"}, "331": {"website": null, "user_id": null, "submitted_at": "2010-03-14T21:09:30-07:00", "title": "A day in the life of Facebook Operations", "event_id": 2011, "created_at": "2010-03-14T21:09:30-07:00", "updated_at": "2010-05-15T14:39:48-07:00", "presenter": null, "affiliation": null, "id": 331, "biography": null, "description": "Facebook is now the #2 global website, responsible for billions of photos, conversations, and interactions between people all around the world running on top of tens of thousands of servers spread across multiple geographically-separated datacenters. When problems arise in the infrastructure behind the scenes it directly impacts the ability of people to connect and share with those they care about around the World.\r\n\r\nFacebook’s Technical Operations team has to balance this need for constant availability with a fast-moving and experimental engineering culture. We release code every day. Additionally, we are supporting exponential user growth while still managing an exceptionally high radio of users per employee within engineering and operations.\r\n\r\nThis talk will go into how Facebook is “run” day-to-day with particular focus on actual tools in use (configuration management systems, monitoring, automation, etc), how we detect anomalies and respond to them, and the processes we use internally for rapidly pushing out changes while still keeping a handle on site stability."}, "369": {"website": null, "user_id": null, "submitted_at": "2010-03-24T16:26:36-07:00", "title": "Interacting with a group of servers in real-time with MCollective", "event_id": 2011, "created_at": "2010-03-24T16:26:36-07:00", "updated_at": "2010-04-26T12:42:55-07:00", "presenter": null, "affiliation": null, "id": 369, "biography": null, "description": "While configuration management gives us the ability to define and configure a large set of servers easily, its often hard to _interact_ with them in real time. Also consider the fact that many of the current cloud platforms means the locations and IPs of your machines change quite often. \"MCollective\":http://code.google.com/p/mcollective/ tries to solve these problems and much more by providing a framework to overcome these limits.\r\n\r\nYou can almost think of MCollective as a command line extension to your configuration management tool. You can create tools that allow you to think of your infrastructure as a _whole unit_ instead of individual servers. It can be used as for reporting, parallel job execution (i.e. reload apache on all servers matching a condition), collective middleware maintenance, and many other tasks.\r\n\r\nI’ll cover the following topics in the session:\r\n* Design and Features\r\n* Installation\r\n* Common tasks\r\n* Advanced use cases\r\n* Extending functionality\r\n"}, "330": {"website": null, "user_id": null, "submitted_at": "2010-03-14T19:11:19-07:00", "title": "Working successfully outside the cube", "event_id": 2011, "created_at": "2010-03-14T19:11:19-07:00", "updated_at": "2010-03-14T19:19:00-07:00", "presenter": null, "affiliation": null, "id": 330, "biography": null, "description": "There is a growing trend in the IT industry to have employees who work outside the confines of a traditional office. This enables companies to save money on office space and furniture, and be able to attract talent that is in a different geographical region than they are located in. But there are lots of challenges to this as well, such as being able to collaborate with remote workers and making them feel “part of the team”, which can be challenging. In this talk, I’ll draw upon my own personal experiences of being a “cube” worker and being a successful remote employee, and talk about the challenges and benefits and how to best implement this in your organization."}, "366": {"website": null, "user_id": null, "submitted_at": "2010-03-24T11:30:29-07:00", "title": "Considering in-house automated web testing?", "event_id": 2011, "created_at": "2010-03-24T11:30:29-07:00", "updated_at": "2010-05-15T14:19:44-07:00", "presenter": null, "affiliation": null, "id": 366, "biography": null, "description": "From the best available tools, to the ongoing work load, to the known and recommended methodologies, this talk will walk you through all you need to think about when setting up your own test automation infrastructure. \r\n\r\nIt will also outline all the other available options you have for running your testing continuously using Open Source tools in combination with commercial services.\r\n\r\nA good overview of some of the things you might hear about can be found here: http://adamchristian.com/archives/358"}, "456": {"website": null, "user_id": null, "submitted_at": "2010-03-26T11:24:10-07:00", "title": "Server optimization for high traffic web systems using multiple retry and learning timeout patterns", "event_id": 2011, "created_at": "2010-03-26T11:24:10-07:00", "updated_at": "2010-04-26T12:43:56-07:00", "presenter": null, "affiliation": null, "id": 456, "biography": null, "description": "Server optimization for high traffic web systems using multiple retry and learning timeout patterns.\r\n\r\nMultiple Retry is a feature meant to optimize system resource utilization while still allowing a webpage to accommodate requests that might take a long time for the responses to come back. It uses two open source technologies Squid and Traffic Server (recently open sourced by Yahoo! under apache license).\r\n\r\nThe main principle behind it is to delegate the request to an offline proxy system such as SQUID to perform the actual request. This allows the initial request to use a very small timeout but yet the proxy system will continue to wait for the request to complete and then cache the response once it comes back. A subsequent request or 'retry request' is made to check the data in the proxy system cache instead of the actual source. The timed out request sends the squid key back to the client to track the availability of the resource quickly without going through the normal web server route. \r\n\r\nThe traffic server which can handle thousands of concurrent connections has a plugin which can quickly check the status of the key from squid directly and if the data is indeed available, can forward the request to corresponding web servers.\r\n\r\nWith this approach, server resource does not need to be tied up for the entire duration for the response to come back. Instead, just use limited resource to fire the request and then tell the client(browser) to wait a period of time before firing another request(retry request) to check for response. As a result, transferring a significant amount of wait time from server resources to the client side and freeing up that server resource to process other requests. Each retry request will be optimized to firstly just check whether the data is available in cache using the traffic server plugin before executing the webpage or module which requires that data. This saves the need to process a webpage or a module only to find that the data is not yet available in cache and process the page only once the data is indeed available thus saving cpu cycles. Since the request reaches web server only when data is available and hence it is an efficient utilization of server processes.\r\n\r\nAlso an additional challenge the system need to address is determining what timeouts to use for each retry. This could be tracked by a very simple state at server and slowly adjusted and learned with requests to determine the optimal time interval to be given for retries and reducing failed attempts.\r\n\r\nThus for very high traffic systems like yahoo homepage , where we have data coming from different external sources with varying timeouts we can defer the request for multiple retry and load the page as soon as possible. Each retry request would be extremely fast to just check for the data availability in cache thus freeing server time and other processing resources. This solution does not require keep-alive connections to be maintained and hence has very little server setup overhead."}, "367": {"website": null, "user_id": null, "submitted_at": "2010-03-24T15:41:06-07:00", "title": "Speeding up your PHP Application", "event_id": 2011, "created_at": "2010-03-24T15:41:06-07:00", "updated_at": "2010-05-15T14:35:04-07:00", "presenter": null, "affiliation": null, "id": 367, "biography": null, "description": "There has been a lot of interest in PHP performance lately, spurred by\r\nFacebook's HipHop PHP announcement in February.  Most people don't know\r\nhow fast their site is and will make uninformed architecture decisions or\r\nspend time optimizing the wrong things based mostly on myths and innuendo.\r\nThis talk will try to get you started down the path of a systematic \r\napproach to benchmarking, profiling and optimizing your entire web site.\r\n\r\nFor those of you who were at my performance talk last year, consider this part 2 of that talk with new deep-dives into Wordpress and HipHop PHP."}, "332": {"website": null, "user_id": null, "submitted_at": "2010-03-15T07:30:18-07:00", "title": "Debt-Free: Technical Debt In Open Source Projects", "event_id": 2011, "created_at": "2010-03-15T07:30:18-07:00", "updated_at": "2010-04-20T21:32:48-07:00", "presenter": null, "affiliation": null, "id": 332, "biography": null, "description": "Open source projects often face a choice: does the project get done correctly or quickly? These kind of choices lead to the accrual of \"technical debt\" – the time and effort required to refactor code that wasn’t done right the first time. Learn how to avoid technical debt with real life examples and strategies that promote time management, project management, and good coding practices."}, "423": {"website": null, "user_id": null, "submitted_at": "2010-03-25T19:29:55-07:00", "title": "Infrastructure as Code", "event_id": 2011, "created_at": "2010-03-25T19:29:55-07:00", "updated_at": "2010-05-15T14:35:56-07:00", "presenter": null, "affiliation": null, "id": 423, "biography": null, "description": "Infrastructure as code brings with it a single promise: enable the re-construction of the business from nothing but a source code repository, an application data backup, and bare metal resources.\r\n\r\nIn this session, I'll walk you through the skills you need to cultivate in order to fulfill this vision - you'll gain an understanding of Service Oriented Architectures, Configuration Management and Systems Integration, along with some insight on how to talk about the business value of operations."}, "422": {"website": null, "user_id": null, "submitted_at": "2010-03-25T19:18:27-07:00", "title": "Awesome things you've missed in Perl", "event_id": 2011, "created_at": "2010-03-25T19:18:27-07:00", "updated_at": "2010-04-26T12:43:23-07:00", "presenter": null, "affiliation": null, "id": 422, "biography": null, "description": "Awesome things have been happening in Perl recently; so many that even if you've been paying close attention, you may have missed a few. In this talk we'll examine some of the coolest recent technologies for Perl programmers, including:\r\n\r\n* Overhauling Perl's Object Oriented framework with Moose.\r\n\r\n* Making everything a first-class object with autobox.\r\n\r\n* Slashing your error handling code with autodie.\r\n\r\n* Building fast, readable and reusable regular expressions with Perl 5.10.\r\n\r\n* Bundling and building stand-alone applications using PAR, the Perl Archiver.\r\n\r\n* Astonishingly good profiling with Devel::NYTProf.\r\n\r\n* Playing MineSweeper automatically with App::SweeperBot.\r\n\r\nKnowledge of Perl is nice, but not essential to appreciate the contents of this talk."}, "362": {"website": null, "user_id": null, "submitted_at": "2010-03-23T17:13:50-07:00", "title": "Fixing the enterprise: How open source developers got it right, and how to evangelize the heathen", "event_id": 2011, "created_at": "2010-03-23T17:13:50-07:00", "updated_at": "2010-03-23T17:13:50-07:00", "presenter": null, "affiliation": null, "id": 362, "biography": null, "description": "All enterprises developing software with distributed teams, whether commercial or open source, can benefit from the experiences of open source developer communities.  Many of these communities have been extraordinarily successful in rapidly developing sophisticated, commercial-grade software using teams of programmers distributed around the globe.  This session covers the best software development practices of open source communities and the applicability of those best practices to the enterprise.  Examples will be drawn from the java.net, openoffice.org, and tigris.org communities, which all develop on the CollabNet Platform, and from CollabNet’s own internal software development efforts."}, "424": {"website": null, "user_id": null, "submitted_at": "2010-03-25T19:50:45-07:00", "title": "A Cloud To Call Your Own - Building Services On Open Nebula", "event_id": 2011, "created_at": "2010-03-25T19:50:45-07:00", "updated_at": "2010-05-21T07:18:26-07:00", "presenter": null, "affiliation": null, "id": 424, "biography": null, "description": "Cloud computing is all about smart, dynamic allocation of the computing resources you have at hand. It doesn't take the resources of Amazon or Google to build a small private cloud for your own needs. Keith Hudgins will show you how to use off-the-shelf open source components to build and manage a real, working cloud infrastructure complete with networking and storage management, and do it all in plain view!\r\n\r\nThe cloud stack being demonstrated is based on Open Nebula, a leading open-source virtual infrastructure management tool from Spain. Comparable to Eucalyptus or vSphere, yet easily extensible and hackable via Ruby and C. It's the brains of the beast, handling API calls, telling your VMs where to live, and what they can do with themselves.\r\n\r\nChef is a configuration management tool built on Ruby that makes it easy to wrangle your servers into shape. It rides herd on all of our components to easily control our cloud.\r\n\r\nXen is not only one of the leading hypervisors available today, it also runs on almost any reasonable processor, so you can build your cloud with the spare boxes you have in your closet!\r\n\r\nBest of all, the scripts and recipes used to provision and deploy this rag-tag band of freedom fighting software will be open sourced and available to you!\r\n\r\nhttp://www.opscode.com/chef/\r\nhttp://opennebula.org/start\r\nhttp://www.xen.org/\r\n\r\nThe presentation will walk through these tools, the architecture and resources you need to build a cloud of your own. The recipes and resource references presented will be open sourced as part of the presentation."}, "414": {"website": null, "user_id": null, "submitted_at": "2010-03-25T17:45:13-07:00", "title": "ALM 2.0 – Adopting Open Source Collaboration to Develop Better Software, Faster", "event_id": 2011, "created_at": "2010-03-25T17:45:13-07:00", "updated_at": "2010-03-25T17:45:13-07:00", "presenter": null, "affiliation": null, "id": 414, "biography": null, "description": "Corporate software development organizations have long sought to connect development tools that support individual development life-cycle activities like requirements management, project management, coding, SCM, testing, and build and release management. This challenge has prevented developers from effectively collaborating, enforcing processes, tracing artifact relationships, and gathering meaningful metrics across the full development life cycle. \r\n\r\nNow, a new generation of tools is driving ALM 2.0. This presentation explains how to take advantage of open source collaborative best practices to effectively work across distributed development teams.  ALM 2.0 tools, dynamics, and processes needed to ensure rapid internal adoption and ROI will also be discussed.\r\n"}, "378": {"website": null, "user_id": null, "submitted_at": "2010-03-24T22:14:11-07:00", "title": "You Shall Not Pass: Managing Expectations and Boundaries with Clients ", "event_id": 2011, "created_at": "2010-03-24T22:14:11-07:00", "updated_at": "2010-05-15T14:48:52-07:00", "presenter": null, "affiliation": null, "id": 378, "biography": null, "description": "We all struggle to maintain the scope of projects, but it's sometimes difficult to tell a client \"no\". After all, they're the ones paying you, and they want you to deliver exactly what is in their head. It's not simple to manage their expectations, but not doing it can sink a project.\r\n\r\nThis session is going to go into the motivations behind clients pushing on companies to deliver more. It's also going to talk about why and how you should push back in order to ultimately create a better experience for everyone on the project. So you can get back to coding and not have the sinking feeling of dread when you open your email. \r\n\r\nWe're focusing on CMS projects as examples, but the lessons are applicable across software development projects. "}, "416": {"website": null, "user_id": null, "submitted_at": "2010-03-25T17:52:24-07:00", "title": "perl5i: Perl 5 Improved", "event_id": 2011, "created_at": "2010-03-25T17:52:24-07:00", "updated_at": "2010-04-26T12:43:18-07:00", "presenter": null, "affiliation": null, "id": 416, "biography": null, "description": "Perl 5 was designed in 1995, and because of its devotion to backwards compatibility, its largely stuck there. But Perl programmers have long since moved on advancing the state of the art in the form of CPAN modules.  When you write a Perl 5 program you either have to use the outdated core language, or you have to find, install and use two dozen CPAN modules.  This turns off newbies, they don't know which CPAN modules to use, and annoys experienced programmers who are tired of having to DIY over and over again.\r\n\r\nperl5i is a single Perl module to bring the best of CPAN together under one roof, working together under a sensible language design.  Unlike Perl 6, perl5i is an evolutionary development, remaining compatible with Perl 5.  Yet it can selectively and safely break compatibility... even with itself!  Its released, well tested and intended for production use.\r\n\r\nperl5i makes Perl fun again.  It fixes the default behaviors.  It makes references pleasant to work with.  It embraces techniques like exceptions, autoboxing and objects in a way Perl 5 really never did.  It solves the problem of backwards compatibility slowly strangling a language.\r\n\r\nIf you used to program Perl, come take another look.\r\nhttp://search.cpan.org/perldoc?perl5ifaq"}, "417": {"website": null, "user_id": null, "submitted_at": "2010-03-25T17:53:46-07:00", "title": "Should there be a free software app store?", "event_id": 2011, "created_at": "2010-03-25T17:53:46-07:00", "updated_at": "2010-04-20T21:52:01-07:00", "presenter": null, "affiliation": null, "id": 417, "biography": null, "description": "Since free software \"is a matter of liberty, not price\", developers and distributions are allowed to ask users to pay for free software (though most users can easily choose not to).  Musicians like Radiohead have experimented with asking, but not requiring, users to pay for music (by choosing their own price, which could be $0).  What would happen if we did this for free software?\r\n\r\nI'll consider what developers like about the extraordinarily restrictive environment of the iPhone app store (it's not just the money) and whether an app store would be a useful funding model for some free software projects.  Since Canonical is exploring app store-like functionality in the Ubuntu Software Centre, this may happen soon anyway.  Will such an app store solicit \"donations\" or \"purchases\"?  Will it confuse users about their rights and obligations, or about the difference between free and proprietary software?  How will it change free software developers' incentives?"}, "410": {"website": null, "user_id": null, "submitted_at": "2010-03-25T17:06:35-07:00", "title": "Django 102 - past the introduction", "event_id": 2011, "created_at": "2010-03-25T17:06:35-07:00", "updated_at": "2010-03-25T17:06:35-07:00", "presenter": null, "affiliation": null, "id": 410, "biography": null, "description": "This presentation is about the helpful things that you learn after having built and deployed several Django sites.  I'll talk about some good ways to debug your Django project, helpful resources, I'll discuss organizing your Django project in a clean way, and I'll show you how to deploy your project on a server using WSGI."}, "411": {"website": null, "user_id": null, "submitted_at": "2010-03-25T17:10:52-07:00", "title": "GeoDjango", "event_id": 2011, "created_at": "2010-03-25T17:10:52-07:00", "updated_at": "2010-03-25T17:10:52-07:00", "presenter": null, "affiliation": null, "id": 411, "biography": null, "description": "I've been working on a GeoDjango based side project for a while.  I'll show you the ropes on using GeoDjango with Google Maps and PostGIS.  I'll even give you a few shortcuts that will help you manage the giant stack of dependencies you get with GeoDjango."}, "412": {"website": null, "user_id": null, "submitted_at": "2010-03-25T17:21:38-07:00", "title": "How To Report A Bug", "event_id": 2011, "created_at": "2010-03-25T17:21:38-07:00", "updated_at": "2010-05-15T14:35:51-07:00", "presenter": null, "affiliation": null, "id": 412, "biography": null, "description": "The process of reporting a bug starts off with two strikes against it.  The user is angry; they're taking time away from doing their work to report a bug.  The developers are annoyed; some freeloader is telling them they made a mistake and they have to take time to fix it.  Accusations fly.  Tempers get heated.  Nobody is happy.  Nobody wants to help anyone.\r\n\r\nDevelopers often treat bug reports like the user dumped a bag of crap on their doorstep, rang the bell and told them to clean it up.  That's not what they are.  A bug report is a user walking up to your door, stepping in crap, pointing out maybe it should be cleaned up.\r\n\r\nNobody likes stepping in crap.  And nobody likes cleaning it up.  So the whole interaction starts off on the wrong foot, perhaps the one covered in crap.  Your job, as developer or as reporter, is to deliberately steer it back to being a positive one where the developer wants to fix your bug and the reporter wants to continue to report bugs.\r\n\r\nAs a user, and as a developer, some simple social hacks will turn bug reporting from a hateful shoutfest into a pleasant collaboration.  We'll look at some dos and don'ts when reporting and receiving a bug, how to provide enough information, avoid a hostile tone, make it easy to report and track bugs, and how to keep your head when all you really want to do is bash someone's in.\r\n\r\nAs a developer, you'll encourage more and better quality feedback from your users and even pick up new developers in the process.  As a user, developers will find your reports so delightful they'll enjoy patching it.  And you'll both improve the software you use and love.\r\n"}, "413": {"website": null, "user_id": null, "submitted_at": "2010-03-25T17:33:39-07:00", "title": "REPENT!!!  FOR THE END OF THE UNIX EPOCH IS NIGH!!!", "event_id": 2011, "created_at": "2010-03-25T17:33:39-07:00", "updated_at": "2010-04-26T12:47:57-07:00", "presenter": null, "affiliation": null, "id": 413, "biography": null, "description": "Beneath the smooth veneer of your shiny Web 2.0 app or fancy new dynamic programming language or powerful database is pit of barely contained screaming demons which run our computers.  These demons are held in check by a diminishing army of stalwart obsessive-compulsive C programmers.  It is an unglamorous world of unfashionable programming languages and technologies, but somebody has to do it.  I'm going to show you a little bit of this world and reveal how that unless these unglamorous, unsung sewer workers of the computing world do their job the world will end in 2038.\r\n\r\nI'll do it by showing you how your computer calculates the time and date. Sounds simple? Its not.\r\n\r\nCalendaring is hard. Calendaring is very hard. Its also a little crazy. OK, its a lot of crazy. Fortunately there’s a small band of equally crazy people who make it all work so you don’t have to know anything about the crazy.\r\n\r\nWe’re going to look at some of that crazy, reveal the madness.\r\n\r\nWe’ll see that computers suck at math.\r\n\r\nWe’ll discover that there are time zones on Mars.\r\n\r\nWe’ll look at the 2038 bug effecting 32 bit systems, why you care about it now in 2010 and how to protect yourself against it.\r\n\r\nWe’ll peek at the hidden time limits in the protocols and programs you use every day.\r\n\r\nWe’ll better appreciate the people who keep that swarming pit of demons in check and powering your lolcat generator"}, "371": {"website": null, "user_id": null, "submitted_at": "2010-03-24T16:44:50-07:00", "title": "Software is Culture", "event_id": 2011, "created_at": "2010-03-24T16:44:50-07:00", "updated_at": "2010-03-24T16:44:50-07:00", "presenter": null, "affiliation": null, "id": 371, "biography": null, "description": "All teams are a tribe which is defined by their culture and tribal knowledge. Although software development is considered a technical activity, it is a human activity which is influenced by interactions between individuals and those interactions are influenced by individuals.\r\n\r\nThe influence of engineering economics, i.e. resource availability and distribution, on a tribe is often ignored or discounted. It can be a major cultural influence.\r\n\r\nThe presentation focuses on the importance of culture and its impact on software development, the impact of individuals on culture and how culture influences individuals.\r\n"}, "370": {"website": null, "user_id": null, "submitted_at": "2010-03-24T16:44:10-07:00", "title": "Clojure: Towards The Essence Of Programming", "event_id": 2011, "created_at": "2010-03-24T16:44:10-07:00", "updated_at": "2010-03-24T16:44:10-07:00", "presenter": null, "affiliation": null, "id": 370, "biography": null, "description": "Clojure is wonderful new language for the JVM that's really making waves: a functional Lisp dialect with full interoperation with Java, and a suite of excellent concurrency utilities ... but it's more than that.\r\n\r\nClojure is a highly expressive and highly adaptable language that allows you to focus on your craft in a way traditional languages such as Java and C# do not. In this session, we'll introduce the language and its core utilities and then introduce the fundamental concepts of functional programming as they apply to Clojure. Clojure has been described as a \"high level language beamed back from the near future\" ... come see what your future may hold, and why you're really going to like it! "}, "373": {"website": null, "user_id": null, "submitted_at": "2010-03-24T17:09:28-07:00", "title": "Haiku: The Other FLOSS OS", "event_id": 2011, "created_at": "2010-03-24T17:09:28-07:00", "updated_at": "2010-04-26T12:42:59-07:00", "presenter": null, "affiliation": null, "id": 373, "biography": null, "description": "Tired of using an open source clone of an operating system from the late 70s? How about an open source clone of an operating system from the late 90s!\r\n\r\nBeOS was a bright OS star in the era of Windows ME and the pre-OSX Mac operating systems. Designed from the ground up to be pervasively multithreaded, BeOS met with critical, if not commercial, success. A decade after Be, Inc closed its doors, Haiku is close to releasing its first major revision.\r\n\r\nI'll walk you through Haiku from a user perspective, and then from an architectural perspective. See what makes this OS tick, why it's interesting, and how you can help the project out."}, "372": {"website": null, "user_id": null, "submitted_at": "2010-03-24T16:49:51-07:00", "title": "Meta-Programmng Java with Tapestry 5", "event_id": 2011, "created_at": "2010-03-24T16:49:51-07:00", "updated_at": "2010-03-24T16:49:51-07:00", "presenter": null, "affiliation": null, "id": 372, "biography": null, "description": "At multiple levels, the Tapestry web framework includes features that allow you to meta-program Java: that is, let the framework write a lot of your code for you. We'll do a quick survey of these  approaches, and show how you can use annotations instead of inheritance or complex inheritance to accomplish cross-cutting concerns such as logging, transaction support and security checks."}, "375": {"website": null, "user_id": null, "submitted_at": "2010-03-24T18:53:21-07:00", "title": "Moonlighting in Sunlight – How to work on independent projects and have a day job.", "event_id": 2011, "created_at": "2010-03-24T18:53:21-07:00", "updated_at": "2010-05-15T14:21:53-07:00", "presenter": null, "affiliation": null, "id": 375, "biography": null, "description": "Two local lawyers will discuss the legal issues and best practices involved in balancing the interests of employers, employees and projects. Topics to be addressed may include: \r\n1) For employees: Does my employer own what I work on in my spare time? Can my employer stop me from writing my own blog? Can I use something I developed at work in my side project?\r\n2) For employers: How do I get good employees without risking my proprietary products? Can I allow employees to participate in open source projects?\r\n3) For projects: How do I get good contributors without risking claims from their employers?"}, "374": {"website": null, "user_id": null, "submitted_at": "2010-03-24T17:54:06-07:00", "title": "Nothing But Nines: Achieving %99.999 Uptime with Open Source High Availability Clustering", "event_id": 2011, "created_at": "2010-03-24T17:54:06-07:00", "updated_at": "2010-04-15T09:47:10-07:00", "presenter": null, "affiliation": null, "id": 374, "biography": null, "description": "This talk is an introduction to the Distributed Replicated Block Device (DRBD) and how it can be used in conjunction with Pacemaker as a building block for high availability (HA) clusters.   \r\n\r\nDRBD stands for Distributed Replicated Block Device, and as the name\r\nimplies, allows you to replicate block devices over TCP. DRBD is extremely flexible due to the fact it is a block device, and as such is used in a variety of situations.  Pacemaker is the definitive cluster resource manager for Linux allows nodes to be managed and monitored for failure to ensure maximum service-level resilience and fault tolerance.  With the two forming the foundation of your cluster, virtually any open source service can be replicated and managed between pairs of nodes to provide cost-effective high availability.  Maximize your uptime while minimizing costs.   \r\n\r\nTo start, this talk will cover the basics of DRBD and an introduction to Pacemaker and high availability concepts.  The instructor will demonstrate the configuration and implementation of a high availability cluster from the ground up using DRBD, Pacemaker and a standard LAMP stack as an example.  If time permits, other new and interesting uses of DRBD will be covered. \r\n\r\nAttendees should have some basic understanding of TCP/IP, client/server technologies, Linux block devices and filesystems."}, "377": {"website": null, "user_id": null, "submitted_at": "2010-03-24T21:34:16-07:00", "title": "Harnessing the Social Web with OpenSocial 0.9", "event_id": 2011, "created_at": "2010-03-24T21:34:16-07:00", "updated_at": "2010-04-26T12:43:04-07:00", "presenter": null, "affiliation": null, "id": 377, "biography": null, "description": "OpenSocial is an open source project which defines a standardized API for accessing social data and interacting with social features within social networking platforms.  Creating a standard method across many supporting platforms, application developers can easily deploy their products over many containers using standardized JavaScript and APIs.\r\n\r\nStandardizing methods for accessing and setting social profile information on a third party network through JavaScript or server side APIs, OpenSocial seeks to provide a \"develop once, distribute broadly\" approach to social network application development.  With dozens of OpenSocial supported containers, OpenSocial is an open source project which attempts to standardize web 2.0 development.  \r\n\r\nThis session will review some of the core feature sets of OpenSocial 0.9 and how to socialize application development exploring:\r\n* Using OpenSocial JavaScript to access profile information\r\n* Implementing application vitality streams to drive an application viral\r\n* Simplifying standard utilities such as AJAX or JSON manipulation\r\n* Exploring OpenSocial server-side API standards\r\n\r\nFurther to a look at the newest version of OpenSocial, we'll explore the new standards and enhancements coming in OpenSocial 1.0."}, "376": {"website": null, "user_id": null, "submitted_at": "2010-03-24T21:30:16-07:00", "title": "Listening to Data - Sonification Using Open Source Tools", "event_id": 2011, "created_at": "2010-03-24T21:30:16-07:00", "updated_at": "2010-05-15T14:31:15-07:00", "presenter": null, "affiliation": null, "id": 376, "biography": null, "description": "Data visualization - telling stories about data using graphics and animation - is a popular technique, and new tools, both proprietary and open source, appear almost daily, as do huge datasets to analyze.\r\n\r\nBut there's another way to explore large datasets - by mapping the properties of data points into music. This technique is called _*sonification*_, and adds another interesting dimension to exploratory data analysis.\r\n\r\nIn this presentation, I'll briefly describe the main techniques of sonification, then present some examples where sonification was key in understanding the story behind the data. And, of course, you'll get to hear the music that's in the data."}, "318": {"website": null, "user_id": null, "submitted_at": "2010-03-10T12:44:58-08:00", "title": "Slideware", "event_id": 2011, "created_at": "2010-03-10T12:44:58-08:00", "updated_at": "2010-04-20T23:38:19-07:00", "presenter": null, "affiliation": null, "id": 318, "biography": null, "description": "We'll start with a typical slideshow practice: cutting and pasting source code into Keynote. For small projects, this may be all you need. A few handy shortcuts can help streamline the process.\r\n\r\nWith anything longer than a lightning talk, you're probably looking for ways to make sure your audience sees the same up-to-date, tested source code that's sitting in version control. We'll see how to refresh the code on your slides automatically, while preserving the beautiful syntax highlighting you see in your text editor.\r\n\r\nNext, we'll look at how to tie your project into more code-friendly presentation software, such as the open-source Showoff package by GitHub's Scott Chacon. Finally, we'll finish off with a few auxiliary topics: preparing your slides for sharing on the web, adding a soundtrack, and so on."}, "313": {"website": null, "user_id": null, "submitted_at": "2010-03-08T12:18:08-08:00", "title": "CouchApp Evently Guided Hack w/ CouchDB", "event_id": 2011, "created_at": "2010-03-08T12:18:08-08:00", "updated_at": "2010-05-25T01:08:02-07:00", "presenter": null, "affiliation": null, "id": 313, "biography": null, "description": "Apache CouchDB can host HTML5 apps natively, serving them over HTTP. Learn how to write JavaScript CouchApps which run on both the client and the server.\r\n\r\nWe'll assume you are familiar with jQuery and your command-line shell of choice, and that you have an installed copy of CouchDB (at least version 0.11).\r\n\r\nWe'll be hacking on Taskr, first I'll show you all how to run it, then we'll collaborate on code. Here's Taskr: http://github.com/jchris/taskr/\r\n\r\nIf you want to hack server side Mustache templates, you should install the latest version of Sofa: http://github.com/jchris/sofa \r\n\r\nWe'll hack on this too."}, "312": {"website": null, "user_id": null, "submitted_at": "2010-03-03T20:32:42-08:00", "title": "HipHop for PHP", "event_id": 2011, "created_at": "2010-03-03T20:32:42-08:00", "updated_at": "2010-05-15T14:38:58-07:00", "presenter": null, "affiliation": null, "id": 312, "biography": null, "description": "The main challenge of the project was bridging the gap between PHP and C++. PHP is a scripting language with dynamic, weak typing. C++ is a compiled language with static typing. While PHP allows you to write magical dynamic features, most PHP is relatively straightforward. It's more likely that you see if (...) {...} else {..} than it is to see function foo($x) { include $x; }. This is where we gain in performance. Whenever possible our generated code uses static binding for functions and variables. We also use type inference to pick the most specific type possible for our variables and thus save memory.\r\n\r\nThe transformation process includes three main steps:\r\n\r\n1. Static analysis where we collect information on who declares what and dependencies,\r\n2. Type inference where we choose the most specific type between C++ scalars, String, Array, classes, Object, and Variant, and\r\n3. Code generation, which for the most part is a direct correspondence from PHP statements and expressions to C++ statements and expressions.\r\n\r\nWe have also developed HPHPi, which is an experimental interpreter designed for development. When using HPHPi you don't need to compile your PHP source code before running it. It's helped us catch bugs in HipHop itself and provides engineers a way to use HipHop without changing how they write PHP.\r\n\r\nOverall HipHop allows us to keep the best aspects of PHP while taking advantage of the performance benefits of C++. In total, we have written over 300,000 lines of code and more than 5,000 unit tests. All of this will be released this evening on GitHub under the open source PHP license.\r\n"}, "311": {"website": null, "user_id": null, "submitted_at": "2010-03-03T16:37:54-08:00", "title": "XHP for PHP", "event_id": 2011, "created_at": "2010-03-03T16:37:54-08:00", "updated_at": "2010-05-15T14:36:52-07:00", "presenter": null, "affiliation": null, "id": 311, "biography": null, "description": "XHP is a PHP extension which augments the syntax of the language such that XML document fragments become valid PHP expressions.  It fits somewhere between a templating language and a programmatic UI library.  XHP allows you to use PHP as a stricter templating engine and offers a very straightforward way of implementing reusable, extensible components.  Facebook is increasingly using this technology across our web presence, include our home page, dashboards, and lite.facebook.com.  \r\n\r\nThis session will cover: how XHP works; syntax of building simple, complex, and dynamic structures; and using XHP as building blocks that cater to your web apps.  I'll include lessons Facebook has learned about moving quickly from concept to product using XHP."}, "289": {"website": null, "user_id": null, "submitted_at": "2010-02-20T01:54:33-08:00", "title": "On predicting predictors: hacking archive formats for fun and prophecy", "event_id": 2011, "created_at": "2010-02-20T01:54:33-08:00", "updated_at": "2010-02-22T09:45:06-08:00", "presenter": null, "affiliation": null, "id": 289, "biography": null, "description": "Existing projects like \"pristine-tar\":http://kitenet.net/~joey/code/pristine-tar/ focus on finding the right options to the compression code to reproduce the file from the uncompressed data (\"gzip -9 --rsyncable\"), treating the file formats as magic black boxes. Our in-depth analysis of archive formats lets us record just enough information to reproduce any archive regardless of the tool used to produce it."}, "317": {"website": null, "user_id": null, "submitted_at": "2010-03-10T10:42:12-08:00", "title": "How Two Fools Made Themselves Indispensible From Their Basement Office", "event_id": 2011, "created_at": "2010-03-10T10:42:12-08:00", "updated_at": "2010-05-15T14:31:10-07:00", "presenter": null, "affiliation": null, "id": 317, "biography": null, "description": "The Story: \r\nBlending the right open source software with a sprinkling of custom code was the easy part of moving a university from a brochure web presence into an integrated, flexible, efficient and scalable system. The challenge was to encourage staff not to settle for misfit, off-the-shelf solutions but rather to think creatively about the possibilities, to be demanding about getting their needs met and to embrace change and take ownership of their web domain.\r\n\r\nThings We Learned:\r\n- A project management cycle that works.\r\n\r\n- How to find and blend the right OS packages (in our case a Joomla and Moodle core with lots of custom extensions) to meet the needs of multiple audiences.\r\n\r\n- Training and implementation techniques that do not overwhelm.\r\n\r\n\r\n\r\n"}, "316": {"website": null, "user_id": null, "submitted_at": "2010-03-09T18:52:04-08:00", "title": "Joy of Index", "event_id": 2011, "created_at": "2010-03-09T18:52:04-08:00", "updated_at": "2010-04-26T12:42:33-07:00", "presenter": null, "affiliation": null, "id": 316, "biography": null, "description": "Every SQL database needs indexes, but which indexes?  Learn how to index, when to index, why to index, and how to feel after you've indexed.\r\n\r\nIn 40 minutes, you will learn a set of basic principles which will help you decide how to index your databases which apply to almost any SQL database.  You will also discover the PostgreSQL tools which allow you to check if you've indexed correctly on that DBMS."}, "315": {"website": null, "user_id": null, "submitted_at": "2010-03-09T18:10:29-08:00", "title": "Give a Great Tech Talk", "event_id": 2011, "created_at": "2010-03-09T18:10:29-08:00", "updated_at": "2010-05-15T14:19:34-07:00", "presenter": null, "affiliation": null, "id": 315, "biography": null, "description": "While a terrific presentation may take talent, making a good one is a\r\nmatter of science and practice. As generations of Toastmasters have\r\nproved, anyone can do it. Veteran conference presenter Josh Berkus\r\nwill go over his tech talk tips in detail in order to help you improve\r\nyour presentation skills. Programmer and slide-slinger Ian Dees will\r\ntake on the specific topics of showing code to an audience and\r\ncomposing your slides.\r\n\r\n  * How to prepare for a talk\r\n  * Nobody cares about your slides\r\n  * ... but make good ones anyway\r\n  * 7 terrible habits of ineffective presenters\r\n  * Audience interaction 101\r\n  * When your demo crashes\r\n  * Curate your code examples\r\n  * The audience outside the lecture hall\r\n\r\nSpeakers who are giving talks later in the conference are especially\r\nencouraged to attend."}, "314": {"website": null, "user_id": null, "submitted_at": "2010-03-09T16:04:36-08:00", "title": "When Bad Data Happens To Good People", "event_id": 2011, "created_at": "2010-03-09T16:04:36-08:00", "updated_at": "2010-04-26T12:42:27-07:00", "presenter": null, "affiliation": null, "id": 314, "biography": null, "description": "Has bad data happened to you?  Has it happened repeatedly, and in several different ways?  Are you at your wits' end trying to figure out what to do about all this bad data?\r\n\r\nHave no fear!  Bad data is curable, and you can prevent it from repeating.  Database doctor Josh Berkus will briefly lead attendees through and exploration of the types of bad data and some of the practices and tools they can use to prevent it."}, "393": {"website": null, "user_id": null, "submitted_at": "2010-03-25T12:04:19-07:00", "title": "Geohacking: 2010 Edition", "event_id": 2011, "created_at": "2010-03-25T12:04:19-07:00", "updated_at": "2010-05-03T17:40:22-07:00", "presenter": null, "affiliation": null, "id": 393, "biography": null, "description": "Here's a laundry list of tips, tricks, and hacks you can do with geolocation on the Web today ranging from the mundane to the insane. From viewing multiple datasets on a map to integrating GPS data into a video feed for simultaneous position tracking, you're bound to learn something to improve your stalking... er, I mean build better map-savvy apps."}, "392": {"website": null, "user_id": null, "submitted_at": "2010-03-25T12:01:09-07:00", "title": "Drupal & other CMS for Nonprofits", "event_id": 2011, "created_at": "2010-03-25T12:01:09-07:00", "updated_at": "2010-03-25T23:24:24-07:00", "presenter": null, "affiliation": null, "id": 392, "biography": null, "description": "Few gift communities are better suited for each other than open source and nonprofits. Few open source approaches are better suited to nonprofit's website needs than a CMS. We'll talk some about Wordpress, Joomla and Plone and then go into more detail about Drupal, using examples, covering the possibilities (e.g. CiviCRM, Organic Groups, etc), going over the challenges, pointing out resources and referencing several surveys. Our view is that Drupal is top of the pile, but we regularly recommend other CMS to nonprofits, depending on their needs, available skills and their prospects for future growth. This talk will try to hit all the high points and give folks a strong overview and a sense of direction.\r\n\r\nOne speaker is a coder who works for a nonprofit - a trust which both funds and advises nonprofits - and the other is a designer and themer who has worked on a range of nonprofit projects. The substance of the talk will be based on experience, resources in the community, our own nonprofit Drupal sites and the advice we regularly give to nonprofits on their web needs."}, "391": {"website": null, "user_id": null, "submitted_at": "2010-03-25T11:54:32-07:00", "title": "CRUD for the Web: OData, GData, and You", "event_id": 2011, "created_at": "2010-03-25T11:54:32-07:00", "updated_at": "2010-03-25T11:54:32-07:00", "presenter": null, "affiliation": null, "id": 391, "biography": null, "description": "There are many APIs for working with data on the Web available today... way too many. Almost every site or service with an API rolls their own interface to work with their data. This inconsistent approach limits access, creates needless silos, and hinders the evolution of the Web.\r\n\r\nWe've seen great benefits from standardizing _Read_ with RSS and Atom syndication; imagine what we could do if we standardized _Create_, _Update_ and _Delete_ as well. \"That's what the Open Data Protocol (OData)\":http://odata.org/ and the \"Google Data Protocol (GData)\":http://code.google.com/apis/gdata/index.html aim to do. Learn about these efforts, how they are used, and why you should adopt them for your next web API."}, "390": {"website": null, "user_id": null, "submitted_at": "2010-03-25T11:53:45-07:00", "title": "Creating Embedded Linux Products with OpenEmbedded", "event_id": 2011, "created_at": "2010-03-25T11:53:45-07:00", "updated_at": "2010-05-15T14:23:31-07:00", "presenter": null, "affiliation": null, "id": 390, "biography": null, "description": "Getting started in embedded Linux development can be intimidating. Every hardware device vendor seems to have its own embedded Linux distribution and way of developing for it. OpenEmbedded is a framework for creating highly customizable embedded Linux distributions. It provides a well-designed build system and cross-compilation environment to developers, and a robust package management system for setting up and maintaining your embedded Linux system.\r\n\r\nFind out why OpenEmbedded is taking the embedded world by storm and improving the lives of embedded Linux developers.\r\n\r\nThis presentation will be accessible to a wide developer and IT audience. Some knowledge of how Linux distributions are put together will be helpful, but not essential."}, "397": {"website": null, "user_id": null, "submitted_at": "2010-03-25T13:22:06-07:00", "title": "The Fine Line Between Creepy and Fun", "event_id": 2011, "created_at": "2010-03-25T13:22:06-07:00", "updated_at": "2010-05-15T14:48:29-07:00", "presenter": null, "affiliation": null, "id": 397, "biography": null, "description": "From targeted advertising based on your site profile or browsing habits, to checkins on geolocation services like Foursquare or Gowalla, we know we're putting a substantial amount of personal data out there for others to use. And as developers, we may find ourselves stumbling into hot button areas we don't know how to handle. \r\n\r\nWe'll explore personal data usage and try to sort out what elements create creepy or fun outcomes for the user, then talk about how to hack together experiments that reveal collisions between our underlying assumptions and how data is actually being used.\r\n\r\nAttendees will take away a better understanding of why people share personal data, what they expect to get from it, and how not to be so creepy (unless that's what you're after).\r\n"}, "396": {"website": null, "user_id": null, "submitted_at": "2010-03-25T12:28:37-07:00", "title": "Hair and Yak Again -- A Hacker's Tale", "event_id": 2011, "created_at": "2010-03-25T12:28:37-07:00", "updated_at": "2010-05-15T14:25:52-07:00", "presenter": null, "affiliation": null, "id": 396, "biography": null, "description": "\"Yak Shaving\" is the seemingly useless and endless task you do on the way to accomplishing a simple thing with software (such as destroying the one ring in the fires of Mordor).  It's also the reason we have frameworks (orcs), libraries (goblins), and abstraction layers (balrogs).  If not for open source software, all programmers would ever do is shave yaks in the deep of Moria.\r\n\r\nWe'll journey to the evil eye of software's complexity, see how interfaces evolve, and why the simplest things still turn into epics.  This session covers several years of my professional meddling in open source, Perl infrastructure, the CPAN, CAD/graphics software, and GUI toolkits.  I'll expound on API design, abstraction, non-blocking code, parallelism, interfaces, how code gets turned into sausage, and why we need more bacon.  I'll also discuss community, collaboration, and bug reports.\r\n\r\nWhether you're a long-time contributor to open source projects, or just starting as a user, this should give you some insight into how the pieces fit together, why \"the stack\" is really just a pile of hobbits, and how we haven't even ventured out of the Shire yet."}, "395": {"website": null, "user_id": null, "submitted_at": "2010-03-25T12:26:43-07:00", "title": "HyperCard 2010: Why Johnny Can't Code (and What We Can Do About It)", "event_id": 2011, "created_at": "2010-03-25T12:26:43-07:00", "updated_at": "2010-05-15T14:22:09-07:00", "presenter": null, "affiliation": null, "id": 395, "biography": null, "description": "My friend Alex is a lighting designer. He had an idea for a HyperCard stack he wanted to write, to help him coordinate lighting cues with a script; unfortunately, his PowerBook 140 is no more, so a written script he has to follow manually is the best he can do. To explore the state of citizen coding in 2010, I've implemented Alex's simple idea as many ways as I could, and we've still got a long way to go.\r\n\r\nSo what happened to HyperCard? Photo editing, music production, page layout and publishing—all these dreams of 1980s computation have evolved and matured into world-class software, while HyperCard and its descendents have languished. We know that there are citizen coders, like Alex, who want to contribute. Why can't they? Does creation not scale?\r\n\r\nComputation becomes ever more mainstream, and today we sit at an inflection point: while social networks and devices encourage passive consumption over creativity, we have a unique challenge—and opportunity—to provide tools to help consciously perceive and manipulate our increasingly digital environment. HyperCard's time has nearly come: we are called to widen the reach of code beyond our geek niche.\r\n\r\nCitizen coding candidates touched on:\r\n- HTML + JavaScript\r\n- Shoes\r\n- Processing\r\n- Cocoa (1990s Apple kids programming environment)\r\n- HyperCard 2.4\r\n- Web HyperCard clones - various\r\n- Sk8\r\n- Quartz Composer\r\n- PowerPoint/Keynote\r\n- RealBasic\r\n- CouchApps\r\n- Squeak eToys\r\n- MacRuby\r\n- Novell Visual AppBuilder (1994)\r\n- Self\r\n- SuperCard?\r\n- Prototyping tools - var.\r\n- etc.\r\n\r\n\r\n\r\n(I'm submitting as a short-form talk, because that's as long as I can imagine my talk being, but this could be a fun long-form workshop as well—do a quick overview & discussion of the problem, split people up into groups, try and get everyone to bang out an idea in some framework they've never seen before, maybe even hash out some concrete ideas for HyperCard 2010.)"}, "394": {"website": null, "user_id": null, "submitted_at": "2010-03-25T12:16:45-07:00", "title": "Open Source Configuration Sharing by Power Users/Developers Using YAML in a Wiki", "event_id": 2011, "created_at": "2010-03-25T12:16:45-07:00", "updated_at": "2010-03-25T12:16:45-07:00", "presenter": null, "affiliation": null, "id": 394, "biography": null, "description": "With over 1,000 features and configuration options, the open source TikiWiki CMS/Groupware platform has been used for applications ranging from web content management, online collaboration, file sharing, documentation, intranet/extranet, project/event management, knowledge sharing/management, wiki, blogging, social media, and online community. With over 200 people who have committed code to the project, there are hundreds of thousands of Tiki installations worldwide, including the Firefox Support site that is directly linked from in-browser help.\r\n\r\nWith so many possibilities for different uses, the Tiki Community was looking for a way to rapidly deploy applications on the platform, avoiding tedious and repeated \"reinventing the wheel\" configuration of the many individual features. These deployment configurations are defined in YAML, a popular machine-parsable data serialization format that is designed for human readability. Called Tiki Profiles, these configurations are extremely modular, and can be combined to form larger applications. For example, it is possible to combine the configurations for a Time Sheet, a Task List and a Consultant List, to create a basic consultant time-management system. When executed, the Tiki Profiles engine will automatically configure necessary features, create content pages, data structures, user groups, permissions, and input forms that make up the application.\r\n\r\nThese modular configurations in easy-to-learn YAML are shared just like open source code, but within a wiki, profiles.tikiwiki.org. Not just developers, but power users and business analysts can enhance or combine these configurations, leading to new and innovative applications for the platform. For example, the basic consultant time-management system as mentioned above can easily be augmented with a Budget Tracking application to enhance billing management. Repeated application configuration becomes easy, and application variants can be managed more effectively as incremental add-ons to the same base Tiki Profile.\r\n\r\nThe same approach of open-source sharing of configurations should be applicable to most platforms that involve significant numbers of configuration options and choices leading to differing applications. It can also allow power-users and not just coders to be more involved in contributing to the open source community."}, "399": {"website": null, "user_id": null, "submitted_at": "2010-03-25T13:37:49-07:00", "title": "Using Modern Perl", "event_id": 2011, "created_at": "2010-03-25T13:37:49-07:00", "updated_at": "2010-05-15T14:30:57-07:00", "presenter": null, "affiliation": null, "id": 399, "biography": null, "description": "It's easy to find examples of poorly-written Perl code: global variables, punctuation soup, copy and paste code, commented-out functions.  Who'd want to read that?  Who could maintain it?\r\n\r\nModern Perl code is different.  The past decade has produced important new features and powerful new techniques for writing clear, concise, maintainable, and reusable Perl.  These new developments build on each other to replace awkward, painful, or difficult to use correctly approaches with simple code.\r\n\r\nLearn how to understand context, to embrace lexical scoping, to manage CPAN installations without pain, to perform pain-free automated testing, to embrace the CPAN development model, to adopt new features of Perl 5.10 and 5.12, and to take advantage of the Moose object system.\r\n\r\nLearn about the Perl renaissance and rediscover the joy of Perl."}, "398": {"website": null, "user_id": null, "submitted_at": "2010-03-25T13:28:50-07:00", "title": "Building a GNU Cross-Compiler Toolchain for Microcontrollers", "event_id": 2011, "created_at": "2010-03-25T13:28:50-07:00", "updated_at": "2010-03-25T13:29:57-07:00", "presenter": null, "affiliation": null, "id": 398, "biography": null, "description": "Compiler: GCC, G++, other languages\r\nAssembler: GAS\r\nLinker: GNU-ld\r\nLibrary: newlib\r\nDebugging: GDB\r\nSystem initialization\r\nBootloaders\r\n"}, "305": {"website": null, "user_id": null, "submitted_at": "2010-02-24T14:47:21-08:00", "title": "The Future of Mobile: Learn to Build W3C Widgets and Device APIs with PhoneGap", "event_id": 2011, "created_at": "2010-02-24T14:47:21-08:00", "updated_at": "2010-02-24T14:47:21-08:00", "presenter": null, "affiliation": null, "id": 305, "biography": null, "description": "With more than 4.6 billion handsets on the planet, we know the future of the web is mobile, but what's the future of mobile? The latest builds of mobile browsers include HTML5 APIs, which enable speedy hardware-accelerated CSS, offline capability, client-side storage, geolocation and other goodies. But, what's next?   \r\n\r\nTwo web technologies are ushering in the next generation of mobile apps: widgets and device APIs. As self-contained web apps, widgets significantly improve user experience. Device APIs do more than extend web apps to mobile devices. They allow access to native device sensors, like the accelerometer and camera, and to data such as photos and contacts. By adding widgets and device APIs to your toolbox, you can start building sophisticated mobile apps now. \r\n\r\nIn this session, PhoneGap hacker Brian LeRoux will guide you through the step-by-step creation of a W3C widget. He'll show you how to combine it with device APIs and deploy it using the PhoneGap open source framework. Don't miss this session to learn how to develop for the mobile web of the future, today\r\n\r\nLearn more about:\r\n\r\nWidgets: http://www.w3.org/TR/widgets/\r\nDevice APIs: http://www.w3.org/2009/dap\r\nPhoneGap: http://phonegap.com"}, "379": {"website": null, "user_id": null, "submitted_at": "2010-03-24T22:22:57-07:00", "title": "SELECT * FROM Internet Using YQL", "event_id": 2011, "created_at": "2010-03-24T22:22:57-07:00", "updated_at": "2010-05-15T14:31:21-07:00", "presenter": null, "affiliation": null, "id": 379, "biography": null, "description": "The Yahoo! Query Language provides a rich and dynamic method for obtaining and manipulating data from any source or API on the internet – with YQL the internet becomes your database.  Using the simplified SQL syntax that YQL is based in, YQL seeks to open all data on the web into a standardized format.  Manipulating and mashing up sources as if they were tables, YQL becomes a repository for exploring government, event, social and API data on the web.\r\n\r\nThis talk will cover the core techniques within YQL, including server-side JavaScript with native E4X support for manipulating data, key / value pair data storage and the process of creating your own YQL tables for accessing web based content.  Going further with the integration of the open authentication standards defined by OAuth, we’ll delve into advanced authentication techniques using this standard within YQL.  "}, "304": {"website": null, "user_id": null, "submitted_at": "2010-02-24T14:21:13-08:00", "title": "PHP for professional folks", "event_id": 2011, "created_at": "2010-02-24T14:21:13-08:00", "updated_at": "2010-02-24T14:21:13-08:00", "presenter": null, "affiliation": null, "id": 304, "biography": null, "description": "Join this session if you are interested in learning about the latest and greatest tools and techniques available to the PHP community. The talk will look at the latest features of PHP 5.3 and a sneak peak at how they have been applied in the next generation of the Symfony PHP framework.\r\n\r\nThis hacking session will go through a simple project from beginning to end illustrating how to apply the latest concepts from PHP 5.3.\r\n\r\nhttp://symfony-reloaded.org/"}, "415": {"website": null, "user_id": null, "submitted_at": "2010-03-25T17:46:41-07:00", "title": "Fixing SSL security: Supplementing the certificate authority model", "event_id": 2011, "created_at": "2010-03-25T17:46:41-07:00", "updated_at": "2010-05-15T14:22:20-07:00", "presenter": null, "affiliation": null, "id": 415, "biography": null, "description": "The most common way of using SSL/TLS encryption relies on a public-key infrastructure that puts near-absolute trust in a large number of entities around the world, any one of which could accidentally or deliberately empower anyone in between us and our communication partners to impersonate any site or service and spy on all of our communications.  We've seen that these certificate authorities can make mistakes.  CA mistakes, or collaboration with attackers, can expose us to undetectable man-in-the-middle attacks, so we need new mechanisms to meaningfully double-check that they're doing the right thing.\r\n\r\nI will discuss a whitepaper and research collaboration that are exploring the available sources of information that could help address this problem."}, "429": {"website": null, "user_id": null, "submitted_at": "2010-03-25T20:39:34-07:00", "title": "Everything you ever wanted to know about Amazon EC2 ", "event_id": 2011, "created_at": "2010-03-25T20:39:34-07:00", "updated_at": "2010-03-25T20:39:34-07:00", "presenter": null, "affiliation": null, "id": 429, "biography": null, "description": "Whether it's deploying a website that needs to scale to support spikes in traffic, or running a cluster of testing bots, Amazon's pay-only-for-what-you-use model of renting servers by the hour is very appealing to hackers and business people alike. When you realize that virtual servers are disposable, and that you can launch a new one in a matter of minutes programatically, you architect your application differently, to take advantage of the transient nature of the servers. But this transiency is also an advantage because you decouple the parts so they are no longer co-mingled, thus making your site more resilient to failure.\r\n\r\nThis talk will discuss the wonderful world of Amazon Web Services (AWS), and in particular Amazon EC2. We will explain how you can use Elastic Block Storage to make a virtual disk that can hold up to 1TB of data, how you can auto-scale your application using Amazon's monitoring services, and how you can create Amazon Machine Images (AMI) to distribute your software in the form of a bootable virtual machine and more.\r\n\r\nWe will look at several real-life examples of open source software applications that have been deployed to Amazon EC2, and what particular tools and strategies we leveraged to streamline the deployment and hosting of these applications. We'll look at Fabric, ElasticFox, silverlining and discuss other tips and tricks."}, "428": {"website": null, "user_id": null, "submitted_at": "2010-03-25T20:25:34-07:00", "title": "'Open Source Business Models' and other mythical creatures", "event_id": 2011, "created_at": "2010-03-25T20:25:34-07:00", "updated_at": "2010-05-21T07:18:30-07:00", "presenter": null, "affiliation": null, "id": 428, "biography": null, "description": "A humorous look at the taxonomy of Open Source ecosystems and the businesses that support/are supported by them based on one person's reflections and observations on two years spent building an open source business and selling 'free'.\r\n\r\nThe background for my perspective is my role building Reductive Labs as a business. In this role, I had the opportunity to interact with interesting characters and scenarios in the 'Open Source' world.\r\n\r\nI will present a taxonomy of approaches to Open Source Business and their pros and cons, complete with anonymized personas, strategies and situations. Names will be changed to protect the innocent.\r\n\r\nExcept for me, you'll know I'm guilty.\r\n"}, "441": {"website": null, "user_id": null, "submitted_at": "2010-03-25T22:26:16-07:00", "title": "iizip: Hacking together your own Dropbox", "event_id": 2011, "created_at": "2010-03-25T22:26:16-07:00", "updated_at": "2010-05-15T14:48:55-07:00", "presenter": null, "affiliation": null, "id": 441, "biography": null, "description": "Dropbox is probably the current leader in the storage application and service space for desktop users. Featuring an auto-commit-and-update mechanism to transparently send updates to a file repository, changes are reflected on any other machine in near real-time.\r\n\r\nUnfortunately, while Dropbox promises security, you cannot use your own infrastructure for data storage. Most data security policies would make this a show stopper for many organizations that wish to deploy such a facility.\r\n\r\nBy gluing a few existing open source tools together, you can replicate the functionality with a version control system, a file system watcher and a scheduled task. Add in a sprinkling of open protocols and communications mechanisms and iizip promises to deliver what Dropbox currently cannot - flexibility, security and openness.\r\n\r\nIn this talk, Ben Dechrau will discuss the problem, the solution and give a live demonstration of the current system. He will discuss the implementation and design decisions and cover the road map ahead.\r\n\r\nAttendees will be rewarded for challenging those decisions, clever heckling and funny jokes with the intention that healthy discussions will help guide iizip on its rightful path to world domination."}, "442": {"website": null, "user_id": null, "submitted_at": "2010-03-25T22:26:42-07:00", "title": "Migrate your data into Drupal the not-so-hard way", "event_id": 2011, "created_at": "2010-03-25T22:26:42-07:00", "updated_at": "2010-05-03T01:42:56-07:00", "presenter": null, "affiliation": null, "id": 442, "biography": null, "description": "If you use any CMS, your data is databased -- which is great until you decide to use Drupal. Sure, Drupal is difficult enough to be interesting and full of possibility -- but how to do you get the data into Drupal without doing data entry? \r\n\r\nWell, there's a module (or three) for that. Using Table Wizard with Schema and Migrate can not only allow you to get your data into Drupal, but it can transform it into first class nodes that you can manipulate using Views. \r\n\r\nWe'll show a real-world situation: taking events entered into proprietary software, extracting the data, and using the power of Drupal to make it sing. We'll how to take raw data from a comma delimited file, clean it up, and get it into Drupal using Table Wizard & PhpMyAdmin. Then, we'll show how Migrate can take that awkward database table and turn it into a content type."}, "421": {"website": null, "user_id": null, "submitted_at": "2010-03-25T18:38:52-07:00", "title": "Cassandra: Strategies for Distributed Data Storage", "event_id": 2011, "created_at": "2010-03-25T18:38:52-07:00", "updated_at": "2010-05-15T14:35:23-07:00", "presenter": null, "affiliation": null, "id": 421, "biography": null, "description": "Cassandra is an open source, highly scalable distributed database that's rapidly gaining momentum in the NoSQL community.  It brings together Dynamo's fully distributed design and Bigtable's ColumnFamily-based data model to provide a unique data storage solution that is suitable to a wide variety of use cases.\r\n\r\nProfessor Eric Brewer's CAP theorem states that a distributed system design can offer at most two out of three desirable properties: Consistency, Availability, and Partition Tolerance.  So, how do you provide consistency when your distributed system's primary requirements are availability and partition tolerance?\r\n\r\nIn this talk we'll introduce eventual consistency and the four strategies that Cassandra uses to provide it, while still maintaining high availability:\r\n* Gossip\r\n* Read Repair\r\n* Hinted Hand-off\r\n* Anti-Entropy\r\n\r\n"}, "420": {"website": null, "user_id": null, "submitted_at": "2010-03-25T18:31:46-07:00", "title": "Git (Mostly) For Drupal", "event_id": 2011, "created_at": "2010-03-25T18:31:46-07:00", "updated_at": "2010-03-25T18:31:46-07:00", "presenter": null, "affiliation": null, "id": 420, "biography": null, "description": "Drupal Core is switching from CVS to git causing an avalanche of developers to switch their projects as well.  ISAGN for a git tutorial tailored for Drupal.\r\n\r\nWe'll cover four git use cases.  Using it as a single developer: creating repositories, adding files, committing, diffing, logging.  Basic version control use.\r\n\r\nCollaborating with another project gets into forking repositories, keeping your fork in sync, branching and merging.\r\n\r\nFinally, managing a project has its own set of considerations.  Keeping track of forks, remote branches and pulling and cherry picking changes from collaborators.\r\n\r\nA Drupal project has some special considerations that other projects don't, and we'll cover them.  In particular, using remote vendor branches to track Drupal core and modules, cleanly upgrading your projects and merging in your local patches.\r\n\r\nThrough it all, we'll see how the apparent dizzying complexity of git's command set hides an underlying elegance of implementation; how understanding that implementation leads to a greater understanding of git; and how that simplicity and efficiency makes git more powerful in the long run than something like Subversion can be.\r\n"}, "364": {"website": null, "user_id": null, "submitted_at": "2010-03-23T22:48:16-07:00", "title": "Being a Catalyst in Communities - The science behind the open source way", "event_id": 2011, "created_at": "2010-03-23T22:48:16-07:00", "updated_at": "2010-05-15T14:27:15-07:00", "presenter": null, "affiliation": null, "id": 364, "biography": null, "description": "Red Hat is admired as a successful business that is an effective catalyst in communities, especially free/libre open source software (FLOSS). People look to learn from Red Hat in how to apply those practices to areas beyond software, such as education, business, and social activism.\r\n\r\nHowever, when we look at the way other people have enacted these practices, many have adopted a subset of Red Hat's methods, but leave out enough to affect their ability to benefit from a purely free/open stance.\r\n\r\nMany communities are successful in their domain without any idea of why their methods work. Is it pure luck or art? Or is it really a dose of humanism mixed with a long-practiced, and now well-studied, method of developing communities?\r\n\r\nThis presentation explores the science behind \"communities of practice\", then covers a specific set of guidelines included in a new open, community-written guide, \"The Open Source Way: Creating and nurturing communities of contributors\".\r\n\r\nhttp://theopensourceway.org"}, "365": {"website": null, "user_id": null, "submitted_at": "2010-03-24T11:20:20-07:00", "title": "Automating Flex/Flash with Windmill or Selenium", "event_id": 2011, "created_at": "2010-03-24T11:20:20-07:00", "updated_at": "2010-03-24T16:52:13-07:00", "presenter": null, "affiliation": null, "id": 365, "biography": null, "description": "As we see more full fledged Flex/Flash applications out there, we need a way to automate the testing of their user interfaces. We also want to run those tests intuitively integrating with the rest of our functional tests.\r\n\r\nThis talk will give you an idea of how to make your application testable, how to build your tests, and the options you have available for running them regularly to ensure the quality of your application."}, "425": {"website": null, "user_id": null, "submitted_at": "2010-03-25T19:51:57-07:00", "title": "Practical Facebook stalking with Open Source tools", "event_id": 2011, "created_at": "2010-03-25T19:51:57-07:00", "updated_at": "2010-05-15T14:45:34-07:00", "presenter": null, "affiliation": null, "id": 425, "biography": null, "description": "Want to find out what your friends were doing on the weekend?  Curious which parties you aren't getting invited to?  Wish you could contact that interesting person you met at a 3,000 person event, but you only got their first name?  Want to know what your potential new employee really does in their spare time?  Or do you just like data, and lots of it?\r\n\r\nIn this talk we'll learn some simple tricks with open source tools that can help you access a wealth of information from the largest collection of social data ever created.  We will also examine techniques and practices to help control what data you expose to the techniques presented."}, "363": {"website": null, "user_id": null, "submitted_at": "2010-03-23T17:18:26-07:00", "title": "Stoking the fires: How to sell your work without selling your soul", "event_id": 2011, "created_at": "2010-03-23T17:18:26-07:00", "updated_at": "2010-03-23T17:18:26-07:00", "presenter": null, "affiliation": null, "id": 363, "biography": null, "description": "Recent discussion has focused on the “open core” and “open complement” open source business models.  In the “open core” model (used by, e.g., MySQL), a company open sources core product functions and monetizes complementary aspects, such as services, add-ons, and support.  In the “open complement” model (used by, e.g., Microsoft), a company open sources complementary software and monetizes the core proprietary product.\r\n \r\nThis presentation will compare and contrast these models with a third model called “open infrastructure” (evident in Linux, JBoss, Apache, and Subversion), in which infrastructure is open sourced as a platform for other companies’ commercial products.\r\n"}, "427": {"website": null, "user_id": null, "submitted_at": "2010-03-25T20:05:22-07:00", "title": "Open Source business from the trenches", "event_id": 2011, "created_at": "2010-03-25T20:05:22-07:00", "updated_at": "2010-03-25T20:05:22-07:00", "presenter": null, "affiliation": null, "id": 427, "biography": null, "description": "Opscode (http://www.opscode.com) is a venture backed open source startup.  Over the last several years, we've launched a successful project (Chef,) grown our business from just the core-founders to a thriving team, and built a community with more than a hundred individual contributors and many other corporations.  \r\n\r\nWe'll talk about the different choices you face, how you can learn from existing communities, and share some of the context we've found helpful in preparing others to understand your open source philosophy."}, "426": {"website": null, "user_id": null, "submitted_at": "2010-03-25T20:04:51-07:00", "title": "Open Source and the Open Social Web", "event_id": 2011, "created_at": "2010-03-25T20:04:51-07:00", "updated_at": "2010-05-20T09:39:10-07:00", "presenter": null, "affiliation": null, "id": 426, "biography": null, "description": "Email had Sendmail, and the Web itself had Apache. Open Source software has been instrumental in the development of every revolutionary communications technology on the Internet. In this talk, StatusNet founder Evan Prodromou will discuss the state of the open social web and how projects like StatusNet, Elgg, WordPress, and Drupal are working to make a distributed and open social network across the Internet. He'll discuss security standards like OpenID and OAuth, as well as real-time publishing systems like PubSubHubbub and Salmon, data structures like Activity Streams as well as application suites like OStatus."}, "308": {"website": null, "user_id": null, "submitted_at": "2010-03-02T11:28:20-08:00", "title": "The symfony framework behind the scenes at museum installations", "event_id": 2011, "created_at": "2010-03-02T11:28:20-08:00", "updated_at": "2010-05-15T14:36:05-07:00", "presenter": null, "affiliation": null, "id": 308, "biography": null, "description": "Most museums share these traits:\r\n\r\n# They have \"stuff\".  \r\n# They want to share their \"stuff\" with the public.\r\n\r\nBeyond that, the similarities seem to end.  The \"stuff\" may be physical objects&mdash;anything from quilts to machine guns to postage stamps&mdash;or it may be abstract concepts such as genres of music.  It may be painstakingly organized and catalogued or a jumbled mess.  It may be in spreadsheets, word processor documents, ancient in-house database systems, or expensive third-party museum collection management systems... or only a twinkle in a curator's eye.\r\n\r\nSecond Story builds custom interactive installations for museums and other cultural institutions.  Before we can focus on presenting the content, we have to figure out how to normalize existing content, create and maintain new content, and deliver the content for consumption by whatever presentation technology we plan to use.  Fortunately for us, many tools that are designed to solve these problems on the Web are also very suitable for delivering content to kiosks, interactive tables, or more exotic interactive installations.\r\n\r\nWe have chosen to use the \"symfony framework\":http://www.symfony-project.org/.  Symfony is a full-stack web framework for PHP.  One of its features is a powerful system for creating administrative interfaces based on your database model.  This system is easy enough to create useful admin tools almost immediately using only yaml-based config files, while remaining flexible enough to allow for significant customization when necessary.\r\n\r\nIn this session, I provide a high-level overview of symfony and the symfony admin generator in the context of museum installations.  Throughout the session I'll use real-world examples of kiosks and interactive tables we've created for museums such as the Walt Disney Family Museum, the GRAMMY Museum, and the Gettysburg National Park Museum and Visitor Center.  I'll cover the following topics:\r\n\r\n# The often messy world of museum content, and how symfony helps us unify and normalize disparate content sources\r\n# Creating custom admin tools with the symfony admin generator\r\n# Using symfony to create RESTful web services which can deliver content to your presentation layer in a variety of formats\r\n\r\nThis session will assume some familiarity with object-oriented programming in PHP5, but will be light on code.  The focus will be on what the framework can do for you rather than implementation details."}, "309": {"website": null, "user_id": null, "submitted_at": "2010-03-03T13:26:38-08:00", "title": "Making Drupal Go Fast with Varnish and Pressflow", "event_id": 2011, "created_at": "2010-03-03T13:26:38-08:00", "updated_at": "2010-05-15T14:22:51-07:00", "presenter": null, "affiliation": null, "id": 309, "biography": null, "description": "Are you ready if your web site gets popular or goes viral? A site that was happily handling a few thousand page views a day can very suddenly find itself struggling to handle hundreds of thousands of hits. The combination of Pressflow’s enhancements to Drupal and Varnish’s lightning-fast cache provide a free and open source way to exponentially increase the amount of traffic a Drupal-based web site can serve, allowing you to meet the demand without additional expensive hardware. During the session, we will cover the following topics:\r\n\r\n* What Pressflow is and how it is different from the Drupal content management system\r\n* What Varnish is and what it can do to help\r\n* Why Pressflow+Varnish may be a good option for your web site\r\n* Tips and tools for tuning and optimizing your configuration to make the most out of your precious server resources\r\n* Lessons learned – what not to do\r\n* Real-world examples from live sites running Pressflow and Varnish\r\n\r\nThe open source Drupal content management system powers numerous prominent web sites including:\r\n* President Obama’s White House web site\r\n* Linux Journal\r\n* Zappos\r\n\r\nPressflow and Varnish are being used by some of the largest Drupal sites in the world:\r\n* The Economist Online\r\n* NBC Universal Bravo TV\r\n* The Grammy Awards"}, "449": {"website": null, "user_id": null, "submitted_at": "2010-03-25T22:50:58-07:00", "title": "How to build a simple website in Drupal in an hour -ish", "event_id": 2011, "created_at": "2010-03-25T22:50:58-07:00", "updated_at": "2010-03-25T22:50:58-07:00", "presenter": null, "affiliation": null, "id": 449, "biography": null, "description": "You can do anything with Drupal... which can make it more than a little intimidating. The UI isn't intuitive. It's hard to find how to change things, and harder yet to figure out what to do first, and how to proceed.\r\n\r\nI'll give you an accelerated tour of how to build a simple website quickly -- the Drupal way. \r\n\r\nWe'll start from the beginning -- downloading and installing the software, and step by step, we'll create a website that has various roles and permissions for its admins, editors, contributors, and members. \r\n\r\nWe'll set up blogs and static information. We'll explore menus and various ways to set up navigation. We'll talk about ways to add and process images. And finally, we'll be creating custom content types, and displaying them using Views.\r\n\r\nWe'll assume no prior knowledge of Drupal. We won't go into any detail about theming or installing modules or troubleshooting -- the aim is to get you ready to build a simple website using both static and dynamic data."}, "448": {"website": null, "user_id": null, "submitted_at": "2010-03-25T22:40:29-07:00", "title": "Connecting to Web Services on Android", "event_id": 2011, "created_at": "2010-03-25T22:40:29-07:00", "updated_at": "2010-05-15T14:27:05-07:00", "presenter": null, "affiliation": null, "id": 448, "biography": null, "description": "This presentation will show how to connect to REST-based web services from an Android application.  We'll discuss HTTP programming as well as XML and JSON libraries. This presentation will include a live demo of an Android application."}, "345": {"website": null, "user_id": null, "submitted_at": "2010-03-17T10:42:05-07:00", "title": "SuperSpeed me: USB 3.0 Open Source Support", "event_id": 2011, "created_at": "2010-03-17T10:42:05-07:00", "updated_at": "2010-05-22T15:04:26-07:00", "presenter": null, "affiliation": null, "id": 345, "biography": null, "description": "This talk will provide a general overview of some of the cool new features of USB 3.0 devices, including link and function power management, and bulk endpoint \"streams\" that support SCSI command queuing.\r\n\r\nOperating system developers will be interested in how to support those new features, USB hardware hackers will be interested in how to communicate with USB 3.0 devices, and everyone else gets a sneak peek into what the next generation of USB 3.0 devices will look like."}, "300": {"website": null, "user_id": null, "submitted_at": "2010-02-24T01:04:44-08:00", "title": "From the Ashes of MetroFi", "event_id": 2011, "created_at": "2010-02-24T01:04:44-08:00", "updated_at": "2010-02-24T01:04:44-08:00", "presenter": null, "affiliation": null, "id": 300, "biography": null, "description": "The MetroFi experiment in Portland finally collapsed nearly two years ago.  The City of Portland obtained ownership of the equipment when MetroFi failed to remove it in a timely fashion.  Personal Telco requested the equipment from the City in order to try to extract some residual public benefit and after a lengthy period of indecision and inaction, the City has recently put out a bid solicitation for the removal of the nearly 700 devices mounted around the city on street lights and signal arms.  Personal Telco has been promised approximately 80 of these devices and is hoping to receive the rest as well, though that will depend on the generosity of the winning bidder.\r\n\r\nOut of these ashes, Personal Telco hopes to build new networks that benefit the public.  Since August, we have had possession of a few sample devices and have learned what is inside and partly how they work.  We'll be continuing to explore intact and disaggregated reuse.  At this session, we'll discuss the background of the debacle, what we've learned to date, and what remains to be accomplished."}, "301": {"website": null, "user_id": null, "submitted_at": "2010-02-24T11:02:14-08:00", "title": "Javascript, the One True Language", "event_id": 2011, "created_at": "2010-02-24T11:02:14-08:00", "updated_at": "2010-04-15T10:21:50-07:00", "presenter": null, "affiliation": null, "id": 301, "biography": null, "description": "JavaScript has long been considered a toy language, unworthy of serious developers attention outside the \"ajax\" world.\r\n\r\nNew open source projects like Node.js, Narwhal, CouchDB and more have changed this forever. JavaScript can now be the language you use to write the full stack of any application. And it turns out it will be faster, more productive and cooler than anything you are used to.\r\n\r\nThis presentation will cover the current \"State of the Art\" in the Javascript world and introduce to you how you could use JavaScript to develop your own projects, or simply use engines like V8, Rhino or SpiderMonkey to add powerful scriptability to existing projects."}, "302": {"website": null, "user_id": null, "submitted_at": "2010-02-24T13:02:56-08:00", "title": "WebNumbr - Graph anything on the web", "event_id": 2011, "created_at": "2010-02-24T13:02:56-08:00", "updated_at": "2010-03-24T20:35:20-07:00", "presenter": null, "affiliation": null, "id": 302, "biography": null, "description": "Lots of numbers are already graphed beautifully (stock prices, temperatures, gas prices, etc) but there are still many that aren't. I'm going to show a very simple way to graph any number from any site over time.\r\n\r\nThis talk will simply showcase webnumbr.com, discuss the technical details behind it, and hack together some neat graphs.\r\n\r\nA 5 minute lightning talk was given at Super Happy Dev House about this site: http://www.youtube.com/watch?v=Sw1j0XNhJHk"}, "303": {"website": null, "user_id": null, "submitted_at": "2010-02-24T14:12:54-08:00", "title": "Building a platform from open source at Yahoo!", "event_id": 2011, "created_at": "2010-02-24T14:12:54-08:00", "updated_at": "2010-02-24T14:12:54-08:00", "presenter": null, "affiliation": null, "id": 303, "biography": null, "description": "Join us for a case study on using open source tools to build a platform for enterprise web applications with symfony. The focus of this session will be on how Yahoo! has built web applications that scale with open source tools. Find out what worked and what didn't when building scalable web applications with the symfony framework.\r\n\r\n    * Why symfony?\r\n    * symfony vs ysymfony\r\n    * Social Search: Delicious and Answers\r\n    * YOS: Developer Tool & Application Platform\r\n    * Internal Tools: Customer Care + Dashboards\r\n    * The Platform + Components\r\n    * Yahoo! symfony Plugins\r\n    * Developer Tools - YUI3, YQL, Design Patterns, etc"}, "447": {"website": null, "user_id": null, "submitted_at": "2010-03-25T22:38:45-07:00", "title": "Fiddling with Linux", "event_id": 2011, "created_at": "2010-03-25T22:38:45-07:00", "updated_at": "2010-04-20T18:05:29-07:00", "presenter": null, "affiliation": null, "id": 447, "biography": null, "description": "Linux has a great many tools that a musician would find of great use. There are software tuners, metronomes, webcam tools, audio recorders, music generators, and engraving markup tools.\r\n\r\nI will share the tools I have found while learning to play music again and describe some of the scripts and tools I have built for making a Linux netbook a practice partner."}, "446": {"website": null, "user_id": null, "submitted_at": "2010-03-25T22:36:25-07:00", "title": "Functional Requirements: Thinking Like A Pirate", "event_id": 2011, "created_at": "2010-03-25T22:36:25-07:00", "updated_at": "2010-05-15T14:22:38-07:00", "presenter": null, "affiliation": null, "id": 446, "biography": null, "description": "Writing out what you're doing before you do it is super boring. You want to build stuff! Make stuff happen! Set something on fire!\r\n\r\nAnd somewhere towards where we think the 80 percent mark to 'done' is on really big stuff, things start to pop up that we really did not anticipate. Our roadmap suddenly has these looming monsters that go bump in the night, and we have a spray bottle to fight them with and no time to do it in. This is the point where your project manager lights their hair on fire to get things finished.\r\n\r\nWhat's that? There might be a better way? If we think like a pirate, we might not have to light our hair on fire?\r\n\r\nCreating functional requirements as a part of the planning process is like creating a treasure map. You want to get compensated for the value your cool built-with-open-source-thing is providing to your clients. Your clients want it to work better than what they originally had in mind. If you do the work upfront, you'll know when you've hit the X marks the spot.\r\n\r\nIn this longer session, we'll walk through a trial run of functional requirements documentation. You'll have a list of questions to answer before it's complete, you'll have seen it in action, and we'll talk through all of the bajillion things you'll want to consider before your project should start. We'll also cover the 'open source trickery' of functional requirements. There might be a contributed thing that does the things you need, but in order to be really good at it, you have to forget about it in the beginning.  Pirates don't just wing it.\r\n"}, "445": {"website": null, "user_id": null, "submitted_at": "2010-03-25T22:34:40-07:00", "title": "Using Eduglu, a new Drupal Distro for Higher Education", "event_id": 2011, "created_at": "2010-03-25T22:34:40-07:00", "updated_at": "2010-04-26T12:43:38-07:00", "presenter": null, "affiliation": null, "id": 445, "biography": null, "description": "Drupal's use is exploding in Higher Education. This session will introduce a new Drupal distribution designed to serve as a platform for building rich intranets for educational institutions.\r\n\r\nUniversities are large complex enterprises. Drupal's modularity and flexibility make it the perfect platform for building a new social learning environment which \"glues\" together legacy LMS systems, Student Information Systems, grading systems, and learning happening on 3rd-party tools such as Google Docs, wikis, blogs, micro-blogging platforms such as Twitter, and so on.\r\n\r\nI've been working on Eduglu for the past two years as a student at Brigham Young University and am now releasing it to the world and starting a company to provide commercial support and hosting.\r\n\r\nThis session will serve as an introduction to Eduglu.\r\n\r\nHow we build and maintain Eduglu.\r\nEduglu's current functionality and roadmap for the next year.\r\nWhere your help is needed to make Eduglu thrive.\r\nWhat needs a tool like Eduglu fulfills.\r\nAnd why Eduglu is the perfect base for your next social learning project.\r\n\r\nWe'll walk through the basic steps of installing and setting up an Eduglu website."}, "444": {"website": null, "user_id": null, "submitted_at": "2010-03-25T22:31:26-07:00", "title": "Write a Linux Device Driver: Flipping bits, blinking lights and crashing Kernels", "event_id": 2011, "created_at": "2010-03-25T22:31:26-07:00", "updated_at": "2010-04-20T18:05:33-07:00", "presenter": null, "affiliation": null, "id": 444, "biography": null, "description": "In this tutorial we will go through the basics of Kernel development and get you writing your first Kernel driver module.  After tackling this first hurdle in Kernel development you will be well on your way to investigate and fix your own bugs. :)\r\n\r\nPre-requisites: \r\n* Basic understanding of C\r\n* Linux laptop running the current stable Kernel (see http://kernel.org)\r\n* Cash to cover hardware costs\r\n\r\nThe hardware is yet to be determined but I strive to get something inexpensive, fun and useful."}, "380": {"website": null, "user_id": null, "submitted_at": "2010-03-24T23:52:36-07:00", "title": "Drizzle, Scaling MySQL for the Future", "event_id": 2011, "created_at": "2010-03-24T23:52:36-07:00", "updated_at": "2010-05-15T14:37:20-07:00", "presenter": null, "affiliation": null, "id": 380, "biography": null, "description": "Ever wondered what would happen if you could rethink a decade worth of design changes? Drizzle is a fork of the MySQL server targeted at web development and cloud computing. We are looking at how to create database for modern multi-core, large memory databases that fit inside of an overall application framework"}, "296": {"website": null, "user_id": null, "submitted_at": "2010-02-20T22:39:44-08:00", "title": "Socket handoff: Concurrent fd sharing for performance and innovation", "event_id": 2011, "created_at": "2010-02-20T22:39:44-08:00", "updated_at": "2010-02-20T22:39:44-08:00", "presenter": null, "affiliation": null, "id": 296, "biography": null, "description": "Xlib is over twenty years old, an impressive lifespan for any software project. However, Xlib has not been well-matched to the needs of X clients for some time now. We felt it had earned retirement, so we created a new X-protocol C Binding (XCB) library, providing a simple, small, thread-transparent interface to X. But to support all the applications that haven't magically ported themselves to XCB yet, we needed a transition plan.\r\n\r\nWe first tried re-writing Xlib from scratch as a layer on top of XCB. That was hard. So we stopped.\r\n\r\nThen we added some hooks to XCB to allow Xlib to remain mostly unchanged but send requests through XCB. That worked, mostly; however, the complexity of this approach led to bugs, ugly hacks in XCB, and far more hacking on Xlib than continued sanity permitted. Adding special code in our clean new XCB library just to keep the old Xlib way working made us sad, and the looming prospect of becoming the Xlib maintainers made us lose sleep. So we stopped that too.\r\n\r\nThe current versions of Xlib and XCB now use a technique that we call \"socket handoff\", cooperatively alternating exclusive access to the X connection instead of dumping Xlib's requests through XCB. Socket handoff allowed us to delete a pile of buggy, hackish code, while improving performance, and that made us happy. So we didn't stop.\r\n\r\nThe socket handoff interface has proven to be useful not just for Xlib, but also for new language bindings to XCB and for experimental X protocol-level hacks. We believe other network protocol implementations would also benefit from this approach.\r\n\r\nBy the way, you may be running our socket handoff code on your system right now, so why not come hear about the code used by every application on your desktop?"}, "382": {"website": null, "user_id": null, "submitted_at": "2010-03-25T02:26:23-07:00", "title": "Reprogramming Asian Business with Open Source", "event_id": 2011, "created_at": "2010-03-25T02:26:23-07:00", "updated_at": "2010-03-25T02:26:23-07:00", "presenter": null, "affiliation": null, "id": 382, "biography": null, "description": "Asian manufacturing groups in Taiwan, China, Vietnam and Korea are the engine behind American brands. The older, hierarchical business cultures inside these large manufacturers can be changed through open source, collaborative software and thinking. The motivation for them? Cost savings and stability.\r\n\r\nWe are seeing that the time is right for these companies to rethink their approach to IT. Seeing IT as the agent and catalyst to rebuild the way that the company can operate as a whole. Open Source technologies and attitudes have an opportunity to reshape several key aspects. Open Source thinking brings a do-it-yourself attitude to areas of IT where large proprietary systems have traditionally been used, the follow aspects are discussed in this talk:\r\n\r\nThe cost of business IT systems: Increasing labor costs are forcing Asian companies invest in infrastructure and systems, rather than throwing manpower at problems. However, systems from Oracle, Microsoft and SAP are simply too expensive to purchase and maintain. Linux on the desktop: Asian companies are having a much easier time than Western to jump straight from decrepit Windows desktops to simple, low-cost Linux-based desktops. Particularly as more work moves from traditional office applications to web-based systems. Users are far less cynical and picky than in the west. Utility is the key. Collaboration systems: With safer Linux-based desktops, Asian companies are feeling more free to explore Internet-based collaboration tools as well as a wide array of self hosted tools: Wiki systems for content & knowledge management and collaboration, IM and VoIP. Larger scale cultural and management issues (such as “face”, direct conflict avoidance, and strict hierarchical organizations) are challenged and shifted by this new technological approach. Industrial Control and Monitoring: Transparency and environmental compliance are largely unsolved problems in Asia. Open source sensors and monitoring systems are proving to be cost effective ways of ensuring environmental compliance."}, "383": {"website": null, "user_id": null, "submitted_at": "2010-03-25T02:31:31-07:00", "title": "Hacking Space Exploration", "event_id": 2011, "created_at": "2010-03-25T02:31:31-07:00", "updated_at": "2010-05-15T14:29:38-07:00", "presenter": null, "affiliation": null, "id": 383, "biography": null, "description": "From creating remote-sensing CubeSats to analyzing aerogel: how the public is hacking into open source space exploration.\r\n\r\nAs technology shifts from a means of passive consumption to active creation, people are collaborating on a massive scale. The endeavor of Spacehack.org is to transform that into more of a community, so that space hackers can easily connect and interact.\r\n\r\nAmateurs were once considered to be at the crux of scientific discovery, but over time have been put on the sidelines. Despite this, citizen science is witnessing a renaissance. Agencies such as NASA no longer have a monopoly on the global space program and more participatory projects are coming to life to harness the power of open collaboration around exploring space on a faster schedule.\r\n\r\nInstead of complaining about where our jetpack is, we can now demand to figure out how to take an \"elevator to space\":http://spacehack.org/project/elevator2010 . And, while you still can't own a CubeSat as easily as an iPod, you can join a \"SEDSAT-2\":http://spacehack.org/project/sedsat-2 team and learn how to engineer one.\r\n\r\nThere's also \"GalaxyZoo\":http://spacehack.org/project/galaxy-zoo , which opened up a data set containing a million galaxies imaged by a robotic telescope. Why projects such as these are important is because robots are actually kind of dumb. Humans are able to make classifications that well-programmed machines can't. Currently, 200,000 humans are identifying over 250,000 galaxies.\r\n\r\nIf tinkering with spacecrafts is more your speed, the \"Google Lunar X PRIZE\":http://spacehack.org/project/glxp is a competition to send robots to the moon. However, you don't need to be a robotics engineer to participate. \"Team FREDNET\":http://spacehack.org/project/team-frednet , the first open source competitor, is open for anyone to join.\r\n\r\nWhile the concept of open source has resonated around the world and beyond, there is still much education to be done. \"NASA\":http://opensource.arc.nasa.gov/ and the \"ESA\":http://www.array.ca/nest/tiki-index.php have made large quantities of their data open, but have yet to facilitate developer communities that allow for active contribution to the code rather than just feedback on finding bugs.\r\n\r\n\"Spacehack.org\":http://spacehack.org/ , a directory of ways to participate in space exploration, was created for this reason, among others. Many of these projects are buried in old government websites or do not clearly communicate how someone can get involved. It is with great hope that it will not only encourage the creation of more participatory space projects, but also urge existing ones to embrace the social web.\r\n"}, "384": {"website": null, "user_id": null, "submitted_at": "2010-03-25T05:58:42-07:00", "title": "Teach your class to fish, and they'll have food for a lifetime.", "event_id": 2011, "created_at": "2010-03-25T05:58:42-07:00", "updated_at": "2010-05-15T14:42:43-07:00", "presenter": null, "affiliation": null, "id": 384, "biography": null, "description": "You have so much you want to teach, how do you structure it so that your training course is both interesting and challenging? How much theory can you squeeze into an hour before your attendees have forgotten where you started? How do you structure your course to account for classes which move slower or faster than average?\r\n\r\nWhether you are designing a class to be presented in person, a tutorial to be worked through on-line, a practical book on how to do something, or even if you’re writing extensive user documentation; correct structure makes a huge difference to how memorable the information is.\r\n\r\nBurn-out and full brains are a major problem for anyone attending any intensive learning activity. At university, a student attends many classes all on different topics, but only has to learn one hour of material per class per day. At a conference, an attendee may sit through many hours of interesting talks, but they have the freedom to choose how much they participate in each. In an intensive training course, a student has to learn, understand and fully absorb 6 hours of material on the same topic, every day for several days in a row. Worse, each of these hours builds on the one before; requiring a level of alertness and participation not usually needed at educational institutions, conferences or in the workplace.\r\n\r\nMake your training experience truly stand out by structuring it to help alleviate burn-out. These techniques are essential for a multi-day training course, but will provide you with a solid background for single or even half-day sessions as well.\r\n\r\nThis talk will describe what Perl Training Australia has learned about course structure for technical courses involving lots of hands-on programming exercises. We will cover answers to the questions above, as well discussing other issues such as cognitive load, learning fatigue and ideal classroom set up."}, "306": {"website": null, "user_id": null, "submitted_at": "2010-02-25T09:14:38-08:00", "title": "Node.js and you", "event_id": 2011, "created_at": "2010-02-25T09:14:38-08:00", "updated_at": "2010-05-15T14:21:23-07:00", "presenter": null, "affiliation": null, "id": 306, "biography": null, "description": "Outline\r\n\r\n* The problem with threads.\r\n** Common design problems w/ blocking by default.\r\n* Event-driven design.\r\n** Browser applications.\r\n** Being good at doing nothing.\r\n* Your first node program.\r\n** EventEmitter and the standard callback API.\r\n** Example proxy.\r\n** Simple optimizations.\r\n* Why is it so fast?\r\n** V8\r\n** libev, libio and non-blocking IO"}, "386": {"website": null, "user_id": null, "submitted_at": "2010-03-25T09:23:39-07:00", "title": "Getting Started with FPGAs and HDLs", "event_id": 2011, "created_at": "2010-03-25T09:23:39-07:00", "updated_at": "2010-05-15T14:22:02-07:00", "presenter": null, "affiliation": null, "id": 386, "biography": null, "description": "Lots of attention has been given to GPUs for speeding up certain computations.  Not as much attention has been focused on FPGAs,but they are likely the next frontier for high performance computing.  How does someone with a software development background get started experimenting with FPGAs?  First you need to learn about HDLs (Hardware Description Languages) which are used to design FPGA circuits. \r\n\r\nIn this talk we'll spend some time getting acquainted with VHDL.  Then we'll navigate through issues such as simulation, synthesis and the meaning of \"synthesizable subset\".   We'll touch on FPGA vendor tools as well as open source tools available for simulation.  And we'll take a quick look at open source hardware models that you can incorporate into your own designs. "}, "297": {"website": null, "user_id": null, "submitted_at": "2010-02-22T12:53:57-08:00", "title": "Data Visualization For Fun and Profit", "event_id": 2011, "created_at": "2010-02-22T12:53:57-08:00", "updated_at": "2010-04-27T16:27:24-07:00", "presenter": null, "affiliation": null, "id": 297, "biography": null, "description": "Users interacting with your software and services create a lot of hidden data: web server access logs, click trails, file revisions, incomplete orders and abandoned shopping carts, and the like. Whether you're trying to speed your software up, improve your conversion rates, or just make some nice dataviz art to decorate your office, there are a few simple data analysis techniques that can help you out.\r\n\r\nThis session will show you how to use the Python and R languages to generate informative graphs and predictions from a variety of sources, including SQL databases, server log files, and the filesystem of your own computer."}, "388": {"website": null, "user_id": null, "submitted_at": "2010-03-25T11:39:24-07:00", "title": "import rdma: Zero-copy networking with RDMA and Python", "event_id": 2011, "created_at": "2010-03-25T11:39:24-07:00", "updated_at": "2010-05-15T14:38:00-07:00", "presenter": null, "affiliation": null, "id": 388, "biography": null, "description": "When the computer receives a packet, it is copied into a kernel buffer by the NIC, then copied by the CPU from the kernel buffer to its actual destination in the receiving process's address space. The same data is transferred over the memory bus THREE times, and the CPU must dumbly read and then write every single byte, even before the application sees it.\r\n\r\nRDMA (Remote Direct Memory Access) lets processes on different machines send data directly into each other's process spaces, resulting in greatly increased efficiency. But, using RDMA is very hard, compared to BSD sockets. This talk will introduce my work on making RDMA usable by mere mortals, from Python!"}, "389": {"website": null, "user_id": null, "submitted_at": "2010-03-25T11:42:17-07:00", "title": "Maaaakin' Copies: How to bootstrap your product strategy using Drupal", "event_id": 2011, "created_at": "2010-03-25T11:42:17-07:00", "updated_at": "2010-03-25T11:43:40-07:00", "presenter": null, "affiliation": null, "id": 389, "biography": null, "description": "Ever been under contract to develop a website and thought, \"you know, I've solved this problem before?\" Surely the practice of sharing and reusing lower level components such as libraries, gems, or modules has quickened the pace of rapid application development. But with recent advances in the Drupal ecosystem we're now on the cusp of something much more radical: Gracefully redistributing _entire applications_.\r\n\r\nThis workshop will go into moderate level of technical detail about how to use Drupal to easily redistribute your software projects. It will also share implementation details for executing complimentary SaaS / OpenSource release strategies, and discuss some of the challenges that reside on the business side of this brave new world."}, "443": {"website": null, "user_id": null, "submitted_at": "2010-03-25T22:30:57-07:00", "title": "Programming WebSockets", "event_id": 2011, "created_at": "2010-03-25T22:30:57-07:00", "updated_at": "2010-03-25T22:30:57-07:00", "presenter": null, "affiliation": null, "id": 443, "biography": null, "description": "WebSockets is an exciting new technology that enables bidirectional communication between web applications and server-side processes. Google's Chrome browser already provides WebSockets and developers can expect to see the technology in other browsers in 2010.  This presentation will cover the WebSocket protocol, JavaScript API, and server-side implementations."}, "307": {"website": null, "user_id": null, "submitted_at": "2010-02-25T15:15:13-08:00", "title": "Web Framework Shootout", "event_id": 2011, "created_at": "2010-02-25T15:15:13-08:00", "updated_at": "2010-02-25T15:15:13-08:00", "presenter": null, "affiliation": null, "id": 307, "biography": null, "description": "Which web framework will rule them all? As an audience member you pick the winner! We will present an introduction to a variety of web frameworks including Rails, Django, Symfony, and Sinatra. You can vote for the best web framework in categories such as URL handling, database integration, forms, HTML templating, documentation, testing, and deployment.\r\n"}, "294": {"website": null, "user_id": null, "submitted_at": "2010-02-20T19:16:33-08:00", "title": "Put Down the Superglobals! Secure PHP Development with Inspekt", "event_id": 2011, "created_at": "2010-02-20T19:16:33-08:00", "updated_at": "2010-02-20T19:16:33-08:00", "presenter": null, "affiliation": null, "id": 294, "biography": null, "description": "Inspekt is a comprehensive input filtering and validation library for PHP.  With a focus on simplicity, Inspekt makes writing secure web applications in PHP faster and easier.\r\n\r\nAttendees of this talk will learn:\r\n\r\n* The Inspekt approach to filtering and validating user input, including the \"input cage\" concept\r\n* how to ensuring secure code throughout the development process\r\n* how to integrate Inspekt with existing applications\r\n* how Inspekt integrates with popular frameworks like CodeIgniter\r\n\r\nInitial development of Inspekt was funded by OWASP's Spring of Code 2007.\r\n\r\nMore information: \"http://inspekt.org\":http://inspekt.org"}, "381": {"website": null, "user_id": null, "submitted_at": "2010-03-24T23:56:50-07:00", "title": "Lessons Learned from Open Source Development", "event_id": 2011, "created_at": "2010-03-24T23:56:50-07:00", "updated_at": "2010-03-24T23:56:50-07:00", "presenter": null, "affiliation": null, "id": 381, "biography": null, "description": "Want to make a living working on open source? This talks goes over what I have learned in the last two decades while doing open source development. The talk includes the how-to's and the how-not's to pull it off. "}, "418": {"website": null, "user_id": null, "submitted_at": "2010-03-25T18:12:49-07:00", "title": "Code Happier With The Cycle: Code, Test, Fail, Diff, Fix, Pass, Commit, Repeat", "event_id": 2011, "created_at": "2010-03-25T18:12:49-07:00", "updated_at": "2010-03-25T18:12:49-07:00", "presenter": null, "affiliation": null, "id": 418, "biography": null, "description": "After 15 years of being a developer, teaching software engineering, trying to get people to see the light on testing, I have hit upon the single most important technique you can learn. If you do nothing else to improve your life as a developer, it is to learn this simple cycle:\r\n\r\n1) Write code.\r\n2) Write tests.\r\n3) Fail the tests.\r\n4) Look at the diff and fix it.\r\n5) Pass the tests.\r\n6) Commit.\r\n7) Repeat.\r\n\r\nThis simple, short development cycle (code, test, fail, diff, fix, pass, commit, repeat) will make you code faster, happier and with more confidence.  It takes advantage of the synergy between aggressive, but simple, use of testing and version control.  It can, and should, be learned by any developer of any technology in all circumstances.\r\n\r\nIf you're struggling as a developer.\r\nIf you fear changing code.\r\nIf you've never gotten around to writing tests.\r\nIf you're never sure when to commit code.\r\nIf your code always has bugs.\r\nAttend this session."}, "419": {"website": null, "user_id": null, "submitted_at": "2010-03-25T18:21:07-07:00", "title": "libcloud: a unified interface into the cloud", "event_id": 2011, "created_at": "2010-03-25T18:21:07-07:00", "updated_at": "2010-05-15T14:23:17-07:00", "presenter": null, "affiliation": null, "id": 419, "biography": null, "description": "This talk will discuss libcloud, a unified interface into many popular cloud providers such as Amazon EC2, Slicehost, and Rackspace. libcloud was created to address the problem that each cloud hosting provider provides a proprietary, slightly different, implementation of their API for accessing resources. It's almost as bad as the browser wars! With libcloud, a developer can develop once, then create and manage servers across all of these providers. libcloud is an important step towards true interoperability between server providers. It is currently part of the Apache Software Foundation Incubator.\r\n\r\nOn top of libcloud, this discussion will cover:\r\n* Open APIs - each provider is \"open sourcing\" their API, what does this mean?\r\n* Open Images - without an open image format, can portability truly exist?\r\n* Standard Interfaces - CCIF, OCCI, libcloud, oh my! What tools are available today to build on an open cloud?\r\n* CloudHackers - There is a group of developer focused solely on cloud technology, what are they building?\r\n"}, "290": {"website": null, "user_id": null, "submitted_at": "2010-02-20T02:07:42-08:00", "title": "Serialist: lazy web-crawling in Haskell", "event_id": 2011, "created_at": "2010-02-20T02:07:42-08:00", "updated_at": "2010-05-15T14:35:59-07:00", "presenter": null, "affiliation": null, "id": 290, "biography": null, "description": "We'll present \"Serialist\":http://serialist.net, our site for keeping track of the webcomics and stories that we read.\r\n\r\nWe implemented Serialist entirely in Haskell. Serialist demonstrates functional web-application development, web crawling and scraping, distributed architecture in Haskell, and interesting graph algorithms.\r\n\r\nOther sites exist for tracking webcomics updates, but require manual intervention from a moderator or administrator, often involving writing new page-scraping code for each serial. Our graph algorithms let us accept user submissions for new serials to crawl, making them available immediately. Haskell allowed us to concisely express our graph analyses, and run them over a lazy link-graph of the Internet.\r\n"}, "438": {"website": null, "user_id": null, "submitted_at": "2010-03-25T22:06:15-07:00", "title": "Negotiating an Open Source Future", "event_id": 2011, "created_at": "2010-03-25T22:06:15-07:00", "updated_at": "2010-03-26T10:31:29-07:00", "presenter": null, "affiliation": null, "id": 438, "biography": null, "description": "This interactive workshop, developed by \"Negotiation Strategist Research\":http://www.negotiationstrategist.com, assists individuals and businesses and advocates to close deals and increase persuasiveness. \r\n\r\n**Format**\r\n\r\nThe format consists of a review of the three basic concepts negotiators must master and then a detailed scripted negotiation exercise will be staged.  Concepts are reviewed by a team-based issue-spotting exercise with the plenary.\r\n\r\nNegotiation skills, or a lack thereof, stand between you and what you want. Learn from the master and practice what you learn.  \r\n\r\nEntertaining and dynamic.\r\n\r\n**About the Lecturer**\r\n\r\nMartin Medeiros, a practicing attorney, founded Negotiation Strategist Research to assist negotiators with tools based on statistics and the latest research on human negotiation behavior.  He has interviewed and filmed dozens of business persons, lawyers, police officers, combat veterans, buyers and sellers and uncovered recurring themes of persuasiveness."}, "439": {"website": null, "user_id": null, "submitted_at": "2010-03-25T22:21:42-07:00", "title": "Agile User Experience Design", "event_id": 2011, "created_at": "2010-03-25T22:21:42-07:00", "updated_at": "2010-05-15T14:37:31-07:00", "presenter": null, "affiliation": null, "id": 439, "biography": null, "description": "Luckily for developers, agile practices drive or influence much of the work we do.  This is good.  We get more done, and since our clients are heavily involved in short iterations more of it is right the first time.\r\n\r\nThese short iterations make quality user experience design challenging.  How do you design and test a feature in a single agile iteration?  It can easily take more than one iteration just to recruit for a usability test.\r\n\r\nI've helped implement agile UX design at a consulting shop and a product company, and I'm here to help you.  There's no silver bullet, no out-of-the-box solution, just like there's no One True Way of Agile.  Without tying ourselves to any particular brand or sect of agile, we'll talk about successful strategies and tactics for many environments.\r\n\r\nWe'll define what it means to succeed and then walk through specific processes and techniques that can lead us there.  We'll talk about how to apply increasing levels of detail through the lifetime of a feature, and about communicating with the rest of the project team.\r\n\r\nWith a good team and a good process, it's possible to do really excellent work.  I hope that designers, developers, and managers will find something valuable in what we discuss.\r\n"}, "436": {"website": null, "user_id": null, "submitted_at": "2010-03-25T21:35:46-07:00", "title": "Real Time Data Stream Visualization", "event_id": 2011, "created_at": "2010-03-25T21:35:46-07:00", "updated_at": "2010-03-25T21:35:46-07:00", "presenter": null, "affiliation": null, "id": 436, "biography": null, "description": "A customer calls with a simple question, \"is everyone down, or is it just us?\"  Your stomach turns.  \"Uhhh, I don't know, can I call you right back after I check a few things?!\"  Don't find yourself in this uncomfortable situation.  We have the technology to watch our data in real time in ways that make the health of our systems immediately\r\nobvious.\r\n\r\nCreating a real time display of application or network activity shouldn't be limited to the likes of NASA, movie producers, or giant network operators.  Regardless of your scale or skill, real time displays are within your reach.  They look cool, and they will pay for themselves every time you answer a frantic support call. \r\n\r\nThis session will cover methods for real time data stream visualization including log visualizers, dashboards, and physical devices.  Some discussion of application instrumentation and centralized logging may be covered depending on the experience level of the participants.  Questions and discussion are encouraged.  The possibilities are as wide open as the code.\r\n"}, "437": {"website": null, "user_id": null, "submitted_at": "2010-03-25T21:41:02-07:00", "title": "Legal Difficulties Involving Open Source Companies and How to Avoid Them", "event_id": 2011, "created_at": "2010-03-25T21:41:02-07:00", "updated_at": "2010-05-15T14:35:55-07:00", "presenter": null, "affiliation": null, "id": 437, "biography": null, "description": "A review of recent cases, statutes and a look ahead at avoiding legal problems.\r\nThe Top 10 most contentious legal issues and how to avoid them."}, "434": {"website": null, "user_id": null, "submitted_at": "2010-03-25T21:19:26-07:00", "title": "Why the Plone CMS is a good fit for Higher Education and Research", "event_id": 2011, "created_at": "2010-03-25T21:19:26-07:00", "updated_at": "2010-03-25T21:19:26-07:00", "presenter": null, "affiliation": null, "id": 434, "biography": null, "description": "Plone has been used by hundreds of universities around the world, including Harvard School of Engineering, Penn State University, Rice University and many more. This talk will highlight some of the major success stories where Plone has been adopted, and hopefully encourage a Q&A session at the end.\r\n\r\nPlone can be configured to provide each department or research group it's own subsite within the parent Plone site, each with it's own navigation, search and design. Plone's group collaboration features make it very attractive to research groups that need to share documents within a private area, but share certain content with external researchers. \r\n\r\nThere are add-ons for Plone to generate a faculty and staff directory, and even integrate it with LDAP or Active Directory to pull in all the directory information that already exists on the campus network. There is a plugin to aggregate all of a university department or individual professor's published works, and make all of the metadata searchable and cross-referenceable.\r\n\r\nPlone was adopted by Rice University to build Connexions (cnx.org), open source web portal software for collaboratively developing, freely sharing, and rapidly publishing scholarly content on the Web. Connexions is being used by Teachers Without Borders as their content engine for training and certifying teachers in 84 countries around the world.\r\n\r\nEduCommons (educommons.com) is another open source Plone-based CMS software tool designed specifically to support OpenCourseWare projects, in use by many universities and businesses including Novell. eduCommons will help you develop and manage an open access collection of course materials and it's built around a workflow process that guides content developers through the process of publishing materials in an openly accessible format. \r\n\r\nPlone is one of the largest open-source teams in the world, and is in the top 2% of all project teams on Ohloh, which lists most of the major open source projects in the world. The first lines of source code were added to Plone in 2001. This is a relatively long time for an open source project to stay active, and can be a very good sign. Read more at http://plone.org"}, "299": {"website": null, "user_id": null, "submitted_at": "2010-02-23T21:03:04-08:00", "title": "Thinking Like a Programmer: Building a Programming Curriculum", "event_id": 2011, "created_at": "2010-02-23T21:03:04-08:00", "updated_at": "2010-04-26T12:42:13-07:00", "presenter": null, "affiliation": null, "id": 299, "biography": null, "description": "In the late 1990s, I taught beginning programming to classes of people ranging from 8th grade to adult with community education. The language was Python, and the point was to bring non-programmers to the field and teach them how to \"think like a programmer.\" The goal was to teach basic programming fundamentals, how to read documentation, how to read error messages, etc. Later classes tackled specific topics. After the class, students could continue on there own, secure in the confidence that they could learn on their own. Since I'm planning on teaching again through Hood River County Community Education I would like to talk with people about building a curriculum in Ruby, from beginnings (\"what's a string?\") to web application development. What do you feel is necessary to learn in order to \"think like a programmer?\" What topics would you want beginning programmers to learn? Let's build a list of topic sections together."}, "432": {"website": null, "user_id": null, "submitted_at": "2010-03-25T20:55:50-07:00", "title": "Sphinx - the ultimate tool for documenting your software project", "event_id": 2011, "created_at": "2010-03-25T20:55:50-07:00", "updated_at": "2010-05-15T14:39:06-07:00", "presenter": null, "affiliation": null, "id": 432, "biography": null, "description": "Sphinx makes documenting your project almost too easy.\r\n\r\nYou can even integrate your documentation with your code in that your documentation can be run as a test, and your class and function docstrings can become your reference documentation. \r\n\r\nMarkup as well-designed as reStructuredText is not only a lot of fun to use, but it also very cleanly separates content from design. Authors working in plain text tend to produce clean, readable content without the messy markup often associated with visual HTML editors, or, worse yet, the disaster that is Microsoft Word.\r\n\r\nSphinx is written in Python, but you can use it to document anything. It has a built-in search engine, generates table of contents and indexes, and because the files are just text files, you can check them into your favorite version control system and easily collaborate with and merge changes from other documentation contributors.\r\n\r\nWe will look at several popular open source software projects that are already using Sphinx, and show you how you can get started using Sphinx to document your software project."}, "433": {"website": null, "user_id": null, "submitted_at": "2010-03-25T21:01:56-07:00", "title": "Network booting helps you be lazy", "event_id": 2011, "created_at": "2010-03-25T21:01:56-07:00", "updated_at": "2010-04-26T12:43:33-07:00", "presenter": null, "affiliation": null, "id": 433, "biography": null, "description": "Need to get a server working again that is 1000 miles away?  Network booting can help you.  Need to upgrade the software on a classroom full of computers?  Network booting can help you with that too.  How about you need to startup an 1024 node supercomputer.  Los Alamos National Lab has one that network boots off of a single drive.  What if you need to migrate a whole sever to new hardware?  If you are already using network booting, and virtualization you might be be able to do a live migration so fast that you don't even get a ping timeout.  \r\n\r\nLearn how network booting can help you, and get a feel of how much work it will be as we review the software stack needed to implement it.  \r\n"}, "430": {"website": null, "user_id": null, "submitted_at": "2010-03-25T20:44:12-07:00", "title": "Theme any website in two hours with Deliverance", "event_id": 2011, "created_at": "2010-03-25T20:44:12-07:00", "updated_at": "2010-03-25T20:44:12-07:00", "presenter": null, "affiliation": null, "id": 430, "biography": null, "description": "Deliverance is a middleware service that sits in between your Plone site and your website design. The website design template can be any arbitrary HTML/CSS - there's nothing Plone specific about it.\r\n\r\nDeliverance takes the HTML that your CMS or web application generates and maps it into placeholders into your website design, and you use a simple rules file to tell Deliverance which elements to map over and where they should go.\r\n\r\nThe beauty of this approach is that the design and the code can be developed independently of one another, providing a true separation of presentation and content. And your team can work more effectively together without stomping on each other's toes!\r\n\r\nIn this talk, we will look at several production sites that were themed with Deliverance in a matter of days, a process that would have taken weeks had we used the more traditional theme add-on approach. We'll demonstrate the process step-by-step to show just how easy it is.\r\n\r\nWe'll discuss how to use Deliverance to theme multiple sites (Trac, Wordpress, Plone, etc.) to all have the same design and how to very easily give different sections of your website a different design. And lastly, we'll talk about Banjo, a point-n-click tool for making the rules file, and xdv, an alternative to Deliverance that powers plone.org.\r\n\r\nDesigners, developers and anyone who's looking to end the painful process of theming websites should come to this talk to learn how Deliverance can save you significant amounts of time on your next theming project."}, "431": {"website": null, "user_id": null, "submitted_at": "2010-03-25T20:53:00-07:00", "title": "Regular expressions and meta obsessions", "event_id": 2011, "created_at": "2010-03-25T20:53:00-07:00", "updated_at": "2010-04-26T12:43:27-07:00", "presenter": null, "affiliation": null, "id": 431, "biography": null, "description": "Whether you're a system administrator, a bioinformatics researcher, a linguist or a web dev, sooner or later you'll need to delve into a cryptic mathematical language known as a regular expression.  Whether you know them as finite automata, line noise, or the markings of a meta character obsessed madman, you _will_ confront them.  Knowing how to read, understand and create regular expressions can make all the difference between one and 20 lines of code.  Knowing when not to use them can mean the difference between 1 and 20 hours of debugging.\r\n\r\nIn this talk I'll start with the basics of regular expressions, show off some popular regular expressions and then move on to how to build your own regular expression.  I'll also briefly touch upon when not to use a regular expression.\r\n\r\nThe session will be as interactive as you want it to be, so bring along your favourite problems for dissection and reconstruction."}, "458": {"website": null, "user_id": null, "submitted_at": "2010-03-26T19:33:14-07:00", "title": "Activity Streams, Socialism, and the Future of Open Source", "event_id": 2011, "created_at": "2010-03-26T19:33:14-07:00", "updated_at": "2010-05-15T14:21:36-07:00", "presenter": null, "affiliation": null, "id": 458, "biography": null, "description": "Drawing inspiration from my popular SXSW talk on ActivityStreams, I'm going to take it a step farther and demonstrate how all this \"open, social web\" stuff applies to — nay, shall define! — the future of open source community collaboration mechanisms, and our ability to move faster, quicker, and more intelligently than any of our proprietary counterparts.\r\n\r\nOf course this can't be accomplished alone, so maybe I'll pull in some good ideas from Kant, Nietzsche, Stalin and other inspirational figures... or not... but the point is: the future of open source lies in how well we leverage and exert our influence through social channels.\r\n\r\nAnd since I've been working on opening up and interoperating (yes, that's a verb) the social web, well, I might as well talk about how I see this all relating to the future of open source and how we get sh*t done!"}, "459": {"website": null, "user_id": null, "submitted_at": "2010-03-27T00:35:15-07:00", "title": "cooking clouds", "event_id": 2011, "created_at": "2010-03-27T00:35:15-07:00", "updated_at": "2010-04-26T12:44:04-07:00", "presenter": null, "affiliation": null, "id": 459, "biography": null, "description": "Compute clouds are awesome.  With APIs like EC2, Rackspace and vCloud, you can fire up 1 or 10 nodes in minutes and pay only for what you need when you need it.  Cloud's dirty little secret is that actually installing the software you want on these nodes is more than a little tricky.\r\n\r\nWe'll open the cloud kimono and show you the challenges you're going to hit, if you haven't already.  These include image, size, and location normalization, and the differences in how clouds handle login credentials.\r\n\r\nOnce you're scared to death, we'll show you a few open source tools that take the punches for you, bootstrapping your nodes.  These include libcloud (python), jclouds (java), pallet (clojure), and fog (ruby).  Armed with these tools, you can bootstrap your cloud however you like, whether it's chef, puppet, or even a shell script.\r\n\r\nFinally, we'll talk about cloudhackers, a collective covering all open source cloud projects, what it means and how you can get involved."}, "339": {"website": null, "user_id": null, "submitted_at": "2010-03-16T10:42:08-07:00", "title": "Foundations, Non-profits, and Open Source", "event_id": 2011, "created_at": "2010-03-16T10:42:08-07:00", "updated_at": "2010-05-15T14:37:43-07:00", "presenter": null, "affiliation": null, "id": 339, "biography": null, "description": "\"Carol Smith\":http://fossygirl.blogspot.com is a member of the Board of Directors for the \"Metabrainz Foundation\":http://metabrainz.org/ which oversees the \"Musicbrainz\":http://musicbrainz.org/ project. She will speak about the possible trials and tribulations of starting a foundation in the open source community, whether or not you should consider doing it and even whether or not you should collect licensing fees for your project. \r\n\r\nCarol is also a program manager for the Open Source Programs Office at Google and is spearheading its \"Summer of Code\":http://code.google.com/soc/ effort this year. She'll include some useful tidbits about the program and its mentor organizations."}, "338": {"website": null, "user_id": null, "submitted_at": "2010-03-16T07:00:16-07:00", "title": "Get organized: Emacs a la org-mode", "event_id": 2011, "created_at": "2010-03-16T07:00:16-07:00", "updated_at": "2010-04-20T18:05:39-07:00", "presenter": null, "affiliation": null, "id": 338, "biography": null, "description": "Many time tracking tools can turn into a huge drag on your day with complicated forms, closed data formats or the requirement of net access. But, it doesn't have to be this way! \r\n\r\nWith emacs org-mode you can track your effort, organize your time, goals and todo items with plain text. It is so good that it caused me to install Emacs.\r\n\r\nI will give you a rundown of how you can organize your life with org-mode, get things done and remember the journey."}, "335": {"website": null, "user_id": null, "submitted_at": "2010-03-15T13:49:08-07:00", "title": "Lift tips and tricks", "event_id": 2011, "created_at": "2010-03-15T13:49:08-07:00", "updated_at": "2010-04-16T10:56:11-07:00", "presenter": null, "affiliation": null, "id": 335, "biography": null, "description": "The Lift Web Framework is gaining popularity among enterprise developers and hip kids alike.  FourSquare built their service on Lift.  Xerox has a number of Lift-powered web sites in production.  Novell chose Lift to power their Pulse real-time project.\r\n\r\nPlease join David Pollak, Lift's Benevolent Dictator for Life, in a quick overview of tips and tricks in Lift.\r\n\r\nDavid will show you a bunch of @harryh (lead tech sled dog at FourSquare) Ajax quickies.\r\n\r\nDavid will demonstrate Lift's security features that make it easy to build apps that resist cross site scripting/request forgeries, replay attacks, and may other common security vulnerabilities.\r\n\r\nDavid will show how few lines of code it takes to put real-time (Comet) components on your web page."}, "334": {"website": null, "user_id": null, "submitted_at": "2010-03-15T12:09:56-07:00", "title": "Stacks of Cache", "event_id": 2011, "created_at": "2010-03-15T12:09:56-07:00", "updated_at": "2010-05-15T14:26:07-07:00", "presenter": null, "affiliation": null, "id": 334, "biography": null, "description": "Caching layers have become as pervasive as persistence layers.  As the caching space matures, and application needs change, developers have the choice of either moving to new technologies or adapting their existing technologies to fit new needs.\r\n\r\nThis talk focuses on adapting and augmenting interfaces to memcache in order to overcome some of its limitations and to better utilize available resources.  Then we'll talk about combining those interfaces in a simple, snap-together fashion.\r\n\r\nTo get there we'll be touching on limiting API breadth, the perils of dog-piles and thundering herds, and why composition trumps inheritance.  The examples will be written in Ruby, but should apply just as well to other languages."}, "337": {"website": null, "user_id": null, "submitted_at": "2010-03-15T18:39:04-07:00", "title": "Emperor Mensuraton and the Sword of Statisticales", "event_id": 2011, "created_at": "2010-03-15T18:39:04-07:00", "updated_at": "2010-04-26T12:42:38-07:00", "presenter": null, "affiliation": null, "id": 337, "biography": null, "description": "Have you spent hours or days taking performance measurements and then been drowned in a sea of data?  Have you ever wondered what to put onto a chart to make it pretty, if not useful?  Are you an engineer who slept through statistics class?\r\n\r\nThe Emperor's story (which incidentally exists on a statically defined Pythagorean incline and is filled with silver bullets and placebos) is a lesson for us all when combating streams of data on one hand, production emergencies on the other and managerial deadlines on the undefended forward flank.\r\n"}, "336": {"website": null, "user_id": null, "submitted_at": "2010-03-15T14:11:25-07:00", "title": "Dealing the scaling: Goat Rodeo", "event_id": 2011, "created_at": "2010-03-15T14:11:25-07:00", "updated_at": "2010-04-16T10:56:08-07:00", "presenter": null, "affiliation": null, "id": 336, "biography": null, "description": "Scaling web apps is hard.  Pushing state into the RDBMS moves the scaling issue from one place to another, but when the time comes to whack the RDBMS mole, much pain ensues.\r\n\r\nThe losing the RDBMS pain includes loss of the transaction model, loss of SQL's expressive power, and more.\r\n\r\nGoat Rodeo, a Scala-based, JVM-powered, open source framework combines the best of the Actor model, distributed transactions, and SQL backed by Cassandra to create a different way to build scalable applications.\r\n\r\nJoin David Pollak, Goat Rodeo's founder, to learn more about how to model your applications using the Goat so that your app can scale from the developers desktop to production to planet-scale without change to the app logic.\r\n\r\nDavid will demonstrate a simple Twitter clone and how the application logic does not change from the local machine up to the cloud.  David will put the app in the cloud and demonstrate what happens to it when servers are killed randomly... and how the application logic \"just works.\""}, "454": {"website": null, "user_id": null, "submitted_at": "2010-03-25T23:54:49-07:00", "title": "Usability testing on a shoestring", "event_id": 2011, "created_at": "2010-03-25T23:54:49-07:00", "updated_at": "2010-04-21T08:16:41-07:00", "presenter": null, "affiliation": null, "id": 454, "biography": null, "description": "While it's great that User Interface and User Experience is getting such lip service, many organizations still see usability testing as something that's time consuming and expensive. \r\n\r\nIt doesn't have to be. Usability testing is a great way to get feedback on what works and what doesn't. And there are a number of ways to approach it.\r\n\r\nWe'll look at some low-tech ways of doing quick-n-dirty testing. We'll talk about how your testees can help you improve design interfaces. We'll talk about how user testing data can be used for the greater good, like preventing websites with mystery meat navigation. And we'll demo those low-tech approaches so you can see them in action. \r\n\r\nYou'll walk away with a couple of new techniques -- share them with your colleagues. "}, "455": {"website": null, "user_id": null, "submitted_at": "2010-03-26T11:22:25-07:00", "title": "Service Oriented Architecture (SOA) Open Source Options", "event_id": 2011, "created_at": "2010-03-26T11:22:25-07:00", "updated_at": "2010-03-26T11:58:55-07:00", "presenter": null, "affiliation": null, "id": 455, "biography": null, "description": "SOA is not just for big corporations or B2B.  Do you want to take application design in a new direction for re-usability and flexibility?  Want to avoid monolithic silo apps and create a technology infrastructure that models the company's business processes?  Tools are coming available for this in the open source world.  This talk should set off some light bulbs and hopefully overflow the mind with new possibilities.  \r\n"}, "333": {"website": null, "user_id": null, "submitted_at": "2010-03-15T07:32:22-07:00", "title": "Why Open Source? Reasons Open Source Is Right For Your Customers", "event_id": 2011, "created_at": "2010-03-15T07:32:22-07:00", "updated_at": "2010-03-15T07:32:22-07:00", "presenter": null, "affiliation": null, "id": 333, "biography": null, "description": "Ever have a debate with your customers about why open source is a better solution than some proprietary system? These and other questions are frequent when offering proposals to clients, and must be answered to have a winning bid. Learn the reasons why open source is a smart business idea and how to convince your clients that using open source technologies is a winning strategy. "}, "457": {"website": null, "user_id": null, "submitted_at": "2010-03-26T14:32:49-07:00", "title": "Preparing for the big launch", "event_id": 2011, "created_at": "2010-03-26T14:32:49-07:00", "updated_at": "2010-03-26T14:32:49-07:00", "presenter": null, "affiliation": null, "id": 457, "biography": null, "description": "The big product launch is approaching for your shiny new application and you’re scrambling to fix last minute bugs and work out the kinks. Deep down, you have this suspicious feeling that you’re forgetting something important. Whether it’s your first or your twentieth time that you’ve launched an application, it’s almost guaranteed that there are things that will get overlooked.\r\n\r\nIn this talk, Robby Russell, a partner and the Chief Evangelist at Planet Argon will walk the audience through his team’s Project Launch checklist, which has evolved through several years of designing, developing, and deploying web applications. Robby will share his experiences and outline a collection of best practices such as; keeping your project releasable at all times, managing staging and production environments, bootstrapping your application for SEO and analytics/conversion tracking, preparing for the unexpected, and most importantly… making sure your clients are ready for the bumpy ride.\r\n\r\nRobby’s goal is to share from the hard lessons that his team has experienced over the years and provide you with some ideas to walk away with you. As you’ll learn, it’s never too early to start preparing an application for the big launch."}, "344": {"website": null, "user_id": null, "submitted_at": "2010-03-17T05:11:30-07:00", "title": "Security vs Usability vs Privacy ", "event_id": 2011, "created_at": "2010-03-17T05:11:30-07:00", "updated_at": "2010-04-26T12:13:03-07:00", "presenter": null, "affiliation": null, "id": 344, "biography": null, "description": "Can open source prevent all this from happening? How can Open source\r\nand Free Software can help prevent this.\r\nSecurity&Freedom do not need to be sacrificed for Usability. Media Security does\r\nnot come with he price of loosing all freedom. \r\n\r\nThe internet is a  network of networks and should be treated as such. \r\nMost of today's software security flaws are produced because of not knowing,\r\nWill we able to increase code security, prevent all the mistakes, and save the\r\nfreedom of the net?"}, "385": {"website": null, "user_id": null, "submitted_at": "2010-03-25T06:03:04-07:00", "title": "Running an open source training business", "event_id": 2011, "created_at": "2010-03-25T06:03:04-07:00", "updated_at": "2010-04-26T12:47:43-07:00", "presenter": null, "affiliation": null, "id": 385, "biography": null, "description": "Starting a business is easy. Starting a successful business is only a little bit harder. But how do you keep an open source training business going and making money when the shine has worn off and it's now just hard work?\r\n\r\nThis talk will discuss what it takes to run a successful, small, totally independent, open source training business. It will cover considerations like outsourcing extra tasks (and then taking them back again when it didn't work), holidays, managing staff who prefer to be constantly partying, and advertising to a wide variety of open source user groups without making enemies.\r\n\r\nThere are also the joys (and pains) of creating training materials, scheduling courses, running training and balancing the books. Tips will be given on how to make training fun, so that your attendees consistently give you high overall ratings; and how to teach the same week-long course twice a month for 6 months running and not get bored.\r\n\r\nFinally you'll see how community involvement is essential for micro-businesses like this to survive."}, "288": {"website": null, "user_id": null, "submitted_at": "2010-02-19T18:02:36-08:00", "title": "Flex from zero to hero", "event_id": 2011, "created_at": "2010-02-19T18:02:36-08:00", "updated_at": "2010-02-19T18:02:36-08:00", "presenter": null, "affiliation": null, "id": 288, "biography": null, "description": "Adobe Flex is a powerful (and open-source) system for building cross-platform applications that is all too often underestimated.\r\n\r\nIf you are convinced that Flex is good just for building MP3 players and cutesy Flash-based web pages, this talk will (hopefully) convince you otherwise by teaching how Flex and AIR can be used to build _useful_ applications quickly and efficiently.\r\n\r\nDuring the presentation, Marco will live-code an application starting from scratch with your help—and end up with a complete program that, we assure you, will do anything _but_ play MP3 files (unless you want it to, that is)."}, "405": {"website": null, "user_id": null, "submitted_at": "2010-03-25T15:17:17-07:00", "title": "Transparent, Collaborative, Participatory - Grass Roots Implementation of the Open Government Directive", "event_id": 2011, "created_at": "2010-03-25T15:17:17-07:00", "updated_at": "2010-05-15T14:24:14-07:00", "presenter": null, "affiliation": null, "id": 405, "biography": null, "description": "Projects and tools are being created worldwide with the aim of creating more collaborative decision-making processes.  ParticipateDB (http://participatedb.com) currently lists 131 tools and 157 projects dedicated to this purpose.  This panel will explore the broad themes of this movement, featuring representatives from several of these efforts."}, "404": {"website": null, "user_id": null, "submitted_at": "2010-03-25T14:49:06-07:00", "title": "Building Interactive Displays with Touchscreen 2.0", "event_id": 2011, "created_at": "2010-03-25T14:49:06-07:00", "updated_at": "2010-05-15T14:31:06-07:00", "presenter": null, "affiliation": null, "id": 404, "biography": null, "description": "Touchscreen is a platform for creating interactive kiosk and dashboard displays.  Its built with well known technologies making it easy to create custom content for your own display.\r\n\r\nTouchscreen 2.0 powers presentations about the Open Source Lab's data center and the network operations center.  It provides our admins and our visitors with graphical representations of real-time data about our network operations.\r\n\r\nCome Learn about:\r\n  * What touchscreen is, and what it can do for you.\r\n  * How version 2.0 was built (and our successes and failures along the way)\r\n  * How to implement content plugins for touchscreen including:\r\n      ** Using Raphael and SVG for graphics and animation\r\n      ** How to quickly mash up content sources with jquery\r\n"}, "403": {"website": null, "user_id": null, "submitted_at": "2010-03-25T14:39:05-07:00", "title": "Developing an Open Source UMPC for Higher Education", "event_id": 2011, "created_at": "2010-03-25T14:39:05-07:00", "updated_at": "2010-04-26T12:43:14-07:00", "presenter": null, "affiliation": null, "id": 403, "biography": null, "description": "The \"OSWALD\":http://beaversource.oregonstate.edu/projects/cspfl/wiki was designed to inspire students to experiment and explore every aspect of computing on both the software and hardware levels. With fully open hardware schematics, anyone is free to modify the hardware to their liking or even completely reproduce the device. This openness allows for levels of hardware hacking usually not allowed on similar, commercialized devices.\r\n\r\nIn addition, the software platform developed for the device focuses on flexibility, allowing both students and faculty to design curriculum around the device, develop new applications, or just learn the ropes of developing and deploying software in an embedded Linux environment. Students are encouraged to merge their own work back into the project thereby prolonging the usefulness of class projects or other experiments focused on the device.\r\n\r\nOverall, this talk will discuss the architectural design of the OSWALD and the challenges involved in developing and maintaining an embedded Linux platform for the device."}, "402": {"website": null, "user_id": null, "submitted_at": "2010-03-25T14:08:21-07:00", "title": "Efficient Multi-core Application Architectures", "event_id": 2011, "created_at": "2010-03-25T14:08:21-07:00", "updated_at": "2010-05-15T14:48:48-07:00", "presenter": null, "affiliation": null, "id": 402, "biography": null, "description": "This session takes a look at how to scale applications running on multi-core CPUs. It focuses on various application models such as one process per connection, one thread per connection, single threaded with non-blocking I/O, and hybrid approaches. I/O will also be covered, looking at the various blocking and non-blocking models, and polling methods for various open source operating systems. Details on how to handle the c10k problem (and beyond) are presented, along with how to best manage typical work loads that require other resources like disk I/O. Synchronization methods such as mutexes and atomic operations will also be briefly touched on to see what impact they have with resource protection.\r\n\r\nExamples will be shown in C++, and the framework introduced can be used to develop your own applications. The concepts are also applicable to any programming language that supports proper threading."}, "310": {"website": null, "user_id": null, "submitted_at": "2010-03-03T15:20:21-08:00", "title": "Grails for Switchers", "event_id": 2011, "created_at": "2010-03-03T15:20:21-08:00", "updated_at": "2010-04-26T12:42:21-07:00", "presenter": null, "affiliation": null, "id": 310, "biography": null, "description": "If you've been interested in trying Grails but haven't had the chance yet, this hands-on session is for you.\r\n\r\nIn this session you'll learn how to build a Grails application from the ground up, and we'll also explore the world of custom tags and the vast ecosystem of plugins that are available for Grails.\r\n\r\nEven if you currently use another language or framework, there are a huge number of very compelling reasons to give Groovy and Grails a shot. Come see what all the buzz is about!"}, "469": {"website": null, "user_id": null, "submitted_at": "2010-03-29T15:19:04-07:00", "title": "The $2 computer: ultraconstrained devices do your bidding", "event_id": 2011, "created_at": "2010-03-29T15:19:04-07:00", "updated_at": "2010-05-15T14:46:47-07:00", "presenter": null, "affiliation": null, "id": 469, "biography": null, "description": "While our family had H1N1, I prototyped a device for adjusting our television's volume during the furnace's on cycle.  Microcontrollers are ridiculously cheap, beginning electronics tools are affordable, and open source tools, such as the Arduino IDE and the underlying avr-gcc toolchain, combine to make it remarkably simple to create custom gadgets to improve your life.\r\n\r\nIn a single session, I'll demonstrate how to plan your gadget, gather everything you need, then build and program a prototype device using open source tools.  A complete description of all steps will be provided so that attendees may duplicate the device on their own."}, "468": {"website": null, "user_id": null, "submitted_at": "2010-03-29T15:14:43-07:00", "title": "Hacking the world: effecting positive changes using open source", "event_id": 2011, "created_at": "2010-03-29T15:14:43-07:00", "updated_at": "2010-05-03T17:40:22-07:00", "presenter": null, "affiliation": null, "id": 468, "biography": null, "description": "Open source volunteerism is usually viewed through the lens of software development, but ultimately the purpose of any software is to do something.  Moving beyond lost cat posters and reducing small business costs, open source tools allow capable but poorly funded volunteers to accomplish tasks that would otherwise be unthinkable.\r\n\r\nDrawing from his experience with non-profits and governmental organizations, developer David Hollingsworth presents the other side of open source volunteerism: accomplishing real-world tasks using off-the-shelf and customized open source software as means rather than ends.\r\n\r\nThe needs, resources, barriers, solutions, and outcomes of case studies from four distinctive organizations are used to form a general approach that geeks can use and promote as volunteers."}, "465": {"website": null, "user_id": null, "submitted_at": "2010-03-29T08:42:24-07:00", "title": "Using virtualization and automation to improve your web development workflow", "event_id": 2011, "created_at": "2010-03-29T08:42:24-07:00", "updated_at": "2010-03-29T08:42:24-07:00", "presenter": null, "affiliation": null, "id": 465, "biography": null, "description": "Most web developers are probably familiar with the concepts and motivations behind staged deployment.  But the prospect of setting up such a system can raise daunting questions, especially for smaller shops that may work on many projects for many clients.  How much extra hardware will be needed?  How much will the required software cost?  How much development time will it take?\r\n\r\nIn this session, I show how the combination of Linux, VMware Server, and AutomateIt can make a staged deployment environment easy and inexpensive to set up.  This is a high level session meant to introduce concepts and tools; it will be light on code examples or live demonstration of software.\r\n\r\nI review a handful of web development infrastructure approaches.  For each configuration, I discuss the benefits and costs.  Next, I introduce VMware Server and AutomateIt, and show how the introduction of virtualization and automated configuration can drastically reduce these costs.\r\n"}, "464": {"website": null, "user_id": null, "submitted_at": "2010-03-29T08:25:00-07:00", "title": "Developing Replication Plugins for Drizzle", "event_id": 2011, "created_at": "2010-03-29T08:25:00-07:00", "updated_at": "2010-05-25T01:08:09-07:00", "presenter": null, "affiliation": null, "id": 464, "biography": null, "description": "The Drizzle Project is a fork of the MySQL 6.0 server, aimed at serving large cloud computing environments. One of the many goals of Drizzle is to enable a large plugin ecosystem by improving, simplifying, and modernizing the application programming interfaces between the kernel and the modules providing services for Drizzle.\r\n\r\nDrizzle’s replication system is entirely new and different from MySQL. It uses Google Protobuffer messaging in its application programming interface to communicate changes to the state of one server to another server. Plugins are easy to implement which enable a developer to entirely customize their replication system. This tutorial describes the APIs used in Drizzle’s replication system in depth and walks through the construction of several example plugins demonstrating the flexibility and power of the replication API.\r\n\r\nTopics covered include:\r\n\r\n    * Overview of Google Protobuffers message API\r\n    * Overview of the flow of messages through Drizzle’s replication system\r\n    * Understanding the Transaction and Statement messages\r\n    * Understanding the TransactionReplicator and TransactionApplier APIs\r\n    * Overview of Drizzle’s Transaction Log module, which demonstrates an example TransactionApplier plugin\r\n    * Walkthrough of the FilteredReplicator plugin\r\n    * Walkthrough of the MemcachedApplier plugin"}, "467": {"website": null, "user_id": null, "submitted_at": "2010-03-29T11:36:20-07:00", "title": "X.Org And You: Answers to Common Questions", "event_id": 2011, "created_at": "2010-03-29T11:36:20-07:00", "updated_at": "2010-04-26T12:44:11-07:00", "presenter": null, "affiliation": null, "id": 467, "biography": null, "description": "The X11 Windowing System, commonly called X, has been a staple of the open-source desktop ever since its inception in the late 1980s. It has been the dominant display server and windowing system for most Unices, including Linux, and stands today as one of the core pieces of plumbing in the Linux ecosystem. However, most people are still puzzled over why it is still around, and why it is so essential.\r\n\r\nWe will discuss why X is important right now, why competitors to X have largely failed, where X development is headed, and how the community can stay involved.\r\n\r\nWe will also discuss the other components of the free desktop, the roles of the X.Org Foundation and freedesktop.org, and the general state of desktop environments as they pertain to the plumbing of Linux.\r\n\r\nThere will be time for questions and answers. This will not be a deeply technical talk, although technical questions are welcome."}, "466": {"website": null, "user_id": null, "submitted_at": "2010-03-29T11:24:35-07:00", "title": "Data Normalization, Denormalization, and the Forces of Darkness", "event_id": 2011, "created_at": "2010-03-29T11:24:35-07:00", "updated_at": "2010-04-26T12:14:16-07:00", "presenter": null, "affiliation": null, "id": 466, "biography": null, "description": "“Normalization” just means making something more normal, which usually means bringing it closer to conformity with a given standard.\r\n\r\nDatabase normalization doesn’t mean that you have have weird data, although you might. It’s the name for an approach for reducing redundant data in databases. If the same data is stored in more than one place, keeping it synchronized is a pain. Furthermore, if you can’t trust your synchronization process absolutely, you can’t trust the data you retrieve.\r\n\r\nYou may have heard that normalization is the enemy of search efficiency. This is kind of truish, but not really true. At the lower levels, imposing a bit of order on your chaotic heap of data will probably improve efficiency. At the higher levels you may see a performance slowdown, but it probably won’t be as bad as you fear and there are ways to address any problems you do find."}, "461": {"website": null, "user_id": null, "submitted_at": "2010-03-27T23:11:50-07:00", "title": "Non-visual location-based augmented reality using GPS data", "event_id": 2011, "created_at": "2010-03-27T23:11:50-07:00", "updated_at": "2010-05-15T14:35:36-07:00", "presenter": null, "affiliation": null, "id": 461, "biography": null, "description": "Text messages have virtually eliminated the need for voicemail, and are a faster way to convey a message than a phone call. In the same way, GPS-based augmented reality could eliminate the need for text messages.\r\n\r\nThis presentation will highlight the advantages and disadvantages of visual and non-visual augmented reality. We'll cover alternate types of augmented reality techniques and how they have been saving us time in the past few months. We'll demonstrate how we've been merging available technologies with custom programming to create location-aware social networks with custom proximity notification. Finally, we'll describe other uses for location sharing, such as automatically turning off house lights when leaving for work, and wayfinding with piezoelectric buzzers. Privacy and data transparency will also be discussed.\r\n\r\nAaron will also present data visualizations, animations, and a glimpse of the raw data of his two years of to-the-second GPS logs which provide the basis of the location-based augmented reality system. You can see a preview of some of the images here: http://aaronparecki.com/GPS_Visualization\r\n"}, "460": {"website": null, "user_id": null, "submitted_at": "2010-03-27T15:07:16-07:00", "title": "Best Practices for Wiki Adoption ", "event_id": 2011, "created_at": "2010-03-27T15:07:16-07:00", "updated_at": "2010-05-15T14:29:03-07:00", "presenter": null, "affiliation": null, "id": 460, "biography": null, "description": "Two wiki enthusiasts —Mark and Steven —will share the best practices they've gleaned from 13 combined years using and teaching others about wiki and collaboration. "}, "463": {"website": null, "user_id": null, "submitted_at": "2010-03-28T22:03:46-07:00", "title": "How to Teach Kids to Program Computers", "event_id": 2011, "created_at": "2010-03-28T22:03:46-07:00", "updated_at": "2010-04-26T12:44:07-07:00", "presenter": null, "affiliation": null, "id": 463, "biography": null, "description": "I've developed a 6 week, after-school course for teaching children how to program computers, and I'd like to share these lessons so that others can do the same. These classes are focused at elementary school, and can be as light or as complicated as the needs of the students; however, the fundamentals are the same.\r\n\r\nMy lesson plans includes the initial projects and presentations and covers the concepts for each of the following lessons. I also discuss tips on focusing the student's attention as well as discipline problems.\r\n\r\n# *Getting Started* introduces the students to the Scratch Learning Environment as they build an online puppet show.\r\n# *Animation and Graphics* begins with the concept of a pixel and describes how to make good animation as they take an elephant out for a walk.\r\n# *Event Processing* describes message passing and receiving as they build a couple of projects including a Mr. Potato Head game.\r\n# *Making Music* teaches the students how to record and playback their voice as well as play simple tunes. This lesson builds upon previous lessons in order to orchestrate a choir of snails.\r\n# *Variables and Lists* teaches the students how use variables and lists to make a fun testing program.\r\n# *Game Design* puts all the lessons together to show the students how to build different types of games including a racing and an adventure game. \r\n\r\n"}, "462": {"website": null, "user_id": null, "submitted_at": "2010-03-28T21:18:08-07:00", "title": "OAuth: an Open Specification for Web Services", "event_id": 2011, "created_at": "2010-03-28T21:18:08-07:00", "updated_at": "2010-05-15T14:29:37-07:00", "presenter": null, "affiliation": null, "id": 462, "biography": null, "description": "As the world of Web Services API grows and the demand to share user data across multiple providers rises, so does the need for user security and standardization for developers. In 2006, grass root contributors and a community banded together to build a specification to address a fundamental problem: “how do we share user information without compromising the user?”. A year later, the OAuth specification was formalized to answer this fundamental question for Web Services API’s. Today, OAuth is the API delegation standard of choice for major service providers such as Google, Twitter, Netflix, and Yahoo!.\r\n\r\nOAuth is great for users but it’s also a great opportunity for developers! Because OAuth is an open and well supported standard, developers can learn once and then leverage that common knowledge across multiple facets. This talk will delve into the history of OAuth, the details of the specification, and example consumer PHP5 implementations. Netflix and Twitter will be the focus of the consumer implementation. The session will also touch upon the new OAuthProvider implementation for PHP5 as well as the upcoming OAuth 2.0 specification."}, "387": {"website": null, "user_id": null, "submitted_at": "2010-03-25T11:04:20-07:00", "title": "Why the Sysadmin Hates Your Software", "event_id": 2011, "created_at": "2010-03-25T11:04:20-07:00", "updated_at": "2010-05-15T14:27:58-07:00", "presenter": null, "affiliation": null, "id": 387, "biography": null, "description": "Managing software is one of the many responsibilities of the system administrator, and not just \"server\" software like web applications or network servers, but often end-user application software as well.  Software packages sometimes make their installation and management a lot harder by thwarting the techniques sysadmins use for large-scale software management.  Besides describing ways that software can be hard to manage, I'll discuss the techniques that sysadmins use to do large-scale software management and make constructive recommendations for how to improve software manageability.\r\n"}, "401": {"website": null, "user_id": null, "submitted_at": "2010-03-25T14:01:39-07:00", "title": "Housetruck: Building a Victorian RV", "event_id": 2011, "created_at": "2010-03-25T14:01:39-07:00", "updated_at": "2010-05-15T14:28:35-07:00", "presenter": null, "affiliation": null, "id": 401, "biography": null, "description": "As a \"software person,\" I found the hard technologies of building with steel and wood made for a very different creative and hacking process. At the same time, I discovered many parallels to software development, embedded hardware, and even open-source philosophies.\r\n\r\nI'll talk about my methodology of finding inspiration, determining values, establishing functions, researching materials and methods, finding domain experts, building the structure, and solving problems. I'll also present some ideas to \"sensorize\" and network the vehicle, while keeping true to the overall design philosophies.\r\n\r\nInspired by gypsy caravans, British \"showman's wagons,\" 1960s housetrucks & buses, Japanese architecture, and rustic shacks, the 8'x14' cabin is handmade of steel, wood, and wool, and is mounted on an Isuzu NPR truck.\r\n\r\nWith luck, the housetruck will be present onsite for touring and as a host of possibly the tiniest hacker lounge ever."}, "360": {"website": null, "user_id": null, "submitted_at": "2010-03-23T10:51:40-07:00", "title": "Introduction to MongoDB", "event_id": 2011, "created_at": "2010-03-23T10:51:40-07:00", "updated_at": "2010-05-15T14:24:33-07:00", "presenter": null, "affiliation": null, "id": 360, "biography": null, "description": "MongoDB is an open-source, high-performance, schema-free, document-oriented database. The goal of the MongoDB project is to bridge the functionality gap between a key/value store and a traditional RDBMS. This talk will introduce MongoDB and discuss some of the reasons why MongoDB might be the right fit for your project.\r\n\r\nWe'll introduce MongoDB by explaining how it compares to traditional relational databases as well as some other non-relational systems. This will focus on the gains in scalability and flexiblity that make MongoDB an attractive option, as well as some examples of when MongoDB might not be the best fit. Following this introduction we will discuss some specific use cases for MongoDB. This will include examples of interacting with MongoDB from several different languages. We will review some of the advanced features of MongoDB and discuss how they can be put to good use.\r\n\r\nQuestions and discussion will be encouraged throughout the presentation. We'll be able to dive deeper into any specific topics of interest to the audience."}, "368": {"website": null, "user_id": null, "submitted_at": "2010-03-24T16:21:48-07:00", "title": "Creating a low-cost clustered virtualization environment using Ganeti", "event_id": 2011, "created_at": "2010-03-24T16:21:48-07:00", "updated_at": "2010-05-15T14:45:51-07:00", "presenter": null, "affiliation": null, "id": 368, "biography": null, "description": "Whether you need a small yet scalable development virtual machine (VM) environment or need to deploy a large cloud production environment, you need a tool that is easy to use, deploy, and maintain. \"Ganeti\":http://code.google.com/p/ganeti/ is a clustered virtual server management software tool built on top of existing virtualization technologies such as \"Xen\":http://xen.org/ or \"KVM\":http://www.linux-kvm.org/page/Main_Page. It is similar to \"libvirt\":http://www.drbd.org/ in many aspects, but different in others such as its built-in cluster support using \"DRBD\":http://www.drbd.org/.\r\n\r\nThe focus will be on a use case at the \"Oregon State University Open Source Lab\":http://osuosl.org/ (OSUOSL) where we were faced with scaling, performance, and reliability issues with our existing VM infrastructure. We’ll cover the overall design and features of Ganeti along with the basics of installing it. Additionally we’ll walk through some of the basic operations you may encounter (deployment, failover, expansion, hardware failures, etc).\r\n"}, "287": {"website": null, "user_id": null, "submitted_at": "2010-02-19T17:50:37-08:00", "title": "The curious case of php|architect", "event_id": 2011, "created_at": "2010-02-19T17:50:37-08:00", "updated_at": "2010-02-19T17:50:37-08:00", "presenter": null, "affiliation": null, "id": 287, "biography": null, "description": "In the last eight years, \"php|architect\": http://phparch.com/ has gone from a newsletter born out of a dare to becoming the leading PHP publications in the world and has expanded into providing its own line of books, live remote training and conferences. \r\n\r\nDespite its increased popularity, php|a is still run by a small crew of passionate people who handle everything from content management to customer support using a set of tools based almost entirely on open source software, including Linux, MySQL and PHP that plays nicely with commercial software to provide a powerful business platform.\r\n\r\nIn this presentation, co-founder Marco Tabini shows you the technology behind php|architect and discusses how open-source and commercial software of all kinds can be meshed together to form a cohesive strategy for businesses of all sizes."}, "343": {"website": null, "user_id": null, "submitted_at": "2010-03-16T20:16:16-07:00", "title": "Open Source Storage Solutions and Next Generation Linux File Systems ", "event_id": 2011, "created_at": "2010-03-16T20:16:16-07:00", "updated_at": "2010-05-15T14:27:53-07:00", "presenter": null, "affiliation": null, "id": 343, "biography": null, "description": "Unlike most areas of enterprise IT, open source solutions in the storage industry have remained in the background. In 2010 this situation is going to change dramatically with new open source storage solutions, nex-generation Linux file systems, and emerging cloud offerings making significant inroads. This session will outline the areas where open source storage solutions are well-suited to the enterprise and best practices for implementation. It will explore how open source will play a key role in the adoption of storage virtualization and cloud storage. Also discussed will be the pros and cons of new technologies (highlighting the areas that will have the most impact), and best practices learned from a real-life deployment of a scalable NAS deployment in the healthcare industry. \r\n"}, "471": {"website": null, "user_id": null, "submitted_at": "2010-03-29T15:48:36-07:00", "title": "Blocker Talk: confessional-meets-Scrum", "event_id": 2011, "created_at": "2010-03-29T15:48:36-07:00", "updated_at": "2010-03-29T15:48:36-07:00", "presenter": null, "affiliation": null, "id": 471, "biography": null, "description": "You will emerge from Open Source Bridge with more can-do spirit and how-to knowledge.  But what problem will you attack first?  Are you forgetting dependencies, confusing the important with the urgent, or \"avoiding working on a critical problem\":https://openhatch.org/blog/2010/what-are-you-avoiding-working-on/?\r\n\r\nCome to Blocker Talk to discover your priorities and impediments.  Seasoned project manager Sumana Harihareswara will lead each project leader or representative through:\r\n\r\n* a quick, structured status assessment\r\n* a <a href=\"http://en.wikipedia.org/wiki/5_Whys\">Five Whys</a> session to find the root causes of your project's obstacles\r\n* open group discussion to share tips and resources for fixing those causes\r\n\r\nYou might discover that one easy-to-fix issue is holding you back.  Or that a known bug is more important than you'd thought, and you need to change your roadmap.  Or that there's \"a FLOSS toy\":http://www.crummy.com/software/BayesMotel/ that makes your worldchanging idea trivial to implement.\r\n\r\nDon't leave it to chance; come to Blocker Talk and you'll leave with your obstacles named, your priorities clear, and your tools in hand.\r\n\r\nSession limited to six projects."}, "400": {"website": null, "user_id": null, "submitted_at": "2010-03-25T13:45:49-07:00", "title": "eBooks, ePub, iPad, Kindle, o-my", "event_id": 2011, "created_at": "2010-03-25T13:45:49-07:00", "updated_at": "2010-05-15T14:37:49-07:00", "presenter": null, "affiliation": null, "id": 400, "biography": null, "description": "The long-awaited move to paid digital distribution of books, magazines, and other text-centric content is finally underway. It's not all smooth, however: below the gadget-lust-inducing surface of devices like the Kindle, iPad, and various other devices lurks a messy, incompatible bunch of standards competing for dominance.\r\n\r\nCome learn about the various formats and distribution models for books, magazines, and comics in the Internet age."}, "361": {"website": null, "user_id": null, "submitted_at": "2010-03-23T12:41:03-07:00", "title": "Release your hardware hacker potential with gEDA", "event_id": 2011, "created_at": "2010-03-23T12:41:03-07:00", "updated_at": "2010-05-15T14:20:13-07:00", "presenter": null, "affiliation": null, "id": 361, "biography": null, "description": "This session will take you step-by-step through the process of creating an actual printed circuit board using the gEDA suite of electronic design automation tools. From schematic to gerber files, you can do all with the open source tools in gEDA. \r\n\r\nThe gEDA project is a full GPL'd suite of electronic design automation tools. The suite includes tools for schematic capture, attribute management, bill of materials (BOM) generation, netlist creation, analog and digital simulation, and printed circuit board (PCB) layout.\r\n\r\nThis session will cover:\r\n- Drawing a block diagram\r\n- Creating parts and drawing a schematic\r\n- Netlist creation and import into the printed circuit board tool\r\n- Layout of the printed circuit board \r\n- Outputting gerber files \r\n- Design verification\r\n- How to have your printed circuit board built\r\n\r\nThis session will be presented for the beginner and will assume no previous hardware experience.\r\n\r\ngEDA website: \"http://www.gpleda.org/\":http://www.gpleda.org/\r\n"}, "472": {"website": null, "user_id": null, "submitted_at": "2010-03-29T16:17:58-07:00", "title": "The new schism:  SQL vs. NoSQL", "event_id": 2011, "created_at": "2010-03-29T16:17:58-07:00", "updated_at": "2010-04-20T21:50:28-07:00", "presenter": null, "affiliation": null, "id": 472, "biography": null, "description": "We'll look at some of the complaints people have about commonly available RDBMS systems, how they're addressed, and why some people choose to migrate to other kinds of systems.  We'll examine the best points from both sides of the squabble, look at some real-world deployments both large and small, and think about how to make our own best decisions.  \r\n\r\nWe'll also put forth a new motto: not NoSQL, but N-O-SQL--Not Only SQL."}, "473": {"website": null, "user_id": null, "submitted_at": "2010-03-29T19:03:09-07:00", "title": "Living Together In An Open Cloud World ", "event_id": 2011, "created_at": "2010-03-29T19:03:09-07:00", "updated_at": "2010-05-15T14:29:10-07:00", "presenter": null, "affiliation": null, "id": 473, "biography": null, "description": "With millions of users signing on daily to access their favorite social media services – be it Twitter, Facebook or Digg – a developer’s worst fear is not having the backend support to house and access to such huge amounts of related data. \r\n \r\nIndustry efforts to architect next-generation databases that can scale massively by pairing open source databases and content management technologies with cloud-computing are underway.  The door is also opening to a whole new world of user benefits which will be made possible by access to data -- cross-cloud -- in non-proprietary databases and content management systems.\r\n \r\nThe Apache Cassandra Project and Drizzle are open alternatives to traditional databases that offer new opportunities by using cloud computing to improve performance. Both are going to change the way we think about databases for the next few decades. And, from the content management side Drupal has become the ‘go-to’ open source software for the publication and management of website content.\r\n \r\nIn this session, Jonathan Bryce, co-founder of The Rackspace Cloud, will discuss the recent movement – from both developer and vendor – for open cloud initiatives, while also addressing: \r\n \r\n* A basic overview of Cassandra, Drizzle and Drupal with case scenarios for each \r\n* The unique ways cloud providers are working with open database projects to maximize user experience \r\n* Traditional, distributed and non-relational databases \r\n* Enhancing site scale and performance by taking advantage of cloud-based file storage/CDN \r\n"}, "470": {"website": null, "user_id": null, "submitted_at": "2010-03-29T15:44:24-07:00", "title": "Social Change with Plone", "event_id": 2011, "created_at": "2010-03-29T15:44:24-07:00", "updated_at": "2010-03-29T15:44:24-07:00", "presenter": null, "affiliation": null, "id": 470, "biography": null, "description": "Plone's core features and extensive library of add-ons has made it the CMS of choice for organizations such as YES! Magazine, Oxfam America, and Green for All.\r\n\r\nDrupal has garnered most of the attention in this space, but in certain cases, Plone is a better choice. Learn about distinguishing features such as Plone's powerful native workflow and permissions structures; its strong internationalization and translation machinery; its user-friendly form creation add-on. We'll pay particular attention to social-change-specific features such as Megaphone, an online advocacy tool; and Plone's suite of CRM integrations.\r\n\r\nIn addition to learning about what sets Plone apart from its peers, we'll note its weaknesses and caveats."}, "293": {"website": null, "user_id": null, "submitted_at": "2010-02-20T18:57:46-08:00", "title": "The Story of Spaz: How to Give Away Everything, Make No Money, and Still Win", "event_id": 2011, "created_at": "2010-02-20T18:57:46-08:00", "updated_at": "2010-05-25T14:01:11-07:00", "presenter": null, "affiliation": null, "id": 293, "biography": null, "description": "\"Spaz\":http://getspaz.com is a mature, open source, free desktop and mobile client for Windows, Mac, Linux, and Palm webOS. Started in Spring of 2007, Spaz is one of the oldest Twitter clients available still under active development. Other systems have gone on to great commercial and popular success, but Spaz still continues to plug along, driven by a commitment to open standards, transparency, and community.\r\n\r\nThis talk will cover the history of Spaz's development, from early successes and awards, to competition from well-funded closed source projects, to the transition onto mobile, and finding a sustainable niche where it continues to grow.\r\n\r\nSpecific topics we'll cover include:\r\n\r\n* Changing how you measure success\r\n* Ignoring what everyone tells you about being successful\r\n* Doing it for love, not money\r\n* How one user can be more important than 100,000 downloads\r\n* What to expect when you open your code\r\n* Getting others involved in your project\r\n* Creating a codebase for multiple platforms and systems\r\n* Being open on a closed platform"}, "322": {"website": null, "user_id": null, "submitted_at": "2010-03-12T09:09:23-08:00", "title": "Mapping with Drupal", "event_id": 2011, "created_at": "2010-03-12T09:09:23-08:00", "updated_at": "2010-03-12T09:11:47-08:00", "presenter": null, "affiliation": null, "id": 322, "biography": null, "description": "\"Drupal\":http://drupal.org is fast becoming the open source framework of choice for building everything from brochureware sites as prominent as \"WhiteHouse.gov\":http://WhiteHouse.gov to complex applications like \"OpenAtrium\":http://openatrium.com. Among the keys to its success are its ability to create structured content types with custom fields and a powerful query engine to return data from those fields in varying formats. This lays the groundwork for a variety of mapping solutions, from simply displaying points on a map to rendering a geographic region via SVG.\r\n\r\nThis presentation will roughly be divided between the _backend_ mechanisms for storing and querying data, and the _frontend_, or display, options for rendering and interacting with the data. Both areas will cover the state of the art community modules, configuration options, and how to approach custom development for more complex applications.  \r\n\r\nWe'll also discuss how the various open source mapping libraries, like \"OpenLayers\":http://openlayers.org and \"Mapstraction\":http://mapstraction.com, are being integrated into Drupal."}, "323": {"website": null, "user_id": null, "submitted_at": "2010-03-13T15:14:47-08:00", "title": "Building A Mesh Network Wireless Temperature Sensor", "event_id": 2011, "created_at": "2010-03-13T15:14:47-08:00", "updated_at": "2010-05-15T14:36:31-07:00", "presenter": null, "affiliation": null, "id": 323, "biography": null, "description": "I wanted to be able to monitor temperatures in multiple locations in my house so that I could tell if changes made in the HVAC system were working or not. Although a commercial solution would be easiest to implement, I decided to build my own instead. I designed a simple wireless temperature sensor around a Digi XBee wireless module that would send temperature readings at regular intervals. The next step was to build software to interface with the wireless sensors and capture the data that they were sending. The interface software (called XBeeLib) uses Apache Mina as a major component to handle translation of packets to and from the wireless modules. The monitoring software (called pHomeNet) is a Java-based system running on the Apache Felix OSGi container. Observations from the sensors are recorded into a database (Apache Derby by default). Although the system is currently focused on recording temperature sensor data, it could easily be adapted to record data from other sensors or even to control devices based on sensor inputs.  This presentation will delve into the hardware and software aspects of the system, although with more emphasis on the software and the role that packages such as Apache Felix and Apache Mina play in the system."}, "320": {"website": null, "user_id": null, "submitted_at": "2010-03-11T12:15:19-08:00", "title": "The Second Step: HOWTO encourage open source work at for-profits", "event_id": 2011, "created_at": "2010-03-11T12:15:19-08:00", "updated_at": "2010-05-15T14:27:12-07:00", "presenter": null, "affiliation": null, "id": 320, "biography": null, "description": "You might not even realize what obstacles are blocking your colleagues from efficiently collaborating with FLOSS projects. In this presentation, you'll learn how to take the next step in encouraging employees to contribute to FLOSS, with specific recommendations for fixing these issues.\r\n\r\nI'll introduce tools you can use, such as:\r\n\r\n* tuned employee performance criteria and appraisals\r\n* FLOSS-friendly project management strategies\r\n* sneaky-yet-sensible PR\r\n\r\nI'll mine my experience as lead project manager and personnel manager at Collabora for examples.  And I want to hear your experience and suggestions, too -- for example, can FLOSS leaders help with tactics like sensible copyright assignment policies?"}, "321": {"website": null, "user_id": null, "submitted_at": "2010-03-11T20:37:54-08:00", "title": "Help! My webapp is slow and I don't know what to do!", "event_id": 2011, "created_at": "2010-03-11T20:37:54-08:00", "updated_at": "2010-03-11T20:37:54-08:00", "presenter": null, "affiliation": null, "id": 321, "biography": null, "description": "This talk will introduce the basics of web application performance tuning through the use of an example: finding (and fixing) bottlenecks in a site based on the \"Moodle\":http://www.moodle.org learning management system.\r\n\r\nThe approach presented will highlight the importance of finding bottlenecks by taking real-world measurements and addressing the most important problems first. The initial assessment and investigation will consist of introducing and demonstrating the use of a few common UNIX tools. The solutions will involve some environment-specific changes as well as some general system configuration tweaks.\r\n\r\nWeb application developers and admins should leave this talk better equipped at making their particular sites faster, regardless of the specific details of their application or hosting environment.\r\n\r\nThere are things you can do before completely re-engineering your application backend or diving into hard-core database optimizations!"}, "326": {"website": null, "user_id": null, "submitted_at": "2010-03-14T14:01:01-07:00", "title": "Multicore Haskell Now!", "event_id": 2011, "created_at": "2010-03-14T14:01:01-07:00", "updated_at": "2010-05-15T14:20:24-07:00", "presenter": null, "affiliation": null, "id": 326, "biography": null, "description": "Haskell is a functional language built for parallel and concurrent programming. You can take an off-the-shelf copy of GHC and write high performance parallel programs right now. This tutorial will teach you how to exploit parallelism through Haskell on your commodity multicore machine, to make your code faster. We will introduce key parallel programming models, as implemented in Haskell, including:\r\n\r\n * semi-explicit parallelism via sparks\r\n * explicit parallelism via threads and shared memory\r\n * software transactional memory\r\n\r\nand look at how to build faster programs using these abstractions. We will also look at the engineering considerations when writing  parallel programs, and the tools Haskell provides for debugging and reasoning about parallel programs.\r\n\r\nThis is a hands on tutorial session: bring your laptops, there will be code!"}, "327": {"website": null, "user_id": null, "submitted_at": "2010-03-14T19:08:02-07:00", "title": "SugarCRM - Your next open source business application framework", "event_id": 2011, "created_at": "2010-03-14T19:08:02-07:00", "updated_at": "2010-03-14T19:08:02-07:00", "presenter": null, "affiliation": null, "id": 327, "biography": null, "description": "SugarCRM is the world’s leading provider of commercial open source CRM software, available in both an On-Demand and On-Premise version and comes with an open source license. What most people don’t realize is that SugarCRM is also a very extensible and easy to use open source business application platform, enabling you to automate and manage your organization’s processes with ease, building upon a powerful application framework tailor made for business applications. In this talk we’ll explore the platform and what all it provides, and show how easy it is to customize and build upon it from the GUI as well as through writing PHP  code."}, "324": {"website": null, "user_id": null, "submitted_at": "2010-03-13T17:44:56-08:00", "title": "Gerrit what is it?  can I try it out?", "event_id": 2011, "created_at": "2010-03-13T17:44:56-08:00", "updated_at": "2010-03-13T17:56:51-08:00", "presenter": null, "affiliation": null, "id": 324, "biography": null, "description": "http://code.google.com/p/gerrit/\r\n\r\nGerrit is a code review and collaboration tool Google created as part of the Android open source project.  It provides a way for code to be submitted, reviewed, approved/rejected, and merged into a larger collaborative work.  All without having to expose your integration build code base to direct access from the contributors.\r\n\r\nIt offers a source code and build control model where gate keepers control the check in and advancing of a code base.  See http://review.source.android.com for an example of how it is used in practice.\r\n\r\nThis talk will be about what Gerrit is, how to set up a test Gerrit in a VBox, how it works, and how it could grow on you after you use it a bit."}, "325": {"website": null, "user_id": null, "submitted_at": "2010-03-13T21:01:40-08:00", "title": "21 Rules for Software Consulting", "event_id": 2011, "created_at": "2010-03-13T21:01:40-08:00", "updated_at": "2010-03-13T21:01:40-08:00", "presenter": null, "affiliation": null, "id": 325, "biography": null, "description": "Do you have what it takes to succeed as a software consultant?  Or will you crash and burn out in an avalanche of missed deadlines, overdue bills and litigious former clients? Learn the 21 rules and you have a much better chance of surviving, or even succeeding.\r\n\r\nIn this lightning seminar, Josh Berkus, a freelance database consultant of 15 years' experience, will teach you about client management, contracting, estimates, project management, and billing.  While not a complete education on running a consulting business, these rules of thumb have been popular and useful to freelancers around the world for years.\r\n\r\nDon't go tear your hair out or go bankrupt ... learn the rules."}, "476": {"website": null, "user_id": null, "submitted_at": "2010-03-29T22:03:07-07:00", "title": "Geek Choir", "event_id": 2011, "created_at": "2010-03-29T22:03:07-07:00", "updated_at": "2010-05-15T14:29:24-07:00", "presenter": null, "affiliation": null, "id": 476, "biography": null, "description": "Over the years, many have observed the connection between mathematics and music. In this session, we’ll discuss various OSS  tools for music notation and recording, as well as copyright issues, tips on arranging for various ensembles, and online archives of public domain music. But, mostly, we’ll sing, as we did at last year's OSB Unconference. :)\r\n"}, "328": {"website": null, "user_id": null, "submitted_at": "2010-03-14T19:09:08-07:00", "title": "Developing easily deployable PHP Applications", "event_id": 2011, "created_at": "2010-03-14T19:09:08-07:00", "updated_at": "2010-03-14T19:18:08-07:00", "presenter": null, "affiliation": null, "id": 328, "biography": null, "description": "Here’s the scenario: you’ve wrote a PHP application that is designed to run on Linux, Apache, and MySQL Now you have a customer that wants to run it on Windows. Or using Oracle. Or they like Memcache instead of APC. How do you do it, without sacrificing performance, stability, simplicity, and your own sanity?\r\n\r\nIn this talk, we’ll look at how we approached this problem at SugarCRM, and what lessons we learned in the process.\r\n"}, "329": {"website": null, "user_id": null, "submitted_at": "2010-03-14T19:09:55-07:00", "title": "Making software management tools work for you", "event_id": 2011, "created_at": "2010-03-14T19:09:55-07:00", "updated_at": "2010-03-14T19:09:55-07:00", "presenter": null, "affiliation": null, "id": 329, "biography": null, "description": "With the advent of such rich open source tools such as Subversion, Git, Trac, CruiseControl, and Review Board, managing software projects of any size has become much easier than ever. But how do you best use these tools in your organization? In this talk we'll look at how these tools can fit into any software project, helping you make your team more efficient than before."}, "406": {"website": null, "user_id": null, "submitted_at": "2010-03-25T15:45:52-07:00", "title": "Application latencies and the crazy things in Linux you can do for them", "event_id": 2011, "created_at": "2010-03-25T15:45:52-07:00", "updated_at": "2010-03-25T15:45:52-07:00", "presenter": null, "affiliation": null, "id": 406, "biography": null, "description": "Users buy faster hardware, more memory, better disks, and try and tune their systems all in an effort to \"get faster\", that elusive goal. \r\n\r\nThis can be helpful sometimes, but what might help througput, sometimes affects latency adversely.  Or system determinism. Is your application latency-sensitive? Do you have deterministic requirements? Can real-time scheduling and priorities help? And most importantly, what do all these terms mean, anyway? \r\n\r\nSome tools, techniques and tuning tips to assist low latency and real-time applications (and how to tell them apart). \r\n\r\n\r\n\r\n"}, "477": {"website": null, "user_id": null, "submitted_at": "2010-03-29T22:44:22-07:00", "title": "Dynamic Sublists in GNU Mailman", "event_id": 2011, "created_at": "2010-03-29T22:44:22-07:00", "updated_at": "2010-04-20T21:50:18-07:00", "presenter": null, "affiliation": null, "id": 477, "biography": null, "description": "Come hear how Systers - the largest and oldest mailing list for women in technology implements dynamic sublists for GNU mailman to allow subscribers to leave conversations without leaving the list."}, "474": {"website": null, "user_id": null, "submitted_at": "2010-03-29T21:02:11-07:00", "title": "X Marks the Spot: Applying OpenStreetMap to the High Seas", "event_id": 2011, "created_at": "2010-03-29T21:02:11-07:00", "updated_at": "2010-05-15T14:45:46-07:00", "presenter": null, "affiliation": null, "id": 474, "biography": null, "description": "The United States has a treasure trove of nautical charts in digital form, including plots of shipwrecks, navigation buoys, coastal and river depths, and other fine booty. OpenStreetMap is an open source, open format collaborative project for building a free map of the world. Join this session to find out more of the marine secrets of the National Oceanographic and Atmospheric Administration (NOAA), OpenSeaMap's plans to extend OSM to the high seas, and splicing the two (and your mainbrace) together. We'll use the Geospatial Data Abstraction Library (GDAL), OGR, Python, and the OSM API."}, "350": {"website": null, "user_id": null, "submitted_at": "2010-03-20T18:02:05-07:00", "title": "Test Driven Database Development", "event_id": 2011, "created_at": "2010-03-20T18:02:05-07:00", "updated_at": "2010-03-20T18:02:05-07:00", "presenter": null, "affiliation": null, "id": 350, "biography": null, "description": "Creating a database schema means creating an interface for applications to use to manage their data. But how do you know how well that interface works until you've tried it?\r\n\r\nWell, by trying it before you create it.\r\n\r\nThis talk introduces the concept of \"test-driven development\":http://en.wikipedia.org/wiki/Test-driven_development to database administrators. We'll use \"pgTAP\":http://pgtap.org/ to work through a real-world example creating a database design with an intuitive, useful interface for managing application data. Derive more intuitive table structures! Keep an eye to the beauty of your views! Let your procedures make your application more productive! Feel younger and more clever, all through the power of TDDD!\r\n"}, "486": {"website": null, "user_id": null, "submitted_at": "2010-03-29T23:59:33-07:00", "title": "How to write quality software using the magic of tests", "event_id": 2011, "created_at": "2010-03-29T23:59:33-07:00", "updated_at": "2010-05-15T14:35:10-07:00", "presenter": null, "affiliation": null, "id": 486, "biography": null, "description": "This talk will cover a lot of ground, and will be of most value to software developers that are new to testing or trying to improve their mastery of it.\r\n\r\nDiscussion to help you answer:\r\n- How to prove the value of testing to bosses and clients?\r\n- How to decide how much to test and how?\r\n- How to rescue a troubled project?\r\n- How to cope with deadlines?\r\n\r\nMaking good use of practices like:\r\n- Test Driven Development (TDD)\r\n- Behavior Driven Development (BDD)\r\n- Code coverage\r\n- Continuous integration\r\n- Assertions and exception notification\r\n\r\nKinds of tests, along with their benefits, open source tools and sample code:\r\n- Unit\r\n- Functional\r\n- Integration\r\n- System\r\n- Load\r\n\r\nTesting application state and sample code for using:\r\n- Instantiations\r\n- Stubs\r\n- Mocks\r\n- Fixtures\r\n- Factories\r\n\r\n...and more! Audience questions will be welcomed."}, "485": {"website": null, "user_id": null, "submitted_at": "2010-03-29T23:59:27-07:00", "title": "Wikipedia's Usability Initiative: Making MediaWiki (More) User-Friendly", "event_id": 2011, "created_at": "2010-03-29T23:59:27-07:00", "updated_at": "2010-04-20T21:50:01-07:00", "presenter": null, "affiliation": null, "id": 485, "biography": null, "description": "Wikipedia may be everyone's favorite online reference work, but its software is stuck in 2004. Without a usability overhaul or major redesign of Wikipedia's skin since then, MediaWiki's now on the ugly and arcane end of the open source wiki spectrum. \r\n\r\nThere is hope for the future though. Kicked off by an $890,000 grant and now a permanent part of the Wikimedia Foundation team, the Wikipedia Usability Initiative is set to change MediaWiki's look and feel in ways that will affect both readers and editors of Wikipedia. \r\n\r\nBy late April, you'll have noticed the first major change: the adoption of the Vector skin as the public default for Wikipedia. This is merely the beginning, however. I'll show you the new tricks up our collective sleeve, and hopefully change your perspective on the future of open source wiki software. "}, "484": {"website": null, "user_id": null, "submitted_at": "2010-03-29T23:58:00-07:00", "title": "Your Internets are Leaking", "event_id": 2011, "created_at": "2010-03-29T23:58:00-07:00", "updated_at": "2010-05-15T14:44:58-07:00", "presenter": null, "affiliation": null, "id": 484, "biography": null, "description": "Using FTP, telnet (some of you must still be using telnet), sending mail, surfing gopher, and visiting web sites can all give away personal information and passwords.\r\n\r\nWe'll show how easy it is for your traffic to be intercepted (using open source tools) and what you can do to protect yourself (also using open source tools).\r\n\r\nIncluding such excitement as:\r\n    * Packet sniffers and you\r\n    * The dark and ancient magic of SSL certificates\r\n    * Man/woman in the middle attacks\r\n    * Working around and tunneling through insecure networks\r\n    * Quitting passwords cold turkey with public keys and other tools\r\n    * Charts! Graphs! \r\n    * Public shaming!\r\n    * (and possibly more)\r\n"}, "483": {"website": null, "user_id": null, "submitted_at": "2010-03-29T23:56:27-07:00", "title": "The Open Geo Stack", "event_id": 2011, "created_at": "2010-03-29T23:56:27-07:00", "updated_at": "2010-05-15T14:25:44-07:00", "presenter": null, "affiliation": null, "id": 483, "biography": null, "description": "The open geo stack includes:\r\n* JavaScript APIs\r\n* Tile styling\r\n* Tile server\r\n* Geo databases"}, "482": {"website": null, "user_id": null, "submitted_at": "2010-03-29T23:46:45-07:00", "title": "PostgreSQL Techniques for Django Developers", "event_id": 2011, "created_at": "2010-03-29T23:46:45-07:00", "updated_at": "2010-03-29T23:46:45-07:00", "presenter": null, "affiliation": null, "id": 482, "biography": null, "description": "The Python web application framework Django includes PostgreSQL support right out of the box, and has become one of most popular ways of deploying a PostgreSQL-backed web application. As with all powerful tools, naive use of PostgreSQL in Django can produce less-than-spectacular results.\r\n\r\nThis talk will discuss (through both positive and negative examples) the best way of getting the most out of PostgreSQL through Django. Topics will include:\r\n\r\n* Schema design patterns for Django.\r\n* ORM techniques for maximum database performance.\r\n* Transaction management, including techniques specific to PostgreSQL.\r\n* Extending PostgreSQL, and exploiting those extensions in Django."}, "481": {"website": null, "user_id": null, "submitted_at": "2010-03-29T23:44:51-07:00", "title": "'But It's Broken!' Advice for First-Time FOSS Project Patch Submitters", "event_id": 2011, "created_at": "2010-03-29T23:44:51-07:00", "updated_at": "2010-04-20T21:50:10-07:00", "presenter": null, "affiliation": null, "id": 481, "biography": null, "description": "FOSS projects thrive on (indeed, depend on) a constant stream of patches from participants who are not part of the core team of committers. From the outside, the group of people whose patches are selected can appears as exclusive a club as the Order of the Garter. But every core member was a first time submitter once, approaching with their first patch in hand.\r\n\r\nWe’ll go over how to join and participate with a FOSS community, whether functional or dysfunctional. Every commit has its mores, standards, and quirks, as well as more objective requirements on how to get a patch (whether a feature or fix) into the codebase. Knowing what each community likes to see in a patch, what kinds of features will be well-regarded and which ones will be dismissed out of hand, and learning how to mesh with a group of people just as smart and opinionated as you are all of the essence."}, "480": {"website": null, "user_id": null, "submitted_at": "2010-03-29T23:44:32-07:00", "title": "Making Robots Accessible to Everyone", "event_id": 2011, "created_at": "2010-03-29T23:44:32-07:00", "updated_at": "2010-05-15T14:37:46-07:00", "presenter": null, "affiliation": null, "id": 480, "biography": null, "description": "Adeilton Oliveira, an electronics engineer in Brazil, has written code that allows the Arduino microcontroller platform to use the output from CTI Blocos to control its outputs.  CTI Blocos is an open source block based programming environment based on the logo language.  Think of Blocos as a very lean version of Scratch that is designed to control a robot (or anything else electro-mechanical that you can think of) rather than multimedia on your computer.  \r\n\r\nI built a prototype for my (then) 4-year old son to play with.  He doesn't know the ins and outs of If-Then-Else statements yet, but he was able to drag-and-drop the motor control blocks and download the programs into the robot within the first hour.  I then built a set of 6 robots and taught an after-school class to 4-8 grade students at Faubion in NE Portland.\r\n\r\nThe software wasn't quite ready for prime time when I started teaching the class, so I was very fortunate that Jim Larson, a software/hardware engineer here in Portland joined in and together we collaborated with others in Brazil to further develop the software to better meet the needs of the students.\r\n\r\nWhat we have is:\r\n- A robot that costs about $40-50 to make\r\n- All open-source software\r\n- Mostly open-source hardware\r\n- Can be used with Windows, Mac OS X, and Linux\r\n- Uses Logo based commands\r\n- Simple, easy to assemble command blocks eliminates syntax frustrations\r\n- The software also accepts Cricket Logo, a text based language \r\n- And most importantly: It's just plain FUN to use!\r\n\r\nJim Larson, myself, and others in Brazil continue to gather and develop resources to help others that want to try it themselves or, hopefully, teach classes to kids and introduce them to programming/electronics/robotics.\r\n\r\nI am starting to put together resources at the following website:\r\nhttp://home.teleport.com/~brettn/babuinobot/\r\n"}, "435": {"website": null, "user_id": null, "submitted_at": "2010-03-25T21:29:21-07:00", "title": "Professional JavaScript", "event_id": 2011, "created_at": "2010-03-25T21:29:21-07:00", "updated_at": "2010-05-15T14:31:19-07:00", "presenter": null, "affiliation": null, "id": 435, "biography": null, "description": "This talk will examine some of the features that make JavaScript stand out, including its functional roots, its ultra-simple object-oriented implementation, and the details of event-based concurrency.  All of these can seem quite alien when coming from a background in a different language.  I will talk about how to get the best use out of these features - and I hope to show that the things that make JavaScript different are also its greatest strengths.\r\n\r\nI will also go over common pitfalls in JavaScript development.  These are non-obvious traps that unfortunately can put people off of JavaScript when they cause programs to behave in unexpected ways.  As Douglas Crockford puts it, these are the \"bad parts\" that anyone who is working with JavaScript should be aware of.\r\n\r\nFinally I will introduce some techniques for writing well-structured code for the client portion of a web application.  Specifically I will talk about my own experiences using a model-view-controller pattern, making the best of JavaScript's object-oriented features, and using events to implement re-usable components.\r\n\r\nThere is a lot of ground to cover when it comes to the best practices of an entire language.  So I will introduce topics and point you to resources for learning more.  I also expect lots of questions.  I am most interested in getting people the information that they want; so your questions will help to guide this session so that it is as useful as possible for everybody."}, "291": {"website": null, "user_id": null, "submitted_at": "2010-02-20T02:14:56-08:00", "title": "Unlikely tools for pair programming", "event_id": 2011, "created_at": "2010-02-20T02:14:56-08:00", "updated_at": "2010-05-21T07:32:21-07:00", "presenter": null, "affiliation": null, "id": 291, "biography": null, "description": "Open Source distributed hacking is awesome, but you knew that already. Pair programming is awesome too, and you might not have known that yet. But Open Source hackers don’t tend to do much pair programming, except perhaps at the occasional conference hack session. We want to show you some tools and techniques for pair programming in a distributed manner, and some case studies where we solved hard problems this way. And we want to hear about your favorite tips and tricks for collaboration."}, "357": {"website": null, "user_id": null, "submitted_at": "2010-03-23T10:35:59-07:00", "title": "Relational vs. Non-Relational", "event_id": 2011, "created_at": "2010-03-23T10:35:59-07:00", "updated_at": "2010-05-15T14:37:47-07:00", "presenter": null, "affiliation": null, "id": 357, "biography": null, "description": "What kind of database do you need?\r\n\r\nThanks to new database projects like CouchDB, TokyoCabinet, Solr and others, there are more non-relational database options available than ever for developers. Yet good information on how to choose what kind of database you need is still scarce. We'll cure that in this talk.\r\n\r\nWhen do you want to use a SQL-relational database? When do you want to use a non-relational database? What are the types of non-relational databases available today? What kinds of things is each well-suited for?\r\n\r\nDatabase geek Josh Berkus will explain how to evaluate the database tasks you need to accomplish, and put you on the road to choosing the database product ... or more likely, products ... which are right for you."}, "356": {"website": null, "user_id": null, "submitted_at": "2010-03-22T22:34:14-07:00", "title": "Rockstar business", "event_id": 2011, "created_at": "2010-03-22T22:34:14-07:00", "updated_at": "2010-03-22T22:34:14-07:00", "presenter": null, "affiliation": null, "id": 356, "biography": null, "description": "A sharply focused presentation followed by a panel of Slate technologies management explaining how to build brand awareness without a budget and to always be selling your product without reducing it to a bunch of empty hype. "}, "355": {"website": null, "user_id": null, "submitted_at": "2010-03-22T21:32:03-07:00", "title": "The Naive Developer's Guide to Venture Capital", "event_id": 2011, "created_at": "2010-03-22T21:32:03-07:00", "updated_at": "2010-05-15T14:28:43-07:00", "presenter": null, "affiliation": null, "id": 355, "biography": null, "description": "Brutally frank whirlwind overview of the venture process, including:\r\n\r\n*  The basic steps of the dance\r\n*  The two and a half people you need to know in Silicon Valley\r\n*  The three big mistakes that instantly mark you as a n00b\r\n*  What a founding team looks like\r\n*  If you need a pitch deck, you've already lost\r\n*  The poorly-understood long-term consequences of angel money\r\n*  What FOSS-based businesses should NEVER get funded\r\n*  The single most important term to negotiate (not what you think!)\r\n*  Sound like a founder:  a glossary of VC-related terms to throw around\r\n\r\nYou wouldn't dream of hacking on software without understanding roughly how it works... arm yourself with an overview of how the VC system works before you need it."}, "354": {"website": null, "user_id": null, "submitted_at": "2010-03-22T12:36:01-07:00", "title": "Open Source IT Security: Tools and Tricks", "event_id": 2011, "created_at": "2010-03-22T12:36:01-07:00", "updated_at": "2010-04-26T12:42:44-07:00", "presenter": null, "affiliation": null, "id": 354, "biography": null, "description": "Five simple steps to improve IT Security and lower risks in your online community or company.  In this talk we will present several Open Source tools that can automate much of the routine security tasks you need to do.  Talk will have practical examples including centralized logging, network security scanning, automatic reporting, automatic notification,  intrusion detection and integrated tools that do it \"all\".   "}, "353": {"website": null, "user_id": null, "submitted_at": "2010-03-22T10:37:05-07:00", "title": "When Everything Looks Like A Nail", "event_id": 2011, "created_at": "2010-03-22T10:37:05-07:00", "updated_at": "2010-05-15T14:20:00-07:00", "presenter": null, "affiliation": null, "id": 353, "biography": null, "description": "    _A Somewhat Constrained Edition of The Matt & Markus Show_\r\n\r\nIt's said that if the only tool you have is a hammer, everything looks like a nail.  It isn't true of course, unless you're the sort of person that goes around hammering nails into other nails, which would be silly.\r\n\r\nBut how not true is it, really?  Is it totally not true, or only a little bit not true?  Do just a few more things look like nails?  Lots of things?  Maybe even most things?  Or is this just some dumb platitude that doesn't stand up to serious empirical investigation?  \r\n\r\nThere's only two ways to find out--you can either try it and see or, if your time is even remotely valuable or your sanity a treasure to cherish, you can come watch someone else try it (pointing and laughing optional).\r\n\r\nSo come join the fun as we wallop our way through the world.  Cautious individuals planning to sit in the first three rows may want to wear a raincoat; it won't protect you in the slightest but if we forget what we were going to say we can always make remarks about your attire to get a cheap laugh.\r\n"}, "352": {"website": null, "user_id": null, "submitted_at": "2010-03-22T09:31:19-07:00", "title": "How to learn to parse huge XML documents by doing it wrong for 5 years", "event_id": 2011, "created_at": "2010-03-22T09:31:19-07:00", "updated_at": "2010-03-22T09:31:19-07:00", "presenter": null, "affiliation": null, "id": 352, "biography": null, "description": "When XML documents can't fit into memory the vast majority of solutions available on CPAN are no longer available to you; when the XML documents are so large they take up to 16 hours to process with the standard tools for handling large documents your hands are tied even more. Tyler Riddle will cover his learning experiences creating the Parse::MediaWikiDump, XML::TreePuller, and MediaWiki::DumpFile modules which are made to handle the 24 gigabyte English Wikipedia dump files in a reasonable time frame.\r\n\r\nMajor topics:\r\n\r\n1) Real world benchmarks of C and perl libraries used to process huge XML documents.\r\n\r\n2) The dirty little secret about XS and what it means for you in this context.\r\n\r\n3) The evolution of the implementation of a nice interface around event oriented (SAX style) XML parsing.\r\n\r\n4) Why XML::TreePuller is what you need for huge documents\r\n"}, "351": {"website": null, "user_id": null, "submitted_at": "2010-03-21T20:19:50-07:00", "title": "Harnessing Java with Scala", "event_id": 2011, "created_at": "2010-03-21T20:19:50-07:00", "updated_at": "2010-03-21T20:19:50-07:00", "presenter": null, "affiliation": null, "id": 351, "biography": null, "description": "Scala is fast becoming the \"next Java\" in the eyes of many leaders in the Java world. Besides it's powerful integration of the object-oriented and functional programming paradigms, it has strong capabilities for integrating with existing Java code. One very effective mechanism for bringing Scala into your environment is to use it for exploring the capabilities of Java libraries. Every experienced Java developer understands the pain of setting up the scaffolding needed to try out a new library (not to mention the well known \"dependency hell\" that comes along for the ride). With Scala and the tools available with it, you can reduce this pain by orders of magnitude. This talk will briefly introduce Scala and Simple Build Tool and then move on to show you how to quickly get started integrating Java libraries and exploring them in code. Through these examples, you will also learn how make use of Scala alongside your existing code."}, "475": {"website": null, "user_id": null, "submitted_at": "2010-03-29T21:24:31-07:00", "title": "The Complex Ethics of Piracy", "event_id": 2011, "created_at": "2010-03-29T21:24:31-07:00", "updated_at": "2010-05-03T17:40:22-07:00", "presenter": null, "affiliation": null, "id": 475, "biography": null, "description": "Despite a decade of the war on file sharing, copyright piracy continues to be a widespread social phenomenon.\r\n\r\nDebates about the ethical status of piracy are often bipolar: copyright holders attempt to equate piracy with \"theft\", while hacker and pirate groups argue that copyright is unsustainable and view piracy as good, inevitable, or promoting of renewal in cultural industries. Informally, some file sharers defend a position along the lines of \"I pirate music, but then I buy CDs from the bands I like\" or \"I pirate major label music but buy independent artists' CDs\".\r\n\r\nThis talk examines the coherence of these positions. Is piracy ever \"theft\" in an ethical sense? If it's not theft, is it selfish? Is pirating major label music an ethically defensible form of civil disobedience? If it was ethical to engage in piracy as a form of protest, would that create an obligation to engage in piracy?\r\n\r\nThe conclusions are complex. The ethical status of piracy turns out to depend on difficult social choices about justice and aesthetic priorities, on what is being copied, and on who is copying it. On some theories, even if there are limited circumstances in which piracy is justified as a form of civil disobedience, many file sharers go too far with their actions. On the other hand, there may be circumstances in which there are weak ethical obligations to pirate things, and non-pirates could be said to be ignoring those obligations."}, "478": {"website": null, "user_id": null, "submitted_at": "2010-03-29T23:01:00-07:00", "title": "Free Speech, Free Software Across the World ", "event_id": 2011, "created_at": "2010-03-29T23:01:00-07:00", "updated_at": "2010-05-15T14:18:03-07:00", "presenter": null, "affiliation": null, "id": 478, "biography": null, "description": "The Committee to Protect Journalists monitors and coordinates assistance globally for those persecuted for their reporting, newsgathering, or analysis.  Last year, for the first time, their records show that half of those jailed for speaking freely worked on the Internet: as bloggers, online reporters or Web editors.  \r\n\r\nThis talk draws on the current experiences of these writers and speakers in repressive regimes who use FLOSS software at the frontiers of free speech: what works, and what doesn't. We'll develop a TODO list: tools that currently don't exist but which those working for free expression most desperately need. And we'll look at newest tools within open source's own cultural repository, from secure IM to distributed version control, and how they might be expanded and developed to enhance and defend free speech in every corner of the globe."}, "479": {"website": null, "user_id": null, "submitted_at": "2010-03-29T23:04:11-07:00", "title": "Constructing Effective Arguments", "event_id": 2011, "created_at": "2010-03-29T23:04:11-07:00", "updated_at": "2010-03-29T23:04:11-07:00", "presenter": null, "affiliation": null, "id": 479, "biography": null, "description": "Learn effective argument construction from a former debate champion who drives her family and friends crazy with her propensity to argue about well, everything.  We'll cover basic argument construction including claims, evidence and warrants and knowing when to use what types of claims - value, factual or policy and how to support those claims with evidence.  \r\n\r\n\r\n\r\n\r\n\r\n"}, "359": {"website": null, "user_id": null, "submitted_at": "2010-03-23T10:48:46-07:00", "title": "\"Thoughtcrime Experiments\": CC/FLOSS Lessons From A DIY Sci-Fi Anthology", "event_id": 2011, "created_at": "2010-03-23T10:48:46-07:00", "updated_at": "2010-04-26T12:42:50-07:00", "presenter": null, "affiliation": null, "id": 359, "biography": null, "description": "My partner and I called for submissions, read and sorted about 250 stories, commissioned art, laid out the pages, and published the book online and as a $5 print-on-demand paperback.\r\n\r\n*\"Freedom to Tinker\":http://www.freedom-to-tinker.com/blog/appel/thoughtcrime-experiments* lauds \"Thoughtcrime Experiments\":http://thoughtcrime.crummy.com/: \r\n\r\n!>https://www.createspace.com/Img/T338/T18/T60/ThumbnailImage.jpg;jsessionid=ED6BC758F39B23EBC064F9F036D714E0.cspworker04!\r\n\r\nbq. It's an experiment in do-it-yourself paying-the-artists high-editorial-standards open-source Creative-Commons print-on-demand publishing.  Theorists like \"Yochai Benkler\":http://www.benkler.org/ and others have explained that production costs attributable to <i>communications and coordination</i> have been reduced down into the noise by the Internet, and that this enables \"peer production\" that was not possible back in the 19th and 20th centuries.  Now the \"Appendix to _Thoughtcrime Experiments_\":http://thoughtcrime.crummy.com/2009/AppendixA.html explains how to edit and produce your own anthology, complete with a \"sample publication contract\":http://thoughtcrime.crummy.com/2009/AppendixB.html.\r\n... part of the new theory of open-source peer-production asks questions like, \"What motivates people to produce technical or artistic works?  What mechanisms do they use to organize this work?  What is the quality of the work produced, and how does it contribute to society?  What are the legal frameworks that will encourage such work?\"  This anthology and its appendix provide an interesting datapoint for the theorists.\r\n\r\nI'll take you through the principles and logistics of \"How to Do This and Why\":http://thoughtcrime.crummy.com/2009/AppendixA.html, including tips for your CC or FLOSS project.  Topics include:\r\n\r\n* Outreach for gender and ethnic diversity\r\n* Outreach to tech novices\r\n* Rejecting people nicely\r\n* Budgeting time and money\r\n* Marketing\r\n* Developing and enforcing standards"}, "358": {"website": null, "user_id": null, "submitted_at": "2010-03-23T10:47:43-07:00", "title": "Introduction to PostgreSQL", "event_id": 2011, "created_at": "2010-03-23T10:47:43-07:00", "updated_at": "2010-05-15T14:36:25-07:00", "presenter": null, "affiliation": null, "id": 358, "biography": null, "description": "Interested in using PostgreSQL for you next project, or migrating to it?  This tutorial will go over the basics of PostgreSQL administration and database application design, including coverage of the features available in version 9.0.\r\n\r\nTopics to be covered include:\r\n\r\n* Installation & packaging options\r\n* Basic performance configuration\r\n* Basic security configuration\r\n* Creating your first database\r\n* Backups, PITR and Replication\r\n* Common administrative tasks\r\n* Application design patterns\r\n* Managing database changes over time\r\n* Special features you might not know about\r\n* Tools you're likely to need\r\n\r\nIn order to get the most out of this tutorial, all users should bring a laptop with PostgreSQL Version 8.4 and pgAdmin installed.  For users unfamiliar with installing PostgreSQL, the One-Click installer is here:  http://www.enterprisedb.com/products/postgres_plus/download.do"}}