{"website": "http://www.harris.com/", "affiliation": "Chief Architect, Harris Corporation", "name": "Nagesh Bashyam", "twitter": null, "id": 1713, "biography": "Nageshwara Bashyam (Technical, Key Personnel) has 15 years of experience in the design and development of information technology solutions. He is currently the Chief Architect for Harris Healthcare solutions responsible for creating the Harris Healthcare Enterprise Architecture and is also responsible for providing technical guidance to the <span class=\"caps\">NHIN CONNECT</span> team as needed. Prior to this, he was the software architect, systems architect, and integration lead for the Field Data Collection Automation (FDCA) project which is a large scale enterprise system consisting of 150,000 mobile devices, 15,000 workstations deployed across the country in 500 locations for the Bureau of Commerce. As part of the development of this system he performed many architecture trade studies to identify the right technology for complex problems such as Directory Services, Content Delivery across the country, Asynchronous Data Delivery, Workflow automation using <span class=\"caps\">BPEL</span>, Mobile Applications using <span class=\"caps\">GPS</span>, Security scanning tools, Audit solutions, and Identity and Access management solutions. He also provided the security architecture and guidelines to resolve many vulnerabilities to provide a secure infrastructure for the country&#8217;s major activity of the decade. He was instrumental is designing and implementing the <span class=\"caps\">COOP</span>/Disaster recovery operations for the system. In addition to the technical activities he was the chair of the <span class=\"caps\">CCB</span>&#8217;s and instituted the change management and software release and promotion processes coordinating across more than 10 organizations on a weekly basis. Prior to the <span class=\"caps\">FDCA</span> program, Mr. Bashyam was the technical architect who was instrumental in designing and implementing a Train Control and Planning System for Norfolk Southern that optimized railroad traffic to improve overall efficiency of the freight railroad network. As part of this program, he was key in architecting the infrastructure services for Custom Portals, Messaging, Data Acquisition, Track Database services, Disaster Recovery, software delivery and distribution process. In addition to the infrastructure he was the lead for the Movement Planning team which was the core business team that was transforming the railroad business by providing optimization solutions for railroad operations."}